Autodesk.AutoCAD.Runtime.CommandMethodAttribute
This class marks an instance or static function as a command. Command methods may be defined only in a class that is marked with the CommandClass attribute.