Autodesk.AutoCAD.ApplicationServices.Core.Application.Invoke(Autodesk.AutoCAD.DatabaseServices.ResultBuffer)
This .NET method wraps the ObjectARX function acedInvoke(). It invokes an external function defined in another ARX application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.QuitAborted
Wraps the AcEditorReactor.quitAborted() ObjectARX function. This notification occurs if a shutdown of AutoCAD is aborted, either by an individual veto() in beginQuit(), or by any other condition that would abort a shutdown such as canceling a prompted save of a document.

Autodesk.AutoCAD.ApplicationServices.Core.Application.QuitWillStart
Wraps the AcEditorReactor.quitWillStart() ObjectARX function. This notification occurs just after the beginQuit() notification if it has not been vetoed and just before shutdown processing begins.

Autodesk.AutoCAD.ApplicationServices.Core.Application.SystemVariableChanging
Wraps the AcEditorReactor.sysVarWillChange() ObjectARX function. This callback indicates that an attempt is being made to change the varName system variable. This callback provides applications with the ability to find out what the original value of the system variable was before the value changed.

Autodesk.AutoCAD.ApplicationServices.Core.Application.SystemVariableChanged
Wraps the AcEditorReactor.sysVarChanged() ObjectARX function. This callback indicates that an attempt was made to change the varName system variable. It does not indicate that the actual value was changed.

Autodesk.AutoCAD.ApplicationServices.Core.Application.IsInPlaceServer
Accesses the IsInPlaceServer property. TRUE indicates AutoCAD is running as an in-place server.

Autodesk.AutoCAD.ApplicationServices.Core.Application.IsInBackgroundMode
Accesses the IsInBackgroundMode property. TRUE indicates AutoCAD is running as a background plot.