Autodesk.AutoCAD.ApplicationServices.XrefFileLock.LockFile(Autodesk.AutoCAD.DatabaseServices.ObjectId)
The Xref file referenced by the selected BTR Id is exclusively write locked. Multiple readers are still allowed but are not guaranteed to be up to date. If the Xref file has an XLOADCTL system variable setting of 1 (demand loaded), then the current state is changed to XLOADCTL set to 0 (fully loaded) or 2 (copy). This allows the Xref file to be filelocked by this lock object. When it is released via the ReleaseFile() method, the XLOADCTL value for this block reference will remain (either 0 or 2).
selectedBlockId:  Block Table Record object ID to operate on

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.ReleaseFile
Releases, saves, and reloads the xref file with the new (edited) changes. All other block references that reference the same xref file will also be updated.

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.ConsistencyCheck(Autodesk.AutoCAD.DatabaseServices.ObjectId)
By providing a selected Xref block table record (BTR) ID, this method determines if its Xref file is still in sync with what was used at load drawing time. It also determines if any other block table records referencing the same Xref file are also in sync. This is done by checking its Xref file's time/date stamp and file size at load time against the actual ones during this method's execution. If it is out of sync, then all the block table record IDs that reference the Xref file are returned.
selectedBlockId:  Selected BTR object ID to operate on

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.ConsistencyCheck
By providing a selected Xref block table record (BTR) ID, this method determines if its Xref file is still in sync with what was used at load drawing time. It also determines if any other block table records referencing the same Xref file are also in sync. This is done by checking its Xref file's time/date stamp and file size at load time against the actual ones during this method's execution.

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.ReloadFile
Reloads the corresponding Xref file(s) from the list of Xref BTR Ids (out of sync) to the current drawing. This allows resynching an out of date Xref block by reloading its Xref file into the current drawing.

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.ReloadFile(System.Int32)
Reloads the corresponding Xref file(s) from the list of Xref BTR Ids (out of sync) to the current drawing. This allows resynching an out of date Xref block by reloading its Xref file into the current drawing.
xldCtlType:  XLOADCTL mode to reload with

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.ConsistencyCheckLocal(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This method is basically the same as the ConsistencyCheck() method, with one exception. Only the selected Xref block reference will be checked for out of sync condition. No other Xref block references that reference the same Xref file will be scanned and checked. This provides a quick check for consistency of a specific Xref block reference.
selectedBlockId:  Selected BTR object ID to operate on

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.GetXloadCtlType(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This method returns the XLOADCTL system variable value of the currently locked object. The xloadctlType() method is real time (determines the Xref object Id's mode when method is executed) and does not affect the locked object's mode value.
selectedBlockId:  Selected BTR object ID to operate on

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.OutOfSyncBlockIds
Accesses the internal out of sync BTR Ids that the object may be maintaining. One possible use is to 'highlight' these block references as ones that will reflect changes that are about to be made.