Autodesk.AutoCAD.PlottingServices.PlotLogger.StartJob
Indicates to the PlotLogger that the plot job has started. It is the responsibility of the plot application to call this method.

Autodesk.AutoCAD.PlottingServices.PlotLogger.EndJob
Indicates to the PlotLogger that the entire job has been completed. It is the responsibility of the plot application to call this method.

Autodesk.AutoCAD.PlottingServices.PlotLogger.StartSheet
Indicates to the PlotLogger that an individual sheet within a job has started. It is the responsibility of the plot application to call this method.

Autodesk.AutoCAD.PlottingServices.PlotLogger.EndSheet
Indicates to the PlotLogger that an individual sheet within a job has been completed. It is the responsibility of the plot application to call this method.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogTerminalError(System.String)
This method typically is called by the PlotLoggingErrorHandler. While a terminal error is assumed to end the plot job, EndSheet() and EndJob() should still be called, as appropriate.
message:  Input formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogAbortRetryIgnoreError(System.String)
This method typically is called by the PlotLoggingErrorHandler. While an abort error is assumed to end the plot job, EndSheet() and EndJob() should still be called, as appropriate.
message:  Input formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogSevereError(System.String)
This method typically is called by the PlotLoggingErrorHandler. While a severe error is assumed to end the plot job, EndSheet() and EndJob() should still be called, as appropriate.
message:  Input formatted error string to be recorded in the log.