Autodesk.AutoCAD.ApplicationServices.DocumentCollection.AppContextNewDocument(System.String)
This function allows synchronous access to the NEW drawing operation. It can only be called from the application context.
templateFileName:  Input path/filename or URL of template file to use

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.AppContextOpenDocument(System.String)
This function allows synchronous access to the OPEN drawing operation. It can only be called from the application context.
fileName:  Input path/filenam

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentToBeDestroyed
Wraps the AcApDocManagerReactor.documentToBeDestroyed() ObjectARX function.