Autodesk.AutoCAD.EditorInput.PointFilterResult
This class provides output data for the PointFilter event. It wraps the output parameters of the AcEdInputPointFilter.processInputPoint() ObjectARX function.