Autodesk.AutoCAD.EditorInput.Keyword.GlobalName
Gets or sets the global name of the keyword. This is never displayed and can be used by programs to access keywords without knowing the local translation.