Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.Add(Autodesk.AutoCAD.PlottingServices.DsdEntry)
Adds the object represented by value to this collection. Returns the zero-based index of the newly added collection item.
value:  Input object to be added.