Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.FullPath
Returns the current device or PC3 file name. This function always returns the full path name for PC3 files. It returns the entire UNC path name for system printers.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.DeviceName
Returns the device name or PC3 file name. This function always returns the file name portion of the name for a PC3 file. To get the full path name for a PC3 file, use FullPath. This function Returns the entire UNC path name for system printers.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.DeviceType
Read / Write.