Autodesk.AutoCAD.PlottingServices.PlotConfigManager.SetCurrentConfig(System.String)
Attempts to load the specified device or device configuration file and make it the current device. If successful, a non-null PlotConfig is returned to the caller, which the caller is responsible for deleting. A null value is returned if the load fails. There can be only one current device loaded by the PlotConfigManager.
deviceName:  Input name of the device for which plotter configuration is requested.

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.NamedPlotStyles
Read-only.

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.CurrentConfig
Returns the currently loaded plotting device through PlotConfig , or null if no device is currently loaded. Clients are repsonsible for deleting the PlotConfig object when it is no longer needed.