Autodesk.AutoCAD.PlottingServices.PlotEngine.BeginPlot(Autodesk.AutoCAD.PlottingServices.PlotProgress,System.Object)
Call this function when not already plotting. Close by calling EndPlot().
plotProgress:  Input plot progress
parameters:  Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.BeginPage(Autodesk.AutoCAD.PlottingServices.PlotPageInfo,Autodesk.AutoCAD.PlottingServices.PlotInfo,System.Boolean,System.Object)
Call this function when plotting a document but not already in a page. Close by calling endPage()..
pageInfo:  Input page information, modified in this call to reflect the pre-scan of the page.
plotInfo:  Input reference to the validated PlotInfo for this page.
lastPage:  Input indicating whether this is the last page in the document.
parameters:  Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.BeginGenerateGraphics(System.Object)
Call this function when plotting a page but not already generating graphics. Close by calling endGenerateGraphics().
parameters:  Reserved for future use.