Autodesk.AutoCAD.EditorInput.Editor
This .NET class wraps the AcEditor ObjectARX class. The single system object of a class derived from this abstract base class allows applications to manage AutoCAD drawing editor notification reactors. Applications can add and remove reactors from the AutoCAD drawing editor reactor chain.

Autodesk.AutoCAD.EditorInput.Editor.InitCommandVersion(System.Int32)
This function sets a variable in the current document establishing the version requested for the next command to be run. The return value is the old version prior to being set. Calling this method will no argument will initialize the value to 0, which indicates that no version has been established.
nVersion:  The new version variable to set

Autodesk.AutoCAD.EditorInput.Editor.GetCommandVersion
This function is used to query the requested version of the command in progress in the current document. It does this by querying the version set at this depth of the command version stack.

Autodesk.AutoCAD.EditorInput.Editor.DoPrompt(Autodesk.AutoCAD.EditorInput.PromptOptions)
Carries out a prompt with the specified options. Returns the result of the prompt operation.
opt:  Input options for the prompt

Autodesk.AutoCAD.EditorInput.Editor.GetFileNameForOpen(Autodesk.AutoCAD.EditorInput.PromptOpenFileOptions)
This method emulates the subtleties of AutoCAD file prompting. It properly prompts on the command line when FILEDIA is zero, or if a script or an AutoLISP routine is running.
options:  Input file opening options

Autodesk.AutoCAD.EditorInput.Editor.GetFileNameForOpen(System.String)
This method emulates the subtleties of AutoCAD file prompting. It properly prompts on the command line when FILEDIA is zero, or if a script or an AutoLISP routine is running.
message:  Input prompt string

Autodesk.AutoCAD.EditorInput.Editor.GetFileNameForSave(Autodesk.AutoCAD.EditorInput.PromptSaveFileOptions)
This method emulates the subtleties of AutoCAD file prompting. It properly prompts on the command line when FILEDIA is zero, or if a script or an AutoLISP routine is running.
options:  Input file saving options

Autodesk.AutoCAD.EditorInput.Editor.GetFileNameForSave(System.String)
This method emulates the subtleties of AutoCAD file prompting. It properly prompts on the command line when FILEDIA is zero, or if a script or an AutoLISP routine is running.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.Editor.Drag(Autodesk.AutoCAD.EditorInput.Jig)
Starts a Jig operation. Returns the outcome of the Jig operation.
jig:  Input the jig to drag

Autodesk.AutoCAD.EditorInput.Editor.StartUserInteraction(System.IntPtr)
Returns a new EditorUserInteraction object.

Autodesk.AutoCAD.EditorInput.Editor.TurnForcedPickOn
This function will cause the AutoCAD input event mechanism to do a pick under the prevailing pick aperture on all digitizer events, regardless of whether a point is being acquired or whether any OSNAP modes are currently active. If a point is being acquired and OSNAP is active, the object snap aperture dimensions (system variable: APERTURE) define the pick box size. Otherwise the normal system variable PICKBOX value will be used. In the PointHistory enum, the following enum values are related to this capability, as indicated by their related comments: ForcedPick,ePickMask, DidNotPick, UsedPickBox, UsedOsnapBox.