Autodesk.AutoCAD.PlottingServices.PlotFactory.CreatePublishEngine
Creates and returns an engine for plotting to a device (or to a file). The plotting pipeline is locked until the engine has been destroyed.

Autodesk.AutoCAD.PlottingServices.PlotFactory.ProcessPlotState
Read-only.