Autodesk.AutoCAD.PlottingServices.PlotProgress.Heartbeat
Called periodically by the plotting framework during PlotEngine.BeginGenerateGraphics() and PlotEngine.EndGenerateGraphics() to allow the plot progress dialog implementation to be responsive to user input messages while regenerating the drawing for the plot. For example, progress dialogs running the same thread as the main AutoCAD window may want to have a message pump in their implementation of this method to pump user interface messages sent to their dialog implementation during the regeneration process.

Autodesk.AutoCAD.PlottingServices.PlotProgress.LowerPlotProgressRange
Sets the lower limit of the plot progress range in a multi-sheet scenario. Clients of the plot progress dialog usually specify the range within which the plot progress updates using this method.

Autodesk.AutoCAD.PlottingServices.PlotProgress.UpperPlotProgressRange
Sets the upper limit of the plot progress range in a multi-sheet scenario. Clients of the plot progress dialog usually specify the range within which the plot progress updates using this method.

Autodesk.AutoCAD.PlottingServices.PlotProgress.PlotProgressPos
Returns the current plot progress position, which typically falls within the plot progress range. Clients of the plot progress dialog use this function to get the update on the plot job progress in a multi-sheet scenario.

Autodesk.AutoCAD.PlottingServices.PlotProgress.LowerSheetProgressRange
Accesses the lower limit of the sheet progress range for a sheet to be plotted. Clients of the plot progress dialog usually specify the range within which sheet progress updates happen.

Autodesk.AutoCAD.PlottingServices.PlotProgress.UpperSheetProgressRange
Sets the upper limit of the sheet progress range for a sheet to be plotted. Clients of the plot progress dialog usually specify the range within which sheet progress updates happen.

Autodesk.AutoCAD.PlottingServices.PlotProgress.SheetProgressPos
Returns the current sheet progress position, which typically falls within the sheet progress range. Clients of the plot progress dialog use this function to get the update on the sheet progress.

Autodesk.AutoCAD.PlottingServices.PlotProgress.StatusMsgString
The plotting pipeline uses this method to return the status string of the sheet currently being plotted. The string retrieved by this process is usually the stage status of the current sheet.