Autodesk.AutoCAD.PlottingServices.PlotReactorManager.BeginPlot
Called by the plotting framework when PlotEngine.BeginPlot() has been called by an application. The parameters passed to this method are the same as those passed to the engine.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.BeginDocument
Called by the plotting framework when PlotEngine.BeginDocument() has been called by an application. The parameters passed to this method are the same as those passed to the engine.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.BeginPage
Called by the plotting framework when PlotEngine.BeginPage() has been called by an application. The parameters passed to this method are the same as those passed to the engine.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.EndPlot
Called by the plotting framework when PlotEngine.endPlot() has been called by an application. The status parameter indicates the final status of the plot.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.EndDocument
Called by the plotting framework when PlotEngine.EndDocument() has been called by an application. The status parameter indicates the final status of the document.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.EndPage
Called by the plotting framework when PlotEngine.EndPage() has been called by an application. The status parameter indicates the final status of the page.