Autodesk.AutoCAD.EditorInput.KeywordCollection.Add(System.String,System.String,System.String,System.Boolean,System.Boolean)
Adds a keyword to the KeywordCollection class..
globalName:  Input global name of the keyword; this is never displayed, but can be used by programs to access keywords when the local translation is not known.
localName:  Input local name of the keyword; the user enters the local name to specify the keyword.
displayName:  Input display name of the keyword; this is shown on the command line and is usually the same as local name.
visible:  Input indicates whether the keyword should be shows to the user.
enabled:  Input indicates whether the keyword is currently enabled; a disabled keyword is disabled is not accepted as user input.