Autodesk.AutoCAD.EditorInput.CursorBadgeUtilities.AddSupplementalCursorImage(Autodesk.AutoCAD.GraphicsInterface.ImageBGRA32,System.Int32)
Adds a supplemental cursor image. Only one cursor badge image can be shown at a time. If multiple features supply badges the last badge with the highest priorityOrder will be the badge shown.
cursorImage:  Input image
priority:  Stacking order badge should appear in. Higher numbers win.