Autodesk.AutoCAD.PlottingServices.MediaBounds.IsEqualTo(Autodesk.AutoCAD.PlottingServices.MediaBounds,Autodesk.AutoCAD.Geometry.Tolerance)
This method tests a for equality to this object by comparing LowerLeftPrintableArea, PageSize, and UpperRightPrintableArea properties. All properties must match within the tolerance range specified by tolerance.
a:  Input object to compare against
tolerance:  Input tolerance value

Autodesk.AutoCAD.PlottingServices.MediaBounds.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.PlottingServices.MediaBounds.LowerLeftPrintableArea
Read-only.