Autodesk.AutoCAD.Publishing.EPlotPropertyCollection
This class contains a collection of EPlotPropertyobjects. An EPlotPropertyCollection object is returned by the EPlotPropertyBag.Properties property.