Autodesk.AutoCAD.PlottingServices.DsdData.SetUnrecognizedData(System.String,System.String)
When a DSD file is read, sections that are not understood are collected as "unrecognized" data. This method allows users of DSDData objects to store an array of customized DSD sections and data.
sectionName:  Input customized section name.
sectionData:  Input customized section data.

Autodesk.AutoCAD.PlottingServices.DsdData.ProjectPath
Returns the output folder name. This field is relevant only for plotting to a file. The field is saved in the DSD file and represents the output folder path.

Autodesk.AutoCAD.PlottingServices.DsdData.DestinationName
Gives the output DWF file path. This field is saved in the DSD file. When plotting to an output DWF/Multi-DWF, this field contains the output file path.

Autodesk.AutoCAD.PlottingServices.DsdData.SheetType
Returns the sheet type field, which is stored in the DSD file and indicates whether the publish operation is configured for multi-sheet DWF plotting, for individual (per-sheet) DWF plotting, or for plotting to the original device configured in the sheet. A SheetType enum value is applicable only at the Data level, and not at the individual sheet entry level.

Autodesk.AutoCAD.PlottingServices.DsdData.Password
Returns the password or phrase used to protect the contents of the output DWF file. This field is saved in the DSD file.

Autodesk.AutoCAD.PlottingServices.DsdData.SheetSetName
Returns the sheet set name, which will be valid only if a sheet set is being published. This field is stored as part of the DSD file.

Autodesk.AutoCAD.PlottingServices.DsdData.NoOfCopies
Returns the quantity of each sheet or layout to be plotted. This field is stored as part of the DSD file. The number of copies is relevant only when not publishing to a multi-sheet DWF file.

Autodesk.AutoCAD.PlottingServices.DsdData.IsSheetSet
Returns a Boolean indicating whether the DSD data is sheet set information. This field is stored in the DSD file.

Autodesk.AutoCAD.PlottingServices.DsdData.SelectionSetName
Returns the name of a named selection set. This field is valid only if plotting a sheet set or a selection set from the Sheet Set Manager.

Autodesk.AutoCAD.PlottingServices.DsdData.CategoryName
Allows to group a publish job into individual categories. This field is serialized in the DSD file.

Autodesk.AutoCAD.PlottingServices.DsdData.LogFilePath
Returns the path to the file to which the publish operation logs errors. This field is serialized in the DSD file.