Autodesk.AutoCAD.GraphicsSystem.Manager.CreateAutoCADViewport(Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel,Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord)
Similar to CreateAutoCADView() except that the Drawable added to the View corresponds to the specified ViewportTableRecord. This API facilitates the viewing of an entire AutoCAD viewport.
vp:  Input ViewportTableRecord

Autodesk.AutoCAD.GraphicsSystem.Manager.CreateAutoCADView(Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel,Autodesk.AutoCAD.GraphicsInterface.Drawable)
This function creates an View object. The Manager adds the drawable passed in to this View along with the Model associated with the Database. This API allows clients to view any drawable (such as an ViewportTableRecord, an BlockTableRecord, or a selection set drawable).
drawable:  Input Drawable
kernel:  Graphics Kernel used to create the resource

Autodesk.AutoCAD.GraphicsSystem.Manager.CreateAutoCADDevice(Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel,System.IntPtr)
Creates an Device object. The window handle passed in to this function is the display surface onto which the graphics system draws. The Manager also configures this Device object with the ACI logical palette.
hwnd:  Input window handle.
kernel:  Graphics Kernel used to create the resource

Autodesk.AutoCAD.GraphicsSystem.Manager.GetOffScreenDevice(Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel)
Gets an offscreen device for the specified kernel. An offscreen device is created if none exists and cached for subsequent use. Currently, only supports the k3DRapidRTRendering kernel.

Autodesk.AutoCAD.GraphicsSystem.Manager.GetOffScreenView(Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel,Autodesk.AutoCAD.GraphicsSystem.ClientViewInfo)
Gets an offscreen view for the specified kernel. The view is connectd to the offscreen device. It is created on demand and cached, however its lifetime is ephemeral and not guaranteed past the next call to this function with different AcGsClientViewInfo parameters. Currently only supports the k3DRapidRTRendering kernel.

Autodesk.AutoCAD.GraphicsSystem.Manager.AcquireGraphicsKernel(Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor)
The Graphics Kernel is a descriptor of the underlying graphics system. Each kernel has its own set of capabilities, and AutoCAD will pick the appropriate kernel to use based on the requested capabilities. Graphics Kernels are reference counted, so be sure to call releaseGraphicsKernel() when you are done with the kernel.
desc:  A descriptor defining the required capabilities of the kernel.