Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedObject
This class describes an object that was selected by a window or window polygon selection. The selection window may or may not be a crossing window.