Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.Flush
Forces the graphic pipeline to be flushed, to ensure synchronization. When control returns, all geometry has been pushed down to the.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.SetCurrentNode(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Determines which node is assigned to the current entity. This calls AddNodeToMap() or MapEntityToNode() internally.
nodeId:  Input node ID to assign.
objIds:  Input array of object IDs for each block that encloses this entity; an empty array if this entity is not part of a block.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.Add3DDwfProperty(System.String,System.String,System.String)
Call this method to add 3D DWF properties to entities when Reactor.OnBeginEntity notification is received. You can call this n times to add n number of properties.
category:  Input name of the category to which you want to add the property.
name:  Input property name.
value:  Input property value.