Autodesk.AutoCAD.PlottingServices.CustomSizeResults
This enumeration wraps the AcPlPlotInfoValidator::eCustomSizeResult ObjectARX enum. It defines the return flags from the PlotInfoValidator.isCustomSizePossible() method.