Autodesk.AutoCAD.Runtime.SystemVariableEnumerator.#ctor
Constructor. Initializes the enumerator to be before the first sysvar, so MoveNext() must be called once to get the enumerator to the first sysvar.

Autodesk.AutoCAD.Runtime.SystemVariableEnumerator.Current
Returns a Variable object containing the data of the current sysvar in the enumerator. The Variable object is read-only with only the following get properties implemented:.