Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.Destroy
Destroys the dialog. Callers should free the memory associated with the dialog by calling this method instead of using the C++ delete operator.