Autodesk.AutoCAD.EditorInput.PromptSaveFileOptions.ForceOverwriteWarningForScriptsAndLisp
Accesses if the overwrite warning prompt ought to be displayed, even when the command is run from LISP or a script. Otherwise, overwrite warning prompts are generally suppressed under these conditions.