Autodesk.AutoCAD.PlottingServices.RefreshCode
This .NET enum wraps the AcPlPlotConfigManager.RefreshCode ObjectARX enum. This enumeration defines the flags that can be specified to refresh the lists maintained by the PlotConfigMgr class.