Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.Validate(Autodesk.AutoCAD.PlottingServices.PlotInfo)
The validator performs validation of the layout, plot settings overrides, and plot device overrides on an PlotInfo object. If the validation is successful, the PlotInfo object is marked validated and the validator stores the validated PlotSettings and validated PlotConfig on the AcPlPlotInfo object.
info:  Input object to validate.