Autodesk.AutoCAD.EditorInput.DrawJig
This class lets the developer create a Jig-based object that can be used to draw graphics and get user input independently of a custom entity. See EntityJig for a Jig object that works with custom entities.