Autodesk.AutoCAD.PlottingServices.DsdEntry.Title
Returns the title of the DSD entry. The title is a unique section name for a DSD entry in the DSD configuration file. If two sheet entries have the same title, they will overwrite each other.