Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs.Veto
This function can be called during a DocumentLockModeChanged callback if it is a callback for a lock request. The result will be that the lock request will be vetoed, which normally means that the command will be canceled before it can start. When this function is called, DocumentLockModeChangeVetoed will be sent.