Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.IsGroup
Returns true if the tree node is a group. "Group" refers to groups in the DWF Viewer navigation panel, rather than AutoCAD groups.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.IsBlock
Returns true if the node is grouped by block. "Block" refers to blocks in the DWF Viewer navigation panel, rather than AutoCAD blocks.