Autodesk.AutoCAD.Publishing.Publisher.AboutToBeginBackgroundPublishing
Occurs when the plot operation is about to start. Brackets the entire plot operation; useful for initialization and discriminating between various databases.

Autodesk.AutoCAD.Publishing.Publisher.AboutToBeginPublishing
Occurs when the plot operation is about to start. Brackets the entire plot operation; useful for initialization and discriminating between various databases.

Autodesk.AutoCAD.Publishing.Publisher.BeginEntity
Occurs before each entity on the sheet is plotted. This allows a client to determine if this entity is one for which it will publish metadata. If so, the client can associate a node with this entity and associate properties with the node. Clients should be parsimonious in assigning nodes to entities.

Autodesk.AutoCAD.Publishing.Publisher.EndSheet
Indicates that all entities on the sheet have been plotted, to notify clients that plotting of the sheet is complete. At this time clients can add resources and/or properties that are not associated with a specific entity to the sheet.

Autodesk.AutoCAD.Publishing.Publisher.PublishDsd(System.String,Autodesk.AutoCAD.PlottingServices.PlotProgressDialog)
Publishes dsdfile with the status indicated in plotProgressDialog.
dsdFile:  Input file to publish
plotProgressDialog:  Input plot progress dialog

Autodesk.AutoCAD.Publishing.Publisher.CurrentPublishedSheetSetPath
Read-only.