Autodesk.AutoCAD.PlottingServices.PlotConfig.SaveToPC3(System.String)
Saves the current plotter configuration to the specified PC3 file name. This method saves the PC3 file, but does not load the file into memory. Any operation performed on the PlotConfig object will operate on the old configuration.
name:  Input PC3 file name.

Autodesk.AutoCAD.PlottingServices.PlotConfig.DeviceName
Returns the device name or PC3 file name. This function always returns the file name portion for a PC3 file. To get the full path name for a PC3 file, use FullPath. This function returns the entire UNC path name for system printers.

Autodesk.AutoCAD.PlottingServices.PlotConfig.FullPath
Returns the current device or PC3 file name. This function always returns the full path name for PC3 files. It returns the entire UNC path name for system printers.

Autodesk.AutoCAD.PlottingServices.PlotConfig.IsPlotToFile
Returns true if the device is currently configured to plot to a file. Otherwise, Returns false.

Autodesk.AutoCAD.PlottingServices.PlotConfig.DefaultFileExtension
Returns a character string containing the default file extensions for plot files created by this device (for example, ".DWF"). The leading "." is always included in the returned string.

Autodesk.AutoCAD.PlottingServices.PlotConfig.PlotToFileCapability
Returns the device's inherent capabilities for plotting to a file. See the PlotToFileCapability enum for possible return values.