Autodesk.AutoCAD.EditorInput.InputPointContext
This class provides input parameters for the PointFilter and PointMonitor events. It wraps the input parameters of the AcEdInputPointFilter.processInputPoint() and AcEdInputPointMonitor.monitorInputPoint() ObjectARX functions.

Autodesk.AutoCAD.EditorInput.InputPointContext.GetKeyPointEntities
Returns the entities that were responsible for the calculation of the osnappedPoint. It contains usually one entity, except for the intersection-kind of osnap points (for these cases, keyPointEntities will contain two entities); plus one entry for each entry in the alignmentPaths array.

Autodesk.AutoCAD.EditorInput.InputPointContext.RawPoint
Returns the point as tracked by the cursor position before subsequent filtering, or as entered via alternate means, which is subject to far less filtering. Valid only if pointComputed is true.

Autodesk.AutoCAD.EditorInput.InputPointContext.ComputedPoint
Returns the point as it ends up for AutoCAD if pointComputed is true. It is always set, whether any built in filters are performed or not. AutoSnap computations could alter it from osnappedPoint.