Autodesk.AutoCAD.PlottingServices.PlotInfo.IsCompatibleDocument(Autodesk.AutoCAD.PlottingServices.PlotInfo)
Returns true if the other plot info object is document compatible with this plot info object. Otherwise, returns false.
info:  Input object to be compared to this object for document compatibility.

Autodesk.AutoCAD.PlottingServices.PlotInfo.Layout
Returns the ObjectId of the layout represented by the plot info object. The ID may be null if no layout has been specified.

Autodesk.AutoCAD.PlottingServices.PlotInfo.DeviceOverride
Provides an PlotConfig object to use in place of other settings. If a device override is provided, it takes precedence over the device specified in the plot settings override and the layout. If the passed parameter is null, any existing device overrides are removed.

Autodesk.AutoCAD.PlottingServices.PlotInfo.ValidatedSettings
Read / Write.

Autodesk.AutoCAD.PlottingServices.PlotInfo.ValidatedConfig
Accesses the PlotConfig that will be used if the info object is plotted. Null indicates that the object has not been validated. This data is created by an PlotInfoValidator object when applying the object's plot and device overrides to the layout.

Autodesk.AutoCAD.PlottingServices.PlotInfo.IsValidated
Returns true if the device has been validated. Otherwise, returns false.