Autodesk.AutoCAD.EditorInput.EntityJig
This .NET class wraps the AcEdJig ObjectARX class. It may be implemented to provide on-screen editing capabilities for an application's custom entities. The EntityJig object lets the user manipulate the graphical representation of a custom entity, and then applies the user's input to an actual instance of the entity. See DrawJig for a Jig object that works independently of custom entities.