Autodesk.AutoCAD.ApplicationServices.DocumentLock
This class represents a locked document. Objects of this class are created and returned to an application when it calls the Document.LockDocument method