Autodesk.AutoCAD.EditorInput.PromptOptions.SetMessageAndKeywords(System.String,System.String)
This method sets the prompt message to the first part of the messageAndKeywords string and sets the display keywords to the latter part of the same string. The display keywords portion of messageAndKeywords must be surrounded by an opening square bracket ("[") at the beginning and a closing square bracket ("]") at the end. The keywords in this list must be delimited by a forward slash character ("/").
messageAndKeywords:  Input message and keywords
globalKeywords:  Input global keywords