Autodesk.AutoCAD.ApplicationServices.Document.SendStringToExecute(System.String,System.Boolean,System.Boolean,System.Boolean)
Executes a particular string.
command:  Input document to send input to
activate:  Input Boolean indicating whether to activate the target document
wrapUpInactiveDoc:  Input Boolean indicating whether to queue current active document to complete in the next OnIdle() when switching active documents
echoCommand:  Input Boolean indicating whether the sent string is echoed on the command line

Autodesk.AutoCAD.ApplicationServices.Document.LockDocument(Autodesk.AutoCAD.ApplicationServices.DocumentLockMode,System.String,System.String,System.Boolean)
Locks the document using a specific mode.
lockMode:  Input one of the locking modes from DocumentLockMode enum
globalCommandName:  Input command name. Each time a document is locked, it is considered the beginning of a "command", or action in Acad. This name is passed back by the doc manager reactor as the name of the command doing the locking. It can be NULL
localCommandName:  Input name that is displayed on the command line if or when this command is undone. It can be NULL
promptIfFails:  If the document cannot be locked, due to a command already in progress in the target document, and if prompt is true, the standard prompt will be issued, and the user will be given an opportunity to complete the command in the target document and the lock will succeed. If the user chooses to cancel the lock request, or prompt is false, then the lock change will fail

Autodesk.AutoCAD.ApplicationServices.Document.LockMode(System.Boolean)
This function provides a way for an application to determine if it could have permission to set a lock on a document. One rule about locking is that an execution context can override any of its own locks. If this application's context has an Exclusive Write lock, it can still apply another lock to the document..
bIncludeMyLocks:  Input Boolean indicating whether to consider this application's locks or just look at other context's locks

Autodesk.AutoCAD.ApplicationServices.Document.LockMode
This function provides a way for an application to determine if it could have permission to set a lock on a document. One rule about locking is that an execution context can override any of its own locks. If this application's context has an Exclusive Write lock, it can still apply another lock to the document.

Autodesk.AutoCAD.ApplicationServices.Document.DowngradeDocOpen(System.Boolean)
Converts the document status from writeable to read only..
bPromptForSave:  Input Boolean to determine if a save prompt is necessary

Autodesk.AutoCAD.ApplicationServices.Document.UnknownCommand
Wraps the AcEditorReactor.unknownCommand() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Document.TransactionManager
Accesses the TransactionManager object for this Document. If an application is opening objects from more than one document at a time, and are using transactions, they must start a separate transaction for each document, using the transaction manager from each document.