Autodesk.AutoCAD.PlottingServices.HostAppServices.UpdatePlotJobStatus(Autodesk.AutoCAD.PlottingServices.AppPlotStatus,System.String)
Application implements this function to communicate plotting events, conditions, and results to the host application. The host application accordingly updates different user interface elements to give visual feedback to the user about the state of the plot job.
status:  Input Autodesk.AutoCAD.PlottingServices..AppPlotStatus object reflecting the state of the plot.
message:  Input for a plot message or DWF file name.

Autodesk.AutoCAD.PlottingServices.HostAppServices.PlotLogger
Applications implement this to return a PlotLogger object. Typically, the PlotLogger instance is also implemented by the host application and instantiated by host application code.