Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.SetKeywords(System.String,System.String)
This method sets the display keywords to keywords and the global keywords to globalKeywords. The display keywords in keywords must be surrounded by an opening square bracket ("[") at the beginning and a closing square bracket ("]") at the end. The keywords in this list must be delimited by a forward slash character ("/").
keywords:  Input keywords
globalKeywords:  Input global keywords