Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireDistance
Obtains a distance based on the current cursor position. Sets distance to the distance between the specified basepoint and the current cursor position.