Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.ReadProperty(System.String,System.Object)
This method should be implemented to return the value of a property named name. It should return defaultValue if name does not exist.
name:  Input the name to read
defaultValue:  Input default value to return