Autodesk.AutoCAD.DatabaseServices.Polyline3d.#ctor
Default constructor. Constructs an open polyline with the type initialized to SimplePoly.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.Straighten
This function removes all spline and curve-fit vertices from the polyline or mesh and sets all remaining vertices to be simple vertices. This operation performs the same modification as the PEDIT command "Decurve" option.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.SplineFit
This function removes any existing spline or curve-fit vertices, converts all remaining vertices to spline-control vertices, and generates a new set of spline-fit vertices. The resultant polyline or mesh is spline fit through the new set of vertices. This operation performs the same modification as the PEDIT command "Spline fit" option.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.AppendVertex(Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d)
This function appends the PolylineVertex3d object pointed to by vertexToAppend to the vertex list of the polyline and establishes the polyline as the vertex's owner. In addition, if the polyline is resident within an Database, the vertex will be added to the same database. If the polyline is not database-resident, when it is added to a database the vertex will be added as well.
vertexToAppend:  Input pointer to the vertex to add to the polyline

Autodesk.AutoCAD.DatabaseServices.Polyline3d.InsertVertexAt(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d)
This function inserts the PolylineVertex3d object pointed to by newVertex into the vertex list of the polyline just after the PolylineVertex3d object pointed to by indexVertexId and establishes the polyline as the vertex's owner. In addition, if the polyline is database-resident, then when it is added to a database, the vertex will be added as well.
indexVertexId:  Input vertex in polyline after which the new vertex is to be inserted
newVertex:  Input vertex to be inserted

Autodesk.AutoCAD.DatabaseServices.Polyline3d.Closed
Assesses if the polyline to be closed. A line segment will be drawn between the last vertex and the first vertex to form a closed polygon.