Autodesk.AutoCAD.Geometry.CircularArc2d
This .NET class wraps the AcGeCircArc2d ObjectARX class. It represents both full circles and circular arcs in 2D space.

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Boolean)
Constructs an arc with the specified start and endpoints. If a line is drawn between startPoint and endPoint, then the distance between this line and the midpoint of the constructed arc is equal to the bulge distance. The direction of the constructed arc is always counterclockwise. startPoint must be different than endPoint. This constructor always constructs a bounded arc and cannot be used to construct a full circle. If bulgeFlag is false, then bulge is interpreted to be the maximum distance between the arc and the chord between the two input points. If bulgeFlag is false, then bulge is interpreted to be the tangent of 1/4 the included angle (tan(ang/4)), where ang is the angle of the arc segment between the two input points.
startPoint:  Input start point of arc
endPoint:  Input endpoint of arc
bulge:  Input bulge distance
bulgeFlag:  Input how to interpret bulge distance for arc calculation

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs an arc through three points. None of the three points may be coincident and they may not be colinear. This constructor always constructs a bounded arc and cannot be used to construct a full circle.
startPoint:  Input start point of arc
point:  Input point on arc
endPoint:  Input endpoint of arc

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Double,System.Double,Autodesk.AutoCAD.Geometry.Vector2d,System.Boolean)
Constructs a circular arc with the specified center, radius, start angle, and end angle. Angles are measured by drawing a vector between a point on the arc and the center point and taking the angle between this vector and referenceVector. The last parameter specifies whether the angle is to be taken clockwise or counterclockwise. endAngle must be greater than startAngle. To construct a full circle, the difference between endAngle and startAngle should be 2 x Pi.
center:  Input center of arc
radius:  Input radius of arc
startAngle:  Input angle of start point of arc
endAngle:  Input angle of endpoint of arc
referenceVector:  Input reference vector from which arc angles are measured
isClockWise:  Input direction of arc

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,System.Double)
Constructs a full circle with the given center and radius. The radius must not be 0.
center:  Input center of circle
radius:  Input radius of circle

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor
Default constructor. Constructs a full circle with center (0,0) and radius 1.

Autodesk.AutoCAD.Geometry.CircularArc2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Changes the definition of the arc to have the specified start and end points and pass through point. None of the three points may be coincident and they may not be collinear.
startPoint:  Input start point
point:  Input point
endPoint:  Input end point

Autodesk.AutoCAD.Geometry.CircularArc2d.Radius
Returns the radius of the arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.ReferenceVector
Changes the reference vector of the arc to the specified vector. Since the start and end angles of the arc are measured with respect to the reference vector, this function has the effect of rotating the arc about its center point.