Autodesk.AutoCAD.DatabaseServices.ObjectId.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.ObjectId.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
provider:  Input culture definition

Autodesk.AutoCAD.DatabaseServices.ObjectId.ConvertToRedirectedId
This function will take the object ID for this object if it has been redirected from another database, and convert it to the actual object ID for the other database (for example: the object ID from an xref database). If this object ID is not redirected or if it has a value of Null, the function will do nothing.

Autodesk.AutoCAD.DatabaseServices.ObjectId.ObjectClass
Accesses the RXClass of the object that is associated with the object id, thus guaranteeing that the result can be safely de-referenced and correctly compared against any class derived from DBObject. This is done because the entire purpose of this property is to streamline code being written; having to always compare the result against NULL would partially defeat the purpose of the function.

Autodesk.AutoCAD.DatabaseServices.ObjectId.Database
Accesses the database in which the object ID is resident. If the object ID is NULL, then NULL is returned.

Autodesk.AutoCAD.DatabaseServices.ObjectId.IsValid
Assesses if the object ID is associated with a database that is currently in memory. If the object ID is associated with a database that is no longer available (in other words, has been deleted), then the value is false.

Autodesk.AutoCAD.DatabaseServices.ObjectId.OriginalDatabase
If this object ID is in an xref database and the object associated with this object ID has been redirected to the host database, then this property will return a pointer to the xref database. If the object associated with this object ID is not from an xref database or is not redirected, then this property's value is the same as ObjectId.Database.

Autodesk.AutoCAD.DatabaseServices.ObjectId.NonForwardedHandle
If this object ID is in an xref database and the object associated with this object ID has been redirected to the host database, then the value of this property is the handle in the xref database. If the object associated with this objectId is not from an xref database or is not redirected, then this method is the same as ObjectId.Handle.

Autodesk.AutoCAD.DatabaseServices.ObjectId.Null
Accesses a null object ID. This property allows more compact expressions to be used and helps the compiler generate better code (it knows the ObjectId is zero instead of having to lookup the Null object).