Autodesk.AutoCAD.DatabaseServices.TypedValue
This value type may contain objects of various types. The type of the value is indicated by this object's TypeCode property, which is analogous to the restype member of the ObjectARX resbuf structure. See ObjectARX Developer's Guide for more information on resbuf.