Autodesk.AutoCAD.DatabaseServices.CenterPointConstraint
This class represents a Concentric constraint node in the owning Assoc2dConstraintGroup. It can be applied between a point and a circle, arc or ellipse.