Autodesk.AutoCAD.GraphicsInterface.AttenuationType
This .NET class wraps the AttenuationType ObjectARX class. AttenuationType gives the type of attenuation, or decay, for this light. This only applies to point and spot lights. Distant lights always have no attenuation.