Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs an PolyFaceMeshVertex that uses position as the position point. The vertex type is initialized to SimpleVertex.
position:  Input WCS position point for the vertex

Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex.#ctor
Default constructor. Initializes the position to (0,0,0) and the vertex type to SimpleVertex.