Autodesk.AutoCAD.DatabaseServices.AttributeReference.#ctor
Default constructor. Initializes the field length to 0, the flags to 0 (that is, non-constant, visible, not preset, and not verifiable), and the tag to 0. In addition, all the initializations for a default new DBText object take place.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.SetAttributeFromBlock(Autodesk.AutoCAD.DatabaseServices.AttributeDefinition,Autodesk.AutoCAD.Geometry.Matrix3d)
Uses definition as a template for the attributes textual, entity, and starting geometric properties (in other words, it copies this information from the attribute definition into the attribute). It then applies blockTransform to transform the position, sizing, and obliquing as would be done by the INSERT command.
definition:  Input the the attribute definition entity to be used as a data template
blockTransform:  Input a block transformation matrix.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.SetAttributeFromBlock(Autodesk.AutoCAD.Geometry.Matrix3d)
Applies blockTransform to the attribute's geometric data to transform the position, sizing, and obliquing as would be done by the INSERT command. The attribute's textual and entity properties data is left alone.
blockTransform:  Input a block transformation matrix.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.Invisible
Accesses the visibility flag of the AttributeReference. If invisible is true, then the AttributeReference object is set to be invisible.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.FieldLength
Accesses the attribute’s field length value. This value is not currently used within AutoCAD.