Autodesk.AutoCAD.DatabaseServices.Solid3d


Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateBox(System.Double,System.Double,System.Double)
This method is used for creating a box solid primitive with centroid at world origin. The length, width, and height axes of the box are aligned with the WCS X, Y, and Z axes, respectively.
lengthAlongX:  Input value for length of the box
lengthAlongY:  Input value for width of the box
lengthAlongZ:  Input value for height of the box

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateFrustum(System.Double,System.Double,System.Double,System.Double)
This method is used for creating a cylinder or cone with the world origin being centered about its diameter and positioned at half of the height. If radiusAlongX and radiusAlongY are the same and topRadius is zero, then a normal circular cone is created. If radiusAlongX and radiusAlongY are not the same and topRadius is zero, then an elliptical cone is created. Otherwise, based on radiusAlongX and radiusAlongY values, a circular or elliptical tapered cylinder is created. If radiusAlongX and topRadius are the same, then a cylinder is created. Otherwise, a cone is created. radiusAlongY determines whether the created cone or cylinder is circular or elliptical, based on whether radiusAlongY is equal to radiusAlongX or not. The base of the frustum lies in the WCS X-Y plane. The direction from the base of the frustum to the top will be in the direction of the positive WCS Z axis.
height:  Input height for the frustum
radiusAlongX:  Input radius for the frustum in X direction
radiusAlongY:  Input radius for the frustum in Y direction
topRadius:  Input radius for top end of the frustum

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateWedge(System.Double,System.Double,System.Double)
This method is used for creating a wedge solid with center at the WCS origin. The length, width, and height of the wedge are aligned with the WCS’s X, Y, and Z axes, respectively.
lengthAlongX:  Input length for the wedge
lengthAlongY:  Input width for the wedge
lengthAlongZ:  Input height for the wedge

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreatePyramid(System.Double,System.Int32,System.Double,System.Double)
This method is used for creating a pyramid with the world origin being centered about its base and positioned at half of the height. If radius and topRadius are the same, then a prism is created. Otherwise, a pyramid is created. The base of the pyramid lies in the WCS X-Y plane. The direction from the base of the pyramid to the top will be in the direction of the positive WCS Z axis.
height:  Input height for pyramid
sides:  Input number of sides for pyramid
radius:  Input radius for inscribed circle of bottom polygon
topRadius:  Input radius for inscribed circle of top polygon

Autodesk.AutoCAD.DatabaseServices.Solid3d.Extrude(Autodesk.AutoCAD.DatabaseServices.Region,System.Double,System.Double)
Creates a solid by extruding region, a distance of height with a taper angle of taper. The extrusion direction is along the normal of the region if the height is positive. taper should be between half pi and -half pi. If the absolute value of taper < 1e-6, then the taper angle is set to 0.
region:  Input a region object
height:  Input height for extrusion
taperAngle:  Input taper angle in radians

Autodesk.AutoCAD.DatabaseServices.Solid3d.ExtrudeAlongPath(Autodesk.AutoCAD.DatabaseServices.Region,Autodesk.AutoCAD.DatabaseServices.Curve,System.Double)
Creates a solid by extruding region along the path curve. path must be an Line, AcDbArc, AcDbCircle, Ellipse, AcDbSpline, AcDb2dPolyline, or a non-spline fit 3dPolyline. path should not have self-intersections and, preferably, should not have high curvature areas. If one of the endpoints of the path is not on the plane of the region, then the path will be moved to make this true.
region:  Input a region object
path:  Input a curve object to extrude along
taperAngle:  Input extrusion taper angle in radians

Autodesk.AutoCAD.DatabaseServices.Solid3d.Revolve(Autodesk.AutoCAD.DatabaseServices.Region,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Creates a solid by revolving region around the axis defined by the projection of the line from axisPoint to axisPoint+axisDir onto the plane containing region. Therefore, the rotation axis will always be coplanar with region. The region is revolved angleOfRevolution radians around the rotation axis. Positive angles result in a clockwise rotation, when looking in the direction of the projection of axisDir onto the plane containing region (that is, right-hand rule). Angles of revolution more than 2 pi are treated as 2 pi. The rotation axis must not pass through region.
region:  Input region object to be revolved
axisPoint:  Input point on the line to be projected to create the axis of revolution
axisDir:  Input vector representing the direction of the line to be projected to create the axis of revolution
angleOfRevolution:  Input angle of revolution in radians

Autodesk.AutoCAD.DatabaseServices.Solid3d.StlOut(System.String,System.Boolean)
Writes out a Stereo Lithography (STL) representation of this solid to a file with the name fileName..
fileName:  Input file name
asciiFormat:  Input Boolean indicating file format

Autodesk.AutoCAD.DatabaseServices.Solid3d.BooleanOperation(Autodesk.AutoCAD.DatabaseServices.BooleanOperationType,Autodesk.AutoCAD.DatabaseServices.Solid3d)
Performs Boolean operation between this solid and Solid. Possible operation types are:.
operation:  Input type of Boolean operation
solid:  Input the other solid with which to carry out the Boolean operation

Autodesk.AutoCAD.DatabaseServices.Solid3d.CopyEdge(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This method copies the specified edge as an AutoCAD entity, which can be an Line, AcDbCircle, AcDbArc, Ellipse, or AcDbSpline. The properties of the resulting entity (color, layer, linetype, lineweight) are set from the corresponding current document settings. The calling application is responsible for the resulting entity (either appending it to a database or deleting it when it is no longer needed).
subEntityId:  Input subentity ID of an edge in the Solid3d

Autodesk.AutoCAD.DatabaseServices.Solid3d.CopyFace(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This method copies the specified face as an AutoCAD entity, which can be an Region if the face is planar, or otherwise will be an Body. The properties of the resulting entity (color, layer, linetype, lineweight) are set from the corresponding current document settings. The calling application is responsible for the resulting entity (either appending it to a database or deleting it when it is no longer needed).
subEntityId:  Input subentity ID of a face in the Solid3d

Autodesk.AutoCAD.DatabaseServices.Solid3d.ExtrudeFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[],System.Double,System.Double)
This method extrudes faces of a solid by a distance of height with a taper angle of taper. The extrusion direction is along the normal of each face if the height is positive or in the opposite direction if the height is negative. If the absolute value of taper < 1e-6, then a taper angle of 0.0 will be used for the extrusion.
subentityIds:  Input array of subentity IDs of faces to be extruded; these faces must be planar
height:  Input extrusion distance to be applied to the specified faces. Use a positive value to extrude in the direction of the face normals, which point outward from the solid. Use a negative value to extrude faces into the solid.
taper:  Input angle of tapering to be applied to the extrusion; the tapering is relative to the axis formed from the center of each face in the direction of the face normal when a positive height is used or in the opposite direction when a negative height is used; this value should be between half pi and half pi

Autodesk.AutoCAD.DatabaseServices.Solid3d.ExtrudeFacesAlongPath(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.DatabaseServices.Curve)
This method extrudes the given faces along the given path curve entity, which must be an Line, AcDbArc, Circle, AcDbEllipse, AcDbSpline, AcDb2dPolyline, or a non-spline fit 3dPolyline. The path should not have self-intersections and, preferably, should not have high curvature areas. If one of the end points of the path is not on the plane of the region, then the path will be moved to make this true.
subentityIds:  Input array of subentity IDs of faces to be extruded; these faces must be planar
path:  Input a curve object to extrude along

Autodesk.AutoCAD.DatabaseServices.Solid3d.ImprintEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
This method intersects the given entity with the solid and imprints their intersection graph onto the solid. If a closed loop of new edges is created, a new face is made. An open loop of edges can be added as a spur to an existing loop on a face or as a slit in the face. The given entity must be a kind of Curve, Solid3d, Body, Region, Trace, bSolid, or Face.
entity:  Input entity to be imprinted

Autodesk.AutoCAD.DatabaseServices.Solid3d.OffsetBody(System.Double)
This method offsets all faces of the solid by the given distance. Faces with surfaces that cannot be offset are removed and the solid is healed, if possible. Note that this operation can produce an invalid solid in some cases. The function will check for an invalid solid result if the SOLIDCHECK system variable is set to 1.
offsetDistance:  Input distance to offset each face

Autodesk.AutoCAD.DatabaseServices.Solid3d.OffsetFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[],System.Double)
Offsets the given faces of the solid by the given distance. Faces with surfaces that cannot be offset are removed and the solid is healed, if possible. Note that this operation can produce an invalid solid in some cases. The function will check for an invalid solid result if the SOLIDCHECK system variable is set to 1.
subentityIds:  Input array of subentity IDs of faces to be offset
offsetDistance:  Input distance to offset each face

Autodesk.AutoCAD.DatabaseServices.Solid3d.RemoveFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[])
This method removes the given faces, growing the adjacent faces to fill the gaps. Note that the gap filling can fill if there is no solution using adjacent faces only.
subentityIds:  Input array of subentity IDs of faces to be removed

Autodesk.AutoCAD.DatabaseServices.Solid3d.SeparateBody
This method separates the solid into a list of solids representing the additional disjoint volumes. This solid is reduced to a solid with one volume. The calling application is responsible for the resulting entities (either appending them to a database or deleting them when they are no longer needed). When the calling application closes this Solid3d, the resulting solid will be committed to the database. So, if the other solids are not appended to the database, you will lose some data.

Autodesk.AutoCAD.DatabaseServices.Solid3d.TaperFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Tapers the given faces of the solid about the given base point and supplied draft vector by a given draft angle. The base point and draft vector define a draft plane about which faces are tapered. Any face lying in the draft plane will not be modified.
subentityIds:  Input array of subentity IDs of faces to be tapered
basePoint:  Input origin of the draft plane
draftVector:  Input draft direction vector
draftAngle:  Input draft angle

Autodesk.AutoCAD.DatabaseServices.Solid3d.SetSubentityMaterial(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function sets a material on a specified subentity. You can remove a previously assigned material by providing a null objectId for the materialId parameter.
subEntityId:  Input subentity Id
materialId:  Input object Id of the material

Autodesk.AutoCAD.DatabaseServices.Solid3d.SetSubentityMaterialMapper(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.GraphicsInterface.Mapper)
This function sets an explicit material mapper on the specified subentity. You can remove the explicit mapper assignment by providing Mapper.kIdentity for the mapper parameter.
subEntityId:  Input subentity ID
mapper:  Input a Mapper object

Autodesk.AutoCAD.DatabaseServices.Solid3d.Area
Returns the area set to the surface area  of the solid. The area will be in square drawing units.

Autodesk.AutoCAD.DatabaseServices.Solid3d.UsesGraphicsCache
This property is a wrapper for the AcDb3dSolid::usesGraphicsCache() method which is used by AutoCAD to determine whether or not to use cached graphics for the region. If the method returns true, then cached graphics will be used. Only database resident entities can use graphics caching, so this method is not called for entities not in an AcDbDatabase.