Autodesk.AutoCAD.GraphicsInterface.LightAttenuation
This .NET class wraps the AcGiLightAttenuation ObjectARX class. This is a container class for light attenuation properties.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.GetHashCode
Read / Write.