Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatusResult
This class is used to return the codes that describe the results of a field evaluation. These results are the equivalent of the three values returned by the Field.evaluationStatus() ObjectARX function.