Autodesk.AutoCAD.DatabaseServices.CompositeConstraint
This class represents a composite constraint node in the owning Assoc2dConstraintGroup. It is the base class for all the kind of composite constraints, the owned constraints are all applied on(connected with) the same constrained geometries.