Autodesk.AutoCAD.Geometry.Point3dCollection
This .NET class wraps the AcGePoint3dArray ObjectARX class. Point3dArray is a template class that uses the AcArray class template.

Autodesk.AutoCAD.Geometry.Point3dCollection.Add(Autodesk.AutoCAD.Geometry.Point3d)
Adds the object represented by value to this collection. Returns the zero-based index of the newly added collection item.
value:  Input object to add