Autodesk.AutoCAD.GraphicsInterface.PixelBGRA32.#ctor(System.Byte,System.Byte,System.Byte,System.Byte)
Constructor. Creates an RGB color with color components r, g, and b and alpha-shading component a correspondingly.
blue:  Input color blue component
green:  Input color green component
red:  Input color red component
alpha:  Input color alpha-shading component

Autodesk.AutoCAD.GraphicsInterface.PixelBGRA32.#ctor(System.UInt32)
Constructor. Creates an BRG color with color components blue, green, and red and alpha-shading component correspondingly.
bgra:  Input color of component

Autodesk.AutoCAD.GraphicsInterface.PixelBGRA32.#ctor
Default constructor. Components r, g and b will be set 0, and components alpha-shading will be set 255.