Autodesk.AutoCAD.DatabaseServices.DiametricDimension
This .NET class wraps the AcDbDiametricDimension ObjectARX class. It represents the diameter dimension type in AutoCAD.

Autodesk.AutoCAD.DatabaseServices.DiametricDimension.#ctor
Default constructor. Initializes the chord points to (0,0,0), and the leader length to 0.0. In addition, all the initializations of the default constructor for Dimension, Entity, and others are performed.

Autodesk.AutoCAD.DatabaseServices.DiametricDimension.FarChordPoint
Accesses the far chord point (in WCS coordinates) of the curve being dimensioned. This is the point on the curve that is diametrically opposite the point where the dimension line extends outside the curve, if the text is outside the curve.