Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.SetupForEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
This call initializes the entire SubEntityTraits and DrawableTraits from the entity. This is more efficient than setting each property individually. The default implementation of Entity.SetAttributes() uses this method.
entity:  Input entity

Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.AddLight(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Drawables that emit light can add one (or more) "lights" to the model. A unique object id must be used for each light, though an object may pass in it's own object Id.
lightId:  Input the added light.