Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs an object that represents the intersection of the two input curves, curve1 and curve2. Intersection points and overlaps are only returned if they are within the two specified parameter ranges. Intersection points are returned within the accuracy of the default tolerance.
curve1:  Input first curve
curve2:  Input second curve
range1:  Input first range interval
range2:  Input second range interval
planeNormal:  Input optional plane normal

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs an object that represents the intersection of the two input curves. Intersection points are returned within the accuracy of the default tolerance in.
curve1:  Input first curve
curve2:  Input second curve
planeNormal:  Input optional plane normal

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.#ctor
This default constructor is used as a placeholder where the curves are specified by a subsequent call to one of the set() functions. This constructor sets the two curves to be the infinite lines represented by the X and Y axes.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetPointOnCurve1(System.Int32)
Returns the specified intersection point intersection as an PointOnCurve3d object of the first curve. The PointOnCurve3d class contains functions to return the 3D coordinates and the parameter value of the returned point.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetPointOnCurve2(System.Int32)
Returns the specified intersection point intersection as an PointOnCurve3d object of the second curve. The PointOnCurve3d class contains functions to return the 3D coordinates and the parameter value of the returned point.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.OverlapDirection
Returns true if the two curves are oriented in the same direction where they overlap and false if they are oriented in the opposite direction. This function returns true if there is no overlap between the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetOverlapRanges(System.Int32)
Returns the intervals of overlap of each curve of the specified overlap. overlap must be non-negative and be less than the number of overlaps returned by OverlapCount.
overlap:  Input number of overlaps to get intervals for

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d)
Resets the two curves, curve1 and curve2, that are to be intersected. The planeNormal parameter is only used by the getIntConfigs() member function. It is not necessary to supply this parameter if getIntConfigs() will not be called for this object.
curve1:  Input first curve
curve2:  Input second curve
planeNormal:  Input optional plane normal