Autodesk.AutoCAD.Runtime.RXObject.X(Autodesk.AutoCAD.Runtime.RXClass)
Searches for a protocol extension object associated with this class. The method begins the search by examining the Class object associated with this class, and if no protocol extension object is found, the search continues in this class's base class and so on up the inheritance tree for this class. This procedure provides a form of protocol extension inheritance. This class's Class member may be found by using this class's isA() method.
protocolClass:  Input protocol class

Autodesk.AutoCAD.Runtime.RXObject.QueryX(Autodesk.AutoCAD.Runtime.RXClass)
Searches for a protocol extension object associated with this object. The method begins the search by examining the Class object associated with this object, and if no protocol extension object is found, the search continues in the base class of the object's class and so on up the inheritance tree for the class. This procedure provides a form of protocol extension inheritance. An object's Class member may be found by using the class's isA() method.
protocolClass:  Input protocol to query with

Autodesk.AutoCAD.Runtime.RXObject.CompareTo(System.Object)
Allow classes to provide a means to compare class objects. The objects are compared and the result of the comparison is returned.
obj:  Input object to compare with.

Autodesk.AutoCAD.Runtime.RXObject.Clone
Creates a clone of the object and returns a pointer to the clone. If the function is not successful in creating the clone, then NULL is returned.