Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs an PolylineVertex3d that uses position as the position point. The vertex type is initialized to SimpleVertex.
param0:  Input WCS position point for the vertex

Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d.#ctor
Default constructor. Initializes the position to (0,0,0) and the vertex type to SimpleVertex.