Autodesk.AutoCAD.GraphicsInterface.DrawableType
This .NET class wraps the AcGiDrawable::DrawableType ObjectARX class. Indicates the type of a drawable object. By default the type on all drawables is kGeometry.