Autodesk.AutoCAD.DatabaseServices.UnderlayItem.Name
Returns the name for the item. The  returned name is unique within the file.

Autodesk.AutoCAD.DatabaseServices.UnderlayItem.Extents
Returns the item's extents in item-model coordinates. The UnderlayReference.Transform property provides the transformation matrix from item-model coordinates to block space coordinates. Block space coordinates usually are equal to WCS coordinates unless the UnderlayReference is part of a block.