Autodesk.AutoCAD.DatabaseServices.FileDependencyManager
This .NET class wraps the AcFileDependencyManager ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.FileDependencyManager.GetEntry(System.String,System.String,System.Boolean)
Using this function returns a FileDependencyInfo object containing data about the File Dependency List entry identified by feature and fullFileName..
feature:  Input feature string of the entry.
fullFileName:  Input file name of the entry.
useCachedInfo:  Input is Boolean. If true, the parameter includes cached information; false does not include cached information.

Autodesk.AutoCAD.DatabaseServices.FileDependencyManager.UpdateEntry(System.String,System.String)
The UpdateEntry() function is a shortcut for erasing and recreating the File Dependency List entry identified by feature and fullFileName.
feature:  Input feature string of the entry
fullFileName:  Input file name of the entry

Autodesk.AutoCAD.DatabaseServices.FileDependencyManager.EraseEntry(System.String,System.String,System.Boolean)
Erases the entry identified by feature and fullFileName from the File Dependency List if its reference count equals 1..
feature:  Input feature string of the entry to erase
fullFileName:  Input file name of the entry to erase
forceRemove:  Input Boolean: true removes an entry with multiple references regardless of its reference count; false removes it only if the reference count is zero

Autodesk.AutoCAD.DatabaseServices.FileDependencyManager.IteratorInitialize(System.String,System.Boolean,System.Boolean,System.Boolean)
Initializes an iterator for the File Dependency List..
feature:  Input feature name of entries to be returned using the iterator; can be null
modifiedOnly:  Input Boolean: true gets only those entries that were modified since the last save; false gets entries regardless of whether they were modified
affectsGraphicsOnly:  Input Boolean: true gets only those entries that have the affectsGraphicsOnly bits set; false gets entries regardless of the affectsGraphicsOnly bits
walkXRefTree:  Input Boolean: true creates an iterator that automatically iterates over the entries of File Dependency Lists in xref'd drawings; false creates an iterator to iterate over only entries in the local list