Autodesk.AutoCAD.Geometry.Surface
This .NET class wraps the AcGeSurface ObjectARX class. Surface class is an abstract base class for all other parametric surfaces.

Autodesk.AutoCAD.Geometry.Surface.IsOn(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the point point is on the surface within tolerance. In this case returns the parameters of the point pnt on surface in the output argument parameterPoint. Returns false otherwise.
point:  Input point on surface
parameterPoint:  Input parameter point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Surface.EvaluatePoint(Autodesk.AutoCAD.Geometry.Point2d)
Evaluator. Returns the point corresponding to the parameter point parameter.
parameter:  Input parameter point

Autodesk.AutoCAD.Geometry.Surface.IsNormalReversed
Returns true if the normal to the surface is evaluated as.

Autodesk.AutoCAD.Geometry.Surface.ReverseNormal
The normal to the surface is evaluated either by formula.