Autodesk.AutoCAD.DatabaseServices.Xrecord.Append(Autodesk.AutoCAD.DatabaseServices.ResultBuffer)
Allows custom applications to add to the Xrecord without getting the existing data, appending to the end of resbuf chain and setting the data back into the xrecord. appendRbChain is more efficient when it comes to undo recording.
data:  Input first result buffer (not its address) in a linked list of result buffer that contain the data for the xrecord.