Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.#ctor
Default constructor. Initializes color to 7 (white); IsFrozen, IsLocked, IsOff, ViewportVisibilityDefault, and IsPlottable to false; and linetype object ID to NULL.