Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsNurbCurve
Determines whether the external curve instance can be represented by a curve definition that is native to gelib. Returns true if the external curve does have an exact gelib native representation, otherwise it returns false.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsNativeCurve
Certain external curve definition may have corresponding native gelib representations. An example is the circular arc. This method allows the caller to obtain such a representation for an instance of external curve.