Autodesk.AutoCAD.Colors.ColorConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)
This method converts value to type destinationType. If the color is described by an ACI value, destinationType is System.String, and culture is set to InvariantCulture, this method returns the color index converted to a string.
context:  Input context to convert within
culture:  Input culture to convert within
value:  Input object to convert from
destinationType:  Input System.Type to convert to