Autodesk.AutoCAD.DatabaseServices.Curve.GetSplitCurves(Autodesk.AutoCAD.Geometry.Point3dCollection)
This function creates one or more entities that are all subcurves of the original. The points collection must contain the points on the curve that are used as the start or end points of the newly created subcurves.
points:  Input collection of parameters on the curve

Autodesk.AutoCAD.DatabaseServices.Curve.GetSplitCurves(Autodesk.AutoCAD.Geometry.DoubleCollection)
This function creates one or more entities that are all subcurves of the original. The points collection must contain the points on the curve that are used as the start or end points of the newly created subcurves.
value:  Input collection of points (in WCS coordinates) on the curve