Autodesk.AutoCAD.DatabaseServices.Layout.Initialize
This method will do the behind the scenes work to establish a Paper Space viewport for the layout. This allows a layout to be set up and made ready for other viewports and entities to be put into the layout as well as to set various layout properties.

Autodesk.AutoCAD.DatabaseServices.Layout.GetViewports
This function returns a collection of ObjectIds of all the Viewports that exist in the Layout's paperspace. The first ID in the list will be the paperspace viewport. If the list returned is empty, then this Layout has never been switched to (activated). The list is updated each time a layout is activated, and kept up-to-date while that layout is active (whenever viewports are added or deleted).

Autodesk.AutoCAD.DatabaseServices.Layout.BlockTableRecordId
Accesses the Layout's associated BlockTableRecord. Corresponding methods in BlockTableRecord implement a forward pointer to the Layout.

Autodesk.AutoCAD.DatabaseServices.Layout.TabOrder
Accesses the tab order field, which controls the order in which the layouts are displayed in the tab control that is docked to the bottom of the viewport. The tab order should be unique and sequential for each layout in the database.

Autodesk.AutoCAD.DatabaseServices.Layout.TabSelected
Accesses the layout tab is included in the selection set for operations that affect multiple tabs. The user can perform multiple selection via the user interface using shift-click.

Autodesk.AutoCAD.DatabaseServices.Layout.AnnoAllVisible
Accesses current ANNOALLVISIBLE value for the database.

Autodesk.AutoCAD.DatabaseServices.Layout.Extents
Accesses the current extents  setting of the layout. This value may not be the actual extents of the geometry in the layout, it is just the value last saved in the layout.