Autodesk.AutoCAD.DatabaseServices.Helix.CreateHelix
This functions creates the helix geometry based on the values set in prior function calls. Without calling this function, no geometry will be visible on the screen.

Autodesk.AutoCAD.DatabaseServices.Helix.AxisVector
Accesses the vector for the axis of the helix. The vector is always perpendicular to the line joining the start point and the axis point.

Autodesk.AutoCAD.DatabaseServices.Helix.BaseRadius
Accesses the base radius of the helix. This is always the distance between the start point and the axis point.