Autodesk.AutoCAD.DatabaseServices.ConcentricConstraint
This class represents a Concentric constraint node in the owning Assoc2dConstraintGroup. It can be applied between two circles, arcs or ellipses.