Autodesk.AutoCAD.Runtime.DynamicLinker.LoadModule(System.String,System.Boolean,System.Boolean)
Loads the fileName ObjectARX program. fileName is the application name as set in the operating system registry. If the ObjectARX application does not have an entry in the registry, or if the registry entry has the AcadApp.LoadDisabled load reason set, or if any of the the LoadReasons in reasons do not match the LoadReasons in the application's registry entry, then this function will be unable to load the application..
fileName:  Input name of the file to load.
printIt:  Input indicating whether or not to print load status message.
asCmd:  Input indicating whether to load the application as if by user command.

Autodesk.AutoCAD.Runtime.DynamicLinker.UnloadModule(System.String,System.Boolean)
Unloads the fileName ObjectARX program. fileName is the application name as set in the operating system registry. If the ObjectARX application was not loaded via the DynamicLinker.loadApp() method or through the demand loading mechanism (all of which use the system registry entry for the application), then this function will be unable to unload the application..
fileName:  Input null-terminated string which is the file name of the program to unload.
asCmd:  Input indicating whether to unload the application as if by user command.

Autodesk.AutoCAD.Runtime.DynamicLinker.LoadApp(System.String,System.Boolean,System.Boolean)
Loads the appName ObjectARX program. appName is the application name as set in the operating system registry. If the ObjectARX application does not have an entry in the registry, or if the registry entry has the AcadApp.LoadDisabled load reason set, or if any of the the LoadReasons in reasons do not match the LoadReasons in the application's registry entry, then this function will be unable to load the application..
appName:  Input null-terminated string which is the application name (as set in the system registry) of the ObjectARX module to load
printIt:  Input indicating whether or not to print load status message.
asCmd:  Input indicating whether to load the application as if by user command.

Autodesk.AutoCAD.Runtime.DynamicLinker.UnloadApp(System.String,System.Boolean)
Unloads the appName ObjectARX program. appName is the application name as set in the operating system registry. If the ObjectARX application was not loaded via the DynamicLinker.LoadApp() method or through the demand loading mechanism (all of which use the system registry entry for the application), then this function will be unable to unload the application..
appName:  Input null-terminated string which is the application name (as set in the system registry) of the ObjectARX module to unload.
asCmd:  Input indicating whether to unload the application as if by user command.

Autodesk.AutoCAD.Runtime.DynamicLinker.IsAppMdiAware(System.String)
Determines if an application already loaded is MDI aware. Returns true if the application is MDI aware or false otherwise.
moduleName:  Input name of the module to check.

Autodesk.AutoCAD.Runtime.DynamicLinker.SetAppBusy(System.String,System.Boolean)
For internal use..
moduleName:  Input.
busyFlag:  Input.

Autodesk.AutoCAD.Runtime.DynamicLinker.ModuleLoading
Occurs when the dynamic linker is loading an application module. Notification occurs before the program file has been loaded.

Autodesk.AutoCAD.Runtime.DynamicLinker.ModuleLoaded
Occurs when the dynamic linker has successfully finished loading an application module. Notification occurs after the program file has been loaded, it has initialized, and any classes it has registered have been added to the runtime system.