Autodesk.AutoCAD.Geometry.PolylineCurve2d
This .NET class wraps the AcGePolyline2d ObjectARX class. It's represents a piecewise linear spline entity in 2D space.

Autodesk.AutoCAD.Geometry.PolylineCurve2d.#ctor
Default constructor. Constructs placeholder only.