Autodesk.AutoCAD.DatabaseServices.GraphNode.CycleOut(System.Int32)
When FindCycles() is called, it creates an internal duplicate set of references used to detect and break cycles.
index:  Input desired node index

Autodesk.AutoCAD.DatabaseServices.GraphNode.AddRefTo(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Creates a reference from this node to an outgoing node. It also sets the outgoing node's incoming pointer to complete the graph edge connection. Both nodes must be in the same graph, and outGoingNode should not be NULL. Note that graph edges can also be created using Graph.AddEdge().
outGoingNode:  Input to the outgoing node

Autodesk.AutoCAD.DatabaseServices.GraphNode.RemoveRefTo(Autodesk.AutoCAD.DatabaseServices.GraphNode)
This is the opposite of AddRefTo(). It removes the entry from the Out() collection, and removes this node from the referenced node's In() collection.
nodeToRemoveReference:  Input node to remove reference of

Autodesk.AutoCAD.DatabaseServices.GraphNode.DisconnectAll
Removes all of the references between this node and any In() or Out() nodes, or CycleIn() and CycleOut() nodes. It is always called in the destructor. It has the effect of cleaning up any node pointers to this node.

Autodesk.AutoCAD.DatabaseServices.GraphNode.MarkTree(System.Byte,Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection)
Marks this node and all nested out() nodes with the flags value supplied. If an collection is passed in, it also appends this node, and the nested Out() nodes, to the collection. If it finds that this node or any nested nodes already have the flag bit(s) set, it does not follow that branch any further.
flags:  Input flag values to set for this node and all nested out nodes
appendedTo:  Input collection that this node and all nested out nodes should optionally be appended to

Autodesk.AutoCAD.DatabaseServices.GraphNode.SetEdgeGrowthRate(System.Int32,System.Int32)
This method sets the number of outgoing and incoming edges that are allocated at a time on a graph node. If the node-to-node relationship contains many edges, this method should be called to increase the rate of the outgoing and incoming edges from the defaults of 4 and 2 respectively. Setting the rates to higher values increases performance but may increase memory usage.
outEdgeRate:  Number of outgoing edges allocated at one time
inEdgeRate:  Number of incoming edges allocated at one time

Autodesk.AutoCAD.DatabaseServices.GraphNode.NextCycleNode
Accesses the next outgoing cyclical reference. It is the same as calling CycleOut(0).