Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
This class represents a node owned by Assoc2dConstraintGroup. Usually a node is connected with multiple other nodes and the connection between two nodes is not directed.