Autodesk.AutoCAD.DatabaseServices.Polyline2d.#ctor
Default constructor. Constructs an open polyline with linetype generation off and initializes the start and end widths to 0.0, the bulge to 0.0, the elevation to 0.0, the type to SimplePoly, the normal to (0,0,1), and the thickness to 0.0.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Straighten
This function removes all spline and curve-fit vertices from the polyline and sets all remaining vertices to be simple vertices. This operation performs the same modification as the PEDIT command "Decurve" option.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.SplineFit
This function removes any existing spline or curve-fit vertices, converts all remaining vertices to spline-control vertices, and generates a new set of spline-fit vertices. The resultant polyline is spline fit through the new set of vertices. This operation performs the same modification as the PEDIT command "Spline fit" option.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.CurveFit
This function creates a smooth curve consisting of pairs of arcs joining each pair of vertices. The curve passes through all the vertices of the polyline and uses any tangent direction specified by the individual vertices. This operation performs the same modification as the PEDIT command "Fit" option.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.NonDBAppendVertex(Autodesk.AutoCAD.DatabaseServices.Vertex2d)
This function appends the Vertex2d object to the vertex list of the polyline, establishes the polyline as the vertex's owner. The polyline must not be database-resident.
vertexToAppend:  Input the vertex to add to the polyline

Autodesk.AutoCAD.DatabaseServices.Polyline2d.AppendVertex(Autodesk.AutoCAD.DatabaseServices.Vertex2d)
This function appends the Vertex2d object to the vertex list of the polyline, establishes the polyline as the vertex's owner, and adds the vertex the Database that contains the polyline (the polyline must be database-resident for this function to succeed). It returns the object ID of the appended vertex.
vertexToAppend:  Input the vertex to add to the polyline

Autodesk.AutoCAD.DatabaseServices.Polyline2d.VertexPosition(Autodesk.AutoCAD.DatabaseServices.Vertex2d)
This function returns the WCS coordinate position value of vert. This function uses the X and Y coordinates from the vertex along with the Z coordinate from the polyline and applies the polyline's OCS-to-WCS transformation to produce the WCS position value. This function will work with vertex objects that are not owned by the polyline. The position returned will be as though the vertex was owned by the polyline.
vertex:  Input vertex object to get the WCS coordinate for

Autodesk.AutoCAD.DatabaseServices.Polyline2d.DefaultStartWidth
Accesses the default polyline segment starting width value for the polyline. This value is used as the default start width for all vertices within the polyline. So, for DXFOUT, vertices that have this start width will not write the value out. For DXFIN, vertices that do not have a DXF group code 40 value will use the polyline's default start width.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.DefaultEndWidth
Accesses the default polyline segment ending width value for the polyline. This value is used as the default end width for all vertices within the polyline. So, for DXFOUT, vertices that have this end width will not write the value out. For DXFIN, vertices that do not have a DXF group code 41 value will use the polyline's default end width.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Thickness
Accesses the thickness for the polyline. The vector direction is sometimes called the extrusion direction.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Normal
Accesses the normal vector of the plane containing the polyline. The normal vector is in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Elevation
Accesses the elevation of the polyline. The elevation is the OCS Z axis value of the polyline (that is, the shortest distance from the WCS origin to the plane containing the polyline).

Autodesk.AutoCAD.DatabaseServices.Polyline2d.LinetypeGenerationOn
Assesses if linetype generation is turned on for the polyline. When linetype generation is on, the linetype pattern used by the polyline is generated continuously across all vertices rather than starting over at each vertex.