Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.IsValidId(System.IntPtr)
Returns true if the viewport specified by id still exists. Otherwise, it returns false.
id:  Input viewport ID value

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.Viewport
Accesses the Viewport object in use by the ViewportDraw object. The Viewport object contains viewport-specific information applicable to the current viewport being drawn to.

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.SequenceNumber
Accesses the number of viewports deleted so far during the AutoCAD edit session for the current drawing. If this number has incremented since last checked, then some viewport has been removed.