Autodesk.AutoCAD.DatabaseServices.PointCloudEx
The PointCloudEx entity (or "point cloud extension entity") works with the AcDbPointCloudDefEx object (or "point cloud extension definition object") to manage point cloud data inside AutoCAD. The relationship between these two classes is much like the relationship between an AutoCAD block definition object and a block reference entity.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.GetColorSchemeForStylization(Autodesk.AutoCAD.DatabaseServices.PointCloudStylizationType)
Returns the color scheme name based on the given stylization mode. This property only applies when the point cloud is being displayed using a stylization mode that has a color ramp. Returns an empty string if the stylization mode is not kIntensityRamp, kHeightRamp, or kClassificationRamp.
type:  Indicates a stylization type.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.SetColorSchemeForStylization(System.String,Autodesk.AutoCAD.DatabaseServices.PointCloudStylizationType)
Sets the current color scheme based on the given stylization mode. This property only applies when the point cloud is being displayed using a stylization mode that has a color ramp. If the color scheme guid doesn't exist, the color scheme will not take effect.
name:  Indicates the name of a color scheme to be set.
type:  Indicates a stylization type

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.findRegionItem(System.Int32)
Gets the region item by its ID in the point cloud. The region ID is stored in the RCP file.
regionId:  The region ID to be returned.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.getPointCloudCropping(System.Int32)
Returns a cropping boundary by index, for editing. Requires that the AcDbPointCloudEx be open for writing.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.CurrentColorScheme
Gets or sets the current color scheme name that corresponds to the current stylization mode. This property only applies when the point cloud is being displayed using a stylization mode that has a color ramp. This method returns an empty string if the stylization mode is not kIntensityRamp, kHeightRamp, or kClassificationRamp.