Autodesk.AutoCAD.DatabaseServices.ColinearConstraint
This class represents a Colinear (coincident) constraint node in the owning Assoc2dConstraintGroup. It can be applied between two constrained line.