Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.EvaluationMode
The action needs to call this method at the beginning of the Evaluate() code to obtain the mode in which it should evaluate itself. The default implementation returns ModifyObjectsAssocEvaluationMode.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.BeginActionEvaluation(Autodesk.AutoCAD.DatabaseServices.AssocAction)
The action informs that it is starting its evaluation. This callback is issued at the beginning of AssocAction.Evaluate() call and should not be issued from the individual EvaluateOverride() method calls. The action is open for write when this callback is issued.
action:  The action that is being evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.EndActionEvaluation(Autodesk.AutoCAD.DatabaseServices.AssocAction)
The action informs that it has finished its evaluation. This callback is issued at the end of AssocAction.Evaluate() call and should not be issued from the individual Evaluate() method calls. The action is open for write when this callback is issued.
action:  The action that is being evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.EndActionEvaluationUsingObject(Autodesk.AutoCAD.DatabaseServices.AssocAction,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.DBObject)
The action informs that it is done with using or modifying a DBObject. The action issues this callback just before it closes the object. If the object is a substitute object provided by the client code, the action does not close it.
action:  The action that is being evaluated.
objectId:  The same DBObjectId that has been previously passed to the matching BeginActionEvaluationUsingObject() callback.
object:  The object that has been used or modified by the action. It may be NULL if the original object couldn't be opened or if the substitute object was not of the expected type.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.DraggingState
The action may inquire of the client code whether the evaluation is happening from inside of the dragging loop and at which stage the dragging is. The custom evaluation callback code may provide this information by implementing this callback.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.CancelActionEvaluation
The custom evaluation callback code can request that the action evaluation should be cancelled by implementing this callback predicate. The AssocAction.Evaluate() method checks this predicate just after issuing the BeginActionEvaluation() callback, i.e. just before the action EvaluateOverride() method is called. If a whole associative network is evaluated, this predicate is also checked after evaluating each action in the network to see if the network evaluation should continue. Custom actions can freely add their own calls to check this predicate, particularly if the action evaluation is time consuming.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.GetTransformationType
Allows the custom evaluation callback code to pass information about what type of transformation (which AutoCAD command) has been performed with the entities prior to action evaluation. The default implementation returns NotSpecified.