Autodesk.AutoCAD.DatabaseServices.AlignedDimension.#ctor
Default constructor. Initializes the dimension line definition point and extension line 1 and 2 start points all to (0,0,0), and the obliquing angle to 0.0. In addition, all the initializations of the default constructor for Dimension, Entity, and others, are performed.

Autodesk.AutoCAD.DatabaseServices.AlignedDimension.DimLinePoint
Accesses the definition point (in WCS coordinates) that specifies where the dimension line will be. This point will be somewhere on the dimension line.