Autodesk.AutoCAD.DatabaseServices.Graph.Node(System.Int32)
Returns the node at the index. Returns NULL if the index is invalid.
index:  Input desired node index

Autodesk.AutoCAD.DatabaseServices.Graph.AddNode(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Adds a new node to the graph. The node must be created on the heap and should not be deleted once it has been added to the graph. The graph will take care of deleting it when necessary. You cannot add a node to more than one graph.
nodeToAdd:  Node to add

Autodesk.AutoCAD.DatabaseServices.Graph.AddEdge(Autodesk.AutoCAD.DatabaseServices.GraphNode,Autodesk.AutoCAD.DatabaseServices.GraphNode)
Adds an edge between two nodes to the graph. Neither node can be NULL, and must have already been added to this same graph. from->out() will now have an entry pointing to toPointer, as will toPointer->in() have an entry pointing to from.
from:  Input the node to begin the edge at
toPointer:  Input the node to end the edge at

Autodesk.AutoCAD.DatabaseServices.Graph.DelNode(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Completely removes a node from the graph. It also disconnects the references from other nodes to this node, if present.
nodeToDelete:  Node to delete

Autodesk.AutoCAD.DatabaseServices.Graph.Reset
Deletes all of the nodes and cycle nodes, and resets the graph to being empty. This is also called by Graph's destructor.

Autodesk.AutoCAD.DatabaseServices.Graph.GetOutgoing
Takes the nodes and returns all of the outgoing nested nodes as a collection. It sets the Selected bit on the original nodes in the array, and sets the InList bit on all the nodes in the resulting collection. Each node in the list will appear in the collection only once.

Autodesk.AutoCAD.DatabaseServices.Graph.FindCycles(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Sets up the internal cycle graph in order to find and label all nodes which cause circular references. The cycle information is kept within the graph, like a cache. An internal dirty bit indicates when the graph has changed, so that the cycle information needs to be updated. So, it is important to call FindCycles() whenever changes might have occured in the graph, before accessing any of the cycle information functions, such as GraphNode.IsCycleNode(). Calling FindCycles() when the graph has not changed simply checks the existing information, and is efficient.
start:  Input node to begin the search for cycles at. Usually defaulted to NULL.

Autodesk.AutoCAD.DatabaseServices.Graph.BreakCycleEdge(Autodesk.AutoCAD.DatabaseServices.GraphNode,Autodesk.AutoCAD.DatabaseServices.GraphNode)
This method is used to break a cycle at a particular point. It removes both the cycle reference and the real reference between from and toPointer. It then calls FindCycles() to update the cycle information changes which result from the break.
from:  Input node that the edge begins at
toPointer:  Input node that the edge ends at

Autodesk.AutoCAD.DatabaseServices.Graph.SetNodeGrowthRate(System.Int32)
This method sets the number of nodes that are allocated to the graph at a time. If the graph consists of many nodes, this method should be called to increase the rate from the default of 8 nodes at a time. Setting a rate to a higher value increases performance but may cause increased memory usage due to unused but allocated node space.
rate:  Number of nodes to allocate at once

Autodesk.AutoCAD.DatabaseServices.Graph.RootNode
Accesses the root, or first, node in the graph. Returns NULL if the first node is NULL; that is, the graph is empty.