Autodesk.AutoCAD.GraphicsInterface.ColorRGBA
This .NET class wraps the AcGiColorRGBA ObjectARX class. It's a Color class for storing the color with a red, green, and blue components, with alpha shading, in double-precision format.