Autodesk.AutoCAD.DatabaseServices.AssocManager.EvaluateTopLevelNetwork(Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback,System.Int32)
Evaluates the top-level AssocNetwork of the given database, using the global evaluation callback. The top-level network owns subnetworks, such as subnetworks owned by the individual BlockTableRecords. Notice that the top-level network owns its subentworks in logical sense, but not necessarily in AutoCAD database ownership sense. See AddAction() and GetInstanceFromObject() methods of AssocNetwork class for more details.
callback:  Optional AssocEvaluationCallback that is added to the global callback before the evaluation and removed after the evaluation is completed.
callbackOrder:  Order of the optional AssocEvaluationCallback.
patabase:  Database whose top-level network is to be evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocManager.RemoveGlobalEvaluationCallback(Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback)
Removes the given user-provided evaluation callback from the global AssocEvaluationMultiCallback.

Autodesk.AutoCAD.DatabaseServices.AssocManager.HasAssocNetwork(Autodesk.AutoCAD.DatabaseServices.Database)
Returns true if the given database has some associative data; in particular, if there is a global AssocNetwork for the whole database. See the related AssocNetwork.GetInstanceFromDatabase() method.