Autodesk.AutoCAD.DatabaseServices.MatchProperties.CopyProperties(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Entity,System.Int32)
This method is expected to copy any appropriate properties from sourceEntity to targetEntity. flag is a set of bit flags indicating which properties to copy over. The enumerated type provides some predefined bits for the flag argument. The flag argument is an int so that you can make use of the unused bits for your own purposes.
sourceEntity:  Input entity from which properties will be copied
targetEntity:  Input entity to which properties will be copied
flag:  Input bit flags indicating which properties to copy