Autodesk.AutoCAD.GraphicsInterface.VisualStyle
This .NET class wraps the AcGiVisualStyle ObjectARX class. This class defines a Visual Style - a collection of visual properties that can be applied to graphical entities.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.#ctor
Default constructor. Initializes members to reasonable default values.
type:  Input the type of visual style to configure