Autodesk.AutoCAD.GraphicsInterface.MaterialColor
This .NET class wraps the AcGiMaterialColor ObjectARX class. It defines material component colors by color method and color value.

Autodesk.AutoCAD.GraphicsInterface.MaterialColor.#ctor
Default constructor. Initialized to inherit color with blend factor of 1.0.

Autodesk.AutoCAD.GraphicsInterface.MaterialColor.Factor
Returns the current scale factor. A scale factor of 0.0 indicates black. A scale factor of 1.0 indicates that the colors are left unchanged.