Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.Background
Returns the object ID of the Background object. If no background has been set, AcDbObjectId.Null is returned.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.DefaultLightingOn
Returns the state of default lighting for this viewport. This toggle is an override to user lights. When ON, the default lights are used instead of user lights. When there are no user lights, default lights are used, and the value of this toggle is ignored.