Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry.ConnectedConstraints
Gets the the array of references to GeometricalConstraint objects which reference this constrained geometry. For a bounded line, arc or bounded ellipse, the array also contains the Coincident constraints between its implicit points and this constrained geometry.