Autodesk.AutoCAD.DatabaseServices.Extents2d.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Extents2d,Autodesk.AutoCAD.Geometry.Tolerance)
This method compares this Extents2d object with a by testing the equivalency of their definition points. If the points match within the range specified by tolerance, this method returns true. Otherwise, it returns false.
a:  Input object to compare
tolerance:  Input tolerance to be used

Autodesk.AutoCAD.DatabaseServices.Extents2d.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.Extents2d.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider, displayed with a specific format. See the Microsoft .NET API documentation for details.
format:  Input format to display
provider:  Input culture-specific format

Autodesk.AutoCAD.DatabaseServices.Extents2d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
provider:  Input culture-specific format

Autodesk.AutoCAD.DatabaseServices.Extents2d.ToString
Returns an equivalent string representation of this object. See the Microsoft .NET API documentation for details.