Autodesk.AutoCAD.DatabaseServices.ConstrainType
This .NET class wraps the AcDbHelix::ConstrainType ObjectARX enum. A constraint is used to make a variable constant. When using the height constraint, changes to any other parameters will not change the height.