Autodesk.AutoCAD.DatabaseServices.AssocDependencyPE
Wrapper AcRx protocol extension base class that allows objects and entities to control whether they allow AssocDependencies to be attached to them. When there is no protocol extension for the object's class, it means that the object allows both read and write-type dependencies.