Autodesk.AutoCAD.Geometry.Point3d
This class wraps AcGePoint3d ObjectARX class. It represents a point in 3D space. It can be viewed as a structure consisting of three doubles.

Autodesk.AutoCAD.Geometry.Point3d.#ctor(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Point2d)
Constructs 3D point by the formula.
plane:  Input plane
point:  Input 2D point

Autodesk.AutoCAD.Geometry.Point3d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Transforms this pre-multiplying it by the matrix leftSide. Returns the reference to this point.
leftSide:  Input transform matrix