Autodesk.AutoCAD.Geometry.Torus
This .NET class wraps the AcGeTorus ObjectARX class. It represents toroidal segment.

Autodesk.AutoCAD.Geometry.Torus.MajorRadius
Returns the major radius.

Autodesk.AutoCAD.Geometry.Torus.MinorRadius
Returns the minor radius.