Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.Add(Autodesk.AutoCAD.DatabaseServices.BulgeVertex)
Adds the object represented by value to this collection. Returns the zero-based index of the newly added collection item.
value:  Input the object to add.