Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits.#ctor
Default constructor. Initializes members to reasonable default values.

Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits.LightDirection
Returns the direction of the light as a vector. The positive direction of this vector is from light to object.