Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.ToString
Returns an equivalent string representation of this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.