Autodesk.AutoCAD.DatabaseServices.EqualHelpParameterConstraint.GetEqualHelpParameters(Autodesk.AutoCAD.DatabaseServices.HelpParameter&,Autodesk.AutoCAD.DatabaseServices.HelpParameter&)
Returns pointers to the two HelpParameter objects which this constraint is connected to.
The returned pointer to the first AcHelpParameter object.: