Autodesk.AutoCAD.Geometry.CubicSplineCurve3d
This .NET class wraps the AcGeCubicSplineCurve3d ObjectARX class. This class represents an interpolation cubic spline in 3D space.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs an interpolation cubic spline going through the fit points. The constructed spline has start and end derivative specified by the input data.
points:  Input interpolating points
startDerivative:  Input derivative at the beginning of spline
endDerivative:  Input derivative at the end of spline

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an interpolation cubic spline going through the fit points within tolerance specified by the tolerance object. The constructed spline has start and end derivative specified by the input data.
points:  Input interpolating points
startDerivative:  Input derivative at the beginning of spline
endDerivative:  Input derivative at the end of spline
tolerance:  Input tolerance object

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection)
Constructs an interpolation cubic spline going through the fit points. The constructed spline is a closed curve.
points:  Input interpolating points

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an interpolation cubic spline going through the fit points within tolerance specified by the tolerance object. The constructed spline is a closed curve.
points:  Input interpolating points
tolerance:  Input tolerance object

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor
Default constructor. Initializes with an empty point list.