Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs a PolygonMeshVertex that uses position as the position point. The vertex type is initialized to SimpleVertex.
point:  Input WCS position point for the vertex

Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex.#ctor
Default constructor. Initializes the position to (0,0,0) and the vertex type to SimpleVertex.