Autodesk.AutoCAD.Colors.Transparency.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.Colors.Transparency.ToString
Returns an equivalent string representation of this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.Colors.Transparency.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
provider:  Input System.IFormatProvider object.

Autodesk.AutoCAD.Colors.Transparency.Alpha
Accesses the alpha value. The valid alpha value range is from 0 (for totally transparent) to 255 (for totally opaque).