Autodesk.AutoCAD.Geometry.Curve3d
This .NET class wraps the AcGeCurve3d ObjectARX class. This ia an abstract base class for all 3D curves. Any class that is derived from this class represents a 3D curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetInterval
Returns the parametric range of the curve. The function EvaluatePoint(double) always returns a point on this curve when called with a value within the returned interval.

Autodesk.AutoCAD.Geometry.Curve3d.GetReverseParameterCurve
Reverses the parametric direction of the curve. The point set of the curve is unchanged, but the direction of the curve is reversed.

Autodesk.AutoCAD.Geometry.Curve3d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the closest points between this curve and the input curve. This function is the same as closestPointTo(), except the closest points are returned as PointOnCurve3d objects.
curve3d:  Input any 3D curve
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the closest point on this curve to the input point. This function is the same as closestPointTo(), except that the closest point is returned as an PointOnCurve3d object.
point:  Input any 3D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedClosestPointTo(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the points on the two curves which when projected onto a plane whose normal is projectDirection are the closest points on the projected curves. The return value of this function is the closest point on this curve. This function is mainly used by graphics where projectDirection is the line of sight. In this case, this function returns the points on the two curves that appear to be the closest points between the two curves (but may not be the actual closest points).
curve3d:  Input any 3D curve
projectDirection:  Input direction of projection
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the point on the curve which when projected onto a plane whose normal is projectDirection is the closest point on the projected curve to the input point. This function is mainly used by graphics where projectDirection is the line of sight. In this case, this function returns the point on the curve that appears to be closest to the input point (but may not be the actual closest point).
point:  Input any 3D point
projectDirection:  Input direction of projection
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetNormalPoint(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the point on the input curve whose normal passes through the input point. The returned point lies on a plane that also contains the input point and is perpendicular to the curve tangent at that point. The returned point is therefore at a local minimum or a local maximum from the input point.
point:  Input any 3D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetBoundBlockOf(Autodesk.AutoCAD.Geometry.Interval)
Returns the bounding box of the specified sub-interval of the curve. The sides of the returned box are parallel to the coordinate axes.
range:  Input sub-interval of curve

Autodesk.AutoCAD.Geometry.Curve3d.GetOrthoBoundBlockOf(Autodesk.AutoCAD.Geometry.Interval)
Returns the bounding box of the specified sub-interval of the curve. The sides of the returned box are parallel to the coordinate axes.
range:  Input sub-interval of curve

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedEntity(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the entity that is the projection of the curve onto the projection plane in the specified direction. The projectDirection vector must not be parallel to the projection plane. The returned entity may not be of the same type as the original curve and may not even be a curve (for instance, a line projects into a point if it is parallel to projectDirection). The returned entity is created with the new operator and it is the responsibility of the caller to delete it.
projectionPlane:  Input plane on which curve is to be projected
projectDirection:  Input direction in which curve is to be projected
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetOrthoProjectEntity(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the entity that is the orthogonal projection of the curve onto the projection plane. The returned entity may not be of the same type as the original curve and may not even be a curve (for instance, a line projects into a point if it is orthogonal to the projection plane). The returned entity is created with the new operator and it is the responsibility of the caller to delete it.
projectionPlane:  Input plane on which curve is to be projected
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d,System.Double&)
Determines if the point lies on curve. The value is only set to a meaningful value if this function returns true.
point:  Input any 3D point
value:  Input parameter value of point if point lies on curve

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d,System.Double&,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if point lies on curve. The value is only set to a meaningful value if this function returns true.
point:  Input any 3D point
value:  Input parameter value of point if point lies on curve
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetParameterOf(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the parameter value of point. This function assumes that point lies on the curve and does not verify this. If point does not lie on the curve, this function will return unpredictable results.
point:  Input any 3D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetTrimmedOffset(System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.OffsetCurveExtensionType,Autodesk.AutoCAD.Geometry.Tolerance)
Returns one or more offset curves that represent the trimmed offset of the curve. The curve must be planar and planeNormal must be perpendicular to the plane of the curve. The positive direction of offset at a point on the curve is taken to be the cross product of planeNormal with the tangent vector at that point. The curve may be offset in either of two directions by specifying a positive or negative offset distance; planeNormal determines which direction is the positive direction of offset. The returned offset curves are trimmed so that they do not contain any points of self-intersection.
distance:  Input offset distance
planeNormal:  Input normal vector to plane of curve
extensionType:  Input determines how offset curve will be extended at points of C1 discontinuity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsPlanar(Autodesk.AutoCAD.Geometry.Plane&)
Determines if curve is planar. If the curve is a line, then this function returns an arbitrary plane that contains the line. The plane parameter contains meaningful data only if this function returns a value of true.
plane:  Input plane on which this curve lies if it is planar

Autodesk.AutoCAD.Geometry.Curve3d.IsPlanar(Autodesk.AutoCAD.Geometry.Plane&,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if curve is planar. If the curve is a line, then this function returns an arbitrary plane that contains the line. The plane parameter contains meaningful data only if this function returns a value of true.
plane:  Input plane on which this curve lies if it is planar
tolerance:  EvaluatePoint

Autodesk.AutoCAD.Geometry.Curve3d.IsLinear(Autodesk.AutoCAD.Geometry.Line3d&)
Determines if curve is linear. The line parameter contains meaningful data only if this function returns a value of true.
line:  Input line on which this curve lies if it is linear

Autodesk.AutoCAD.Geometry.Curve3d.IsLinear(Autodesk.AutoCAD.Geometry.Line3d&,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if curve is linear. The line parameter contains meaningful data only if this function returns a value of true.
line:  Input line on which this curve lies if it is linear
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsCoplanarWith(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Plane&)
Returns true if both curve are planar and lie in the same plane. The plane parameter is only valid if this function returns a value of true.
curve3d:  Input any 3D curve
plane:  Input plane in which this curve and input curve lie

Autodesk.AutoCAD.Geometry.Curve3d.IsCoplanarWith(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Plane&,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if both curve are planar and lie in the same plane. The plane parameter is only valid if this function returns a value of true.
curve3d:  Input any 3D curve
plane:  Input plane in which this curve and input curve lie
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsPeriodic(System.Double&)
Determines if the curve is periodic. The curve is periodic if and only if it is closed and the two points EvaluatePoint(t) and EvaluatePoint(t+period) are always the same point for all values of t.
period:  Input period of curve parameter

Autodesk.AutoCAD.Geometry.Curve3d.GetParameterAtLength(System.Double,System.Double,System.Boolean,System.Double)
Returns the parameter value of the point whose arc length distance (from the point with parameter value datumParameter) is the input length. In other words, if.
datumParameter:  Input parameter value
length:  Input arc length
direction:  Input parameter direction
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetArea(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the area of the interval of the curve defined by startingParameter and endingParameter. Returns true if area was successfully computed to within the specified tolerance. If the curve is not planar, then the area cannot be calculated and a value of false is returned.
startingParameter:  Input parameter value of interval start
endingParameter:  Input parameter value of interval end (must be larger than startParameter)
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetSamplePoints(System.Int32)
Returns the specified number of points on the curve. The points are equally spaced by parameter value. So if the interval of the curve [0,1] and numSample is 5, the parameter values of the returned points are 0, 0.25, 0.5, 0.75, and 1.
numSample:  Input number of points that are to be returned

Autodesk.AutoCAD.Geometry.Curve3d.BoundBlock
Returns the bounding box of the curve. The sides of the returned box are parallel to the coordinate axes.

Autodesk.AutoCAD.Geometry.Curve3d.OrthoBoundBlock
Returns the bounding box of the curve. The sides of the returned box are parallel to the coordinate axes.

Autodesk.AutoCAD.Geometry.Curve3d.HasStartPoint
Returns true if curve has a start point. A return value of false means that the parametric interval of the curve does not have a lower bound.

Autodesk.AutoCAD.Geometry.Curve3d.HasEndPoint
Returns true if curve has an endpoint. A return value of false means that the parametric interval of the curve does not have an upper bound.