Autodesk.AutoCAD.DatabaseServices.AssocGlobalUtility
A Utility class to wrap all global utility methods

Autodesk.AutoCAD.DatabaseServices.AssocGlobalUtility.EvaluationRequestSeverityLevel(Autodesk.AutoCAD.DatabaseServices.AssocStatus)
Returns the severity level (positive integer) of those status values that indicate a request for an AssocAction or an AssocDependency to be evaluated, or 0 if the status does not indicate an evaluation request. Higher numbers mean more "severe" requests to evaluate.
status:  The AssocStatus.