Autodesk.AutoCAD.DatabaseServices.Transaction.AddNewlyCreatedDBObject(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean)
obj must point to an object that is newly created (that is, it has never been closed) and is already database resident (that is, it's been added to an Database so it has an objectId)..
obj:  Input object to be added or removed
add:  Input Boolean indicating whether to add or remove the object