Autodesk.AutoCAD.DatabaseServices.Hatch.GetLoopAt(System.Int32)
This function gets the loop definition data (polyline) of a selected hatch boundary loop from the hatch entity. loopIndex specifies the index of the selected loop.
loopIndex:  Input index of selected loop

Autodesk.AutoCAD.DatabaseServices.Hatch.AppendLoop(Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This function appends a new boundary loop (path or polyline) to the hatch entity. loopType specifies the type for the loop, which is an enum number of Default or External. dbObjIds is a set of object IDs of Entitys that make up the boundary loop. The object IDs will be maintained if the hatch entity is an associative.
loopType:  Input loop type
dbObjIds:  Input set of object IDs

Autodesk.AutoCAD.DatabaseServices.Hatch.InsertLoopAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This function inserts a new boundary loop (path or polyline) to the hatch entity. loopIndex specifies the index at which the loop will be inserted into the hatch boundary loop list. loopType specifies the type for the loop. dbObjIds is a set of object IDs of Entities that make up the boundary loop. The object IDs will be maintained if the hatch entity is associative.
loopIndex:  Input index for the selected loop
loopType:  Input loop type
dbObjIds:  Input set of object IDs

Autodesk.AutoCAD.DatabaseServices.Hatch.InsertLoopAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.HatchLoop)
This function inserts a new boundary loop (path or polyline) to the hatch entity. loopIndex specifies the index at which the loop will be inserted into the hatch boundary loop list. hatchLoop specifies the type for the loop.
loopIndex:  Input index for the selected loop
hatchLoop:  Input loop type

Autodesk.AutoCAD.DatabaseServices.Hatch.SetGradientColors(Autodesk.AutoCAD.DatabaseServices.GradientColor[])
This method provides the mechanism for defining the colors to be applied to the gradient definition. In the simplest case, the color definition consists of the starting and ending color. The start color maps to colors[0] and the stop color maps to colors[count-1]. The current implementation supports only a count value of 2. The Hatch object makes a copy of the arrays provided as arguments.
value:  Input array of floats representing the interpolation values defining the gradient

Autodesk.AutoCAD.DatabaseServices.Hatch.EvaluateGradientColorAt(System.Single)
This method provides a way to evaluate the interpolated color that the current gradient definition and colors will produce at a specified location along the gradient. Returns the color of the current gradient evaluated at the location value. The point of evaluation is indicated by the argument value.
value:  Input normalized value, [0.0...1.0], at which to evaluate the gradient color

Autodesk.AutoCAD.DatabaseServices.Hatch.EvaluateHatch(System.Boolean)
This function evaluates the hatch lines or solid fill for the hatch entity using the specified hatch pattern. For regular hatch patterns, except for solid, this function performs intersection calculations between pattern definition lines and hatch boundary curves to form hatch lines. For a solid fill hatch pattern, this function performs triangulation of the hatch area and fills in the triangular meshes with the given color..
underEstimateNumLines:  If true, underestimates the count before deciding to abort. That is, if Hatch::EvaluateHatch(true) is used, the function will abort if the count is in excess of 100,000.

Autodesk.AutoCAD.DatabaseServices.Hatch.GetHatchLinesData
void Hatch.GetHatchLineDataAt(int index, Point2d* startPoint, Point2d* endPoint) { *startPoint = new Point2d(); *endPoint = new Point2d(); Interop.Check(GetImpObj()->getHatchLineDataAt(index,*(*startPoint)->GetImpObj(),*(*endPoint)->GetImpObj()));.

Autodesk.AutoCAD.DatabaseServices.Hatch.Elevation
Accesses the elevation for the hatch entity. Elevation defines the distance from the WCS origin to the hatch plane.

Autodesk.AutoCAD.DatabaseServices.Hatch.Normal
Accesses the normal vector of the hatch entity. The normal vector is expressed in WCS and normalized to unit length.

Autodesk.AutoCAD.DatabaseServices.Hatch.NumberOfLoops
Accesses the total number of boundary loops contained in the hatch entity. Boundary loops define the area to be hatched.

Autodesk.AutoCAD.DatabaseServices.Hatch.Associative
Accesses true or false depending on whether this hatch entity is associative with its source boundary geometries. The source boundary geometries must be AutoCAD database-resident entities such as Line, Arc, etc. Using an associative hatch provides automatic re-calculation of the hatch lines when you modify the source boundary geometries.

Autodesk.AutoCAD.DatabaseServices.Hatch.GradientOneColorMode
Assesses whether the gradient hatch is transitioning from a start to a stop color (two-color) or from a color to an adjusted luminance version of the same color (one-color). In the latter case, the full luminance version is the "tint" and the zero luminance version is the "shade.".

Autodesk.AutoCAD.DatabaseServices.Hatch.NumberOfHatchLines
Accesses the total number of hatch lines contained in the hatch entity. The hatch lines are calculated by the function EvaluateHatch().

Autodesk.AutoCAD.DatabaseServices.Hatch.Origin
Accesses the origin point for the hatch pattern of this hatch entity. The returned point is expressed in WCS coordinates.