Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeStyleAt(System.Int32)
This function returns the ObjectId of the TextStyleTableRecord of the shape (or textStyle if it's a text string instead of a shape) at position index in the LinetypeTableRecord. If there is no shape or text at index, then Null is returned.
index:  Input index (0-based) of shape (or text string) to get

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeStyleAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function sets the LinetypeTableRecord to use value as the ObjectId of the TextStyleTableRecord for the shape (or textStyle if it's a text string instead of a shape) at position index. If there is to be no shape or text at index, then value should be Null.
index:  Input index at which to set the shape (or text string) scale
id:  Input scale factor to be applied to the shape (or text string)

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeNumberAt(System.Int32)
This function returns the shape number of the shape at position index in the LinetypeTableRecord. If there is no shape at index, then 0 is returned.
index:  Input index (0-based) of shape (or text string) to get

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeNumberAt(System.Int32,System.Int32)
This function sets the index'th dash to embed the shape identified by shapeNumber (the shape's shapeNumber from its shape file). If no shape is to be used at index, then shapeNumber should be 0.
index:  Input index at which to set the shape
shapeNumber:  Input shape identification number of the shape to use

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeOffsetAt(System.Int32)
This function returns an Vector2d object whose X and Y coordinates represent the X and Y offsets of the shape (or text string) at position index in the LinetypeTableRecord. If there is no shape at index, then the X and Y components of the returned vector will be 0.0.
index:  Input index (0-based) of shape (or text string) to get

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeOffsetAt(System.Int32,Autodesk.AutoCAD.Geometry.Vector2d)
This function sets the LinetypeTableRecord to use the X and Y coordinates of offset as the X and Y offsets for the shape (or text string) at position index. If there is to be no shape at index, then the X and Y components of offset should be 0.0.
index:  Input index at which to set the shape (or text string) offset
offset:  Input vector whose X and Y values are the WCS X and Y offsets for the shape

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeScaleAt(System.Int32)
This functions return the scale factor of the shape (or text string) at position index in the LinetypeTableRecord. If there is no shape at index, then 1.0 is returned.
index:  Input index (0-based) of shape (or text string) to get

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeScaleAt(System.Int32,System.Double)
This function sets the LinetypeTableRecord to use scale as the scale of the shape at position index. If there is to be no shape at index, then scale should be 1.0.
index:  Input index at which to set the shape (or text string) scale
scale:  Input scale factor to be applied to the shape

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeIsUcsOrientedAt(System.Int32,System.Boolean)
This function sets the UcsOriented bit (bit 1) for the shape (or text string) at position index in the LinetypeTableRecord. If IsUcsOriented is true, then the bit is set and the shape will orient itself relative to the current UCS when displayed. If IsUcsOriented is false, then the shape will orient itself relative to the line it's embedded within..
index:  Input index (0-based) of shape (or text string) to get
isOriented:  Input Boolean indicating whether or not the shape is to be oriented relative to the current UCS

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeRotationAt(System.Int32)
This function returns of the rotation angle (in radians) of the shape (or text string) at position index in the LinetypeTableRecord. If the isUcsOriented bit is set in the LinetypeTableRecord, then the rotation angle is relative to the current UCS, otherwise it's relative to the line's direction. Positive angles are counter-clockwise when looking down the normal of the plane containing the text (or the UCS normal if isUcsOriented) If there is no shape at index, then 0 is returned.
index:  Input index (0-based) of shape (or text string) to get

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeRotationAt(System.Int32,System.Double)
This function sets the rotation angle (in radians) of the shape (or text string) at position index in the LinetypeTableRecord. If the isUcsOriented bit is set in the LinetypeTableRecord, then the rotation angle is relative to the current UCS. Otherwise it's relative to the line's direction. Positive angles are counter-clockwise when looking down the normal of the plane containing the text (or the UCS normal if isUcsOriented).
index:  Input index (0-based) of shape (or text string) to get
rotation:  Input rotation angle for the shape (or text string)

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.AsciiDescription
This function is obsolete and will be eliminated in a future release of ObjectARX. Please use Comments instead.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.PatternLength
Accesses the length (in AutoCAD drawing units--the pattern will appear this length when the linetype scale is 1.0) of the pattern in the LinetypeTableRecord. The pattern length is the total length of all dashes (including pen up spaces). Embedded shapes or text strings do not add to the pattern length because they are overlaid and do not interrupt the actual dash pattern.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.IsScaledToFit
Accesses the alignment type for the LinetypeTableRecord. If ScaledToFit is true, the alignment wll be "scaled to fit" (equivalent to an 'S' in the alignment field of the linetype definition). If ScaledToFit is false, the alignment will not be "scaled to fit" (equivalent to an 'A' in the alignment field of the linetype definition).