Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLayerZeroId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database. This method will always return a non-NULLObjectId.
database:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsCompatibilityMode(Autodesk.AutoCAD.DatabaseServices.Database)
Retrieve the EXTNAMES setting of the specified database. True is returned if the database pointer is NULL or EXTNAMES is no longer applicable. The database pointer should not be NULL, so this condition causes an assert.
database:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsBlockModelSpaceName(System.String)
Returns true if name matches a predefined symbol name. The string is normalized before the comparison to the predefined name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsBlockPaperSpaceName(System.String)
Returns true if name matches a predefined symbol name. The string is normalized before the comparison to the predefined name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLayerDefpointsName(System.String)
Returns true if name matches a predefined symbol name. The string is normalized before the comparison to the predefined name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLayerZeroName(System.String)
Returns true if name matches a predefined symbol name. The string is normalized before the comparison to the predefined name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLinetypeByBlockName(System.String)
Returns true if name matches a predefined symbol name. The string is normalized before the comparison to the predefined name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLinetypeByLayerName(System.String)
Returns true if name matches a predefined symbol name. The string is normalized before the comparison to the predefined name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLinetypeContinuousName(System.String)
Returns true if name matches a predefined symbol name. The string is normalized before the comparison to the predefined name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsRegAppAcadName(System.String)
Returns true if name matches a predefined symbol name. The string is normalized before the comparison to the predefined name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsTextStyleStandardName(System.String)
Returns true if name matches a predefined symbol name. The string is normalized before the comparison to the predefined name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsViewportActiveName(System.String)
Returns true if name matches a predefined symbol name. The string is normalized before the comparison to the predefined name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetBlockModelSpaceId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database. This method will always return a non-NULL ObjectId.
databasePointer:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetBlockPaperSpaceId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database. This method will always return a non-NULL ObjectId.
databasePointer:  Input pointer to database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLinetypeByBlockId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database. This method will always return a non-NULLObjectId.
databasePointer:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLinetypeByLayerId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database. This method will always return a non-NULLObjectId.
databasePointer:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLinetypeContinuousId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database. This method will always return a non-NULLObjectId.
databasePointer:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetRegAppAcadId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database. This method will always return a non-NULLObjectId.
databasePointer:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetTextStyleStandardId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database. This method will always return a non-NULLObjectId.
databasePointer:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.MakeDependentName(System.String,System.String)
Performs the necessary concatenation of the specified drawing name and symbol name to create a dependent symbol name. No validation of the drawing name, symbol name, or the resulting symbol name is done.
dwgName:  Input the drawing name
symbolName:  Input the symbol name

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetBlockNameFromInsertPathName(System.String)
Extract a suitable block name from a pathname. This method calls the GetSymbolNameFromPathName() method with "DXF;DWG" as the list of extensions to check.
pathName:  Input path name to examine

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetInsertPathNameFromBlockName(System.String)
This function copies the string pointed to by blockName (or an empty string if blockName is null) into the path name string. It then checks to see if the string ends with a .dwg or .dxf extension. This check is not case-sensitive. If the string does not have either extension, then .dwg is appended to the end of the path name string.
blockName:  Input name of block from which to get the path

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetMaxSymbolNameLength(System.Boolean,System.Boolean)
Returns the maximum allowed length for symbol names, if applicable..
isNewName:  Input Boolean to indicate whether we want to the length for extended or legacy symbol names
compatibilityMode:  Input Boolean to indicate extended or legacy symbol names

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetPathNameFromSymbolName(System.String,System.String)
This function copies the string pointed to by symbolName (or an empty string if symbolName is null) into path name. It then checks to see if the string ends with one of the extensions specified in extensions. This check is not case-sensitive. If the string does not end in one of the extensions specified in extensions, then a period ('.') followed by the first extension specified in extensions is appended to the end of the path name string.
symbolName:  Input name of block from which to get the path
extensions:  Input list of extensions for which to search

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetSymbolNameFromPathName(System.String,System.String)
Extracts a suitable symbol name from a path name. The symbol name is the filename component of the path. Any of the specified filename extensions are removed. Lexical analysis of only the specified path is performed, and no attempt is made at any type of pathname validation or symbol name validation. Thus, the input pathname may be an invalid pathname and the resulting block name may be an invalid block name. If the pathname pointer is null, it is treated as an empty string. The solidus (‘/’) and backslash (‘\’) are treated as delimiters for directory names. Note that this function is meant to encapsulate a convention for extracting a block name from a pathname. It is not intended for use as a general purpose filename parsing utility.
pathName:  Input path name
extensions:  Input list of extensions to consider

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.PreValidateSymbolName(System.String,System.Boolean)
Perform any "pre-validation" steps on a string that will be validated as a symbol name:.
preserveCase:  Input Boolean to indicate whether to preserve the case of alphabetic letters

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.BlockModelSpaceName
Returns the string used as the value for the  predefined symbol record. A NULL pointer or empty string will never be returned.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.BlockPaperSpaceName
Returns the string used as the value for the  predefined symbol record. A NULL pointer or empty string will never be returned.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LayerDefpointsName
Returns the string used as the value for the  predefined symbol record. A NULL pointer or empty string will never be returned.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LayerZeroName
Returns the string used as the value for the  predefined symbol record. A NULL pointer or empty string will never be returned.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LinetypeByBlockName
Returns the string used as the value for the  predefined symbol record. A NULL pointer or empty string will never be returned.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LinetypeByLayerName
Returns the string used as the value for the  predefined symbol record. A NULL pointer or empty string will never be returned.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LinetypeContinuousName
Returns the string used as the value for the  predefined symbol record. A NULL pointer or empty string will never be returned.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.RegAppAcadName
Returns the string used as the value for the  predefined symbol record. A NULL pointer or empty string will never be returned.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.TextStyleStandardName
Returns the string used as the value for the  predefined symbol record. A NULL pointer or empty string will never be returned.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.ViewportActiveName
Returns the string used as the value for the predefined symbol record. A NULL pointer or empty string will never be returned.