Autodesk.AutoCAD.GraphicsInterface.Mapper
This .NET class wraps the AcGiMapper ObjectARX class. The Mapper class defines mappers. Mappers determine how an MaterialMap is positioned, sized, and rotated when it is mapped to an object surface. Mappers

Autodesk.AutoCAD.GraphicsInterface.Mapper.#ctor
Default constructor. Initialized to planar, tiled, no automatic transform, and identity transform.

Autodesk.AutoCAD.GraphicsInterface.Mapper.UTiling
Deprecated. Likely to be removed from future release.

Autodesk.AutoCAD.GraphicsInterface.Mapper.VTiling
Deprecated. Likely to be removed from future release.