Autodesk.AutoCAD.DatabaseServices.Viewport.#ctor
Default constructor. Initializes:.

Autodesk.AutoCAD.DatabaseServices.Viewport.IsLayerFrozenInViewport(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function returns true if the LayerTableRecord with objectId layerId is frozen in the viewport. Otherwise false is returned.
layerId:  Input id of the LayerTableRecord in question

Autodesk.AutoCAD.DatabaseServices.Viewport.UpdateDisplay
This function updates the onscreen display to reflect any changes made to the viewport's view parameters. If no changes have been made, or the viewport is not on, or is not onscreen, then this function does nothing.

Autodesk.AutoCAD.DatabaseServices.Viewport.GetUcs(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
This function returns the origin, x-axis, and y-axis of the ucs for this viewport.
origin:  Input origin
: Input x-axis
y:  Input y-axis

Autodesk.AutoCAD.DatabaseServices.Viewport.SetUcs(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function sets the UCS for this viewport. The new UCS will be named and userCoordinateSystemId must reference a valid UcsTableRecord object.
userCoordinateSystemId:  Input reference to a valid UcsTableRecord object

Autodesk.AutoCAD.DatabaseServices.Viewport.SetUcs(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
This function sets the UCS for this viewport as defined by origin, x, and y. The resulting UCS will be unnamed.
origin:  Input origin
: Input X axis
y:  Input Y axis

Autodesk.AutoCAD.DatabaseServices.Viewport.Thumbnail
Accesses the packed BITMAPINFO structure of the thumbnail, with the thumbnail data following it immediately in memory. It will be set to null if no thumbnail has been set.

Autodesk.AutoCAD.DatabaseServices.Viewport.Width
Accesses the width of the viewport entity's window in drawing units. This is the width in Paper Space of the viewport itself, not the width of the Model Space view within the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.Number
Accesses the viewport ID number. This is the number that is reported by the AutoCAD CVPORT system variable when the viewport is the current viewport in the AutoCAD editor. If the viewport is inactive, -1 is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.ViewDirection
Accesses the vector (in Model Space WCS coordinates) from the view's target to the view's camera. This also represents the point coordinate set by the AutoCAD VPOINT command.

Autodesk.AutoCAD.DatabaseServices.Viewport.ViewHeight
Accesses the height (in display coordinate system coordinates) of the Model Space view within the viewport. Zooming the view out within the viewport increases this value and zooming in decreases this value.

Autodesk.AutoCAD.DatabaseServices.Viewport.FrontClipDistance
Accesses the distance (along the camera-target line) from the target to the front clipping plane. Positive values indicate that the clipping plane is in front of the target (that is, between the target and the camera) whereas negative values indicate the clipping plane is behind the target.

Autodesk.AutoCAD.DatabaseServices.Viewport.BackClipDistance
Accesses the distance (along the camera-target line) from the target to the back clipping plane. Positive values indicate that the clipping plane is in front of the target (that is, between the target and the camera) whereas negative values indicate the clipping plane is behind the target.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsIconAtOrigin
Assesses if the viewport is currently set to have the UCS icon follow the current UCS origin, as long as the origin is far enough within the viewport to allow the icon to display properly. If the icon is not set to follow the UCS origin in the viewport, then false is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.SunId
Accesses the Sun object associated with this viewport. If not sun object has been set, it returns Null.

Autodesk.AutoCAD.DatabaseServices.Viewport.Locked
Assesses if a viewport's scale is locked. When a viewport is locked, its zoom factor relative to paperspace cannot be changed via AutoCAD commands such as ZOOM and VIEW.

Autodesk.AutoCAD.DatabaseServices.Viewport.CustomScale
Accesses the custom scale for the viewport. The custom scale defines the relationship of units in paperspace to units in the viewport. For example, a custom scale of 0.5 would indicate that 1 unit in the viewport maps to 0.5 units in paperspace.

Autodesk.AutoCAD.DatabaseServices.Viewport.StandardScale
This function returns the scale of a viewport by using a standard scale defined by the StdScaleType enumeration. Possible values are:.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsPerViewport
Assesses the value of UCSVP for the viewport. If ucsvp is true, then the UCS that is saved with this viewport will become active whenever the viewport is made active.

Autodesk.AutoCAD.DatabaseServices.Viewport.ShadePlot
Accesses the shade plot mode of the current viewport. The shade plot mode specifies how the current viewport will plot.

Autodesk.AutoCAD.DatabaseServices.Viewport.Background
Accesses the object ID for the background of the current viewport. Returns NULL if no background has been defined.

Autodesk.AutoCAD.DatabaseServices.Viewport.ShadePlotId
Accesses the shade object associated with this viewport. The shade object is a visual style or render preset that defines how the current viewport will plot.