Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.ImageFilename
Returns the full path to the image file name associated with this background. Returns null if no image file has been set.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.XOffset
Returns the X axis offset value. The value can range from -1 to 1.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.YOffset
Returns the Y axis offset value. The value can range from -1 to 1.