Autodesk.AutoCAD.DatabaseServices.AssocValueDependency
A concrete dependency class that represents a dependency on a scalar value, such as on a numerical variable. The dependent-on object needs to expose AssocValueProviderPE protocol extension class that is used to obtain the value from the object. It is possible to specify the name of the value in case the object provides more than one value.