Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits
This .NET class wraps the AcGiNonEntityTraits ObjectARX class. The NonEntityTraits class implements empty DrawableTraits and AcGiSubEntityTraits interfaces to allow non-entity drawables, such as materials, to elaborate their unique properties through DrawableTraits.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.SetupForEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
This call initializes the entire SubEntityTraits and DrawableTraits from the entity. This is more efficient than setting each property individually. The default implementation of Entity.SetAttributes() uses this method.
entity:  Input entity

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.AddLight(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Drawables that emit light can add one (or more) "lights" to the model. A unique object id must be used for each light, though an object may pass in it's own object Id.
lightId:  Input the added light.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.LineTypeScale
The scaling factor of linetype can be varied by this trait. A value of 1.0 is the standard scaling, 2.0 will cause the linetype dashes to be twice as long and a value of 0.5 will reduce them to half their normal length.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Thickness
Thickness is an extrusion in WCS units along the positive Z axis. The extrusion vector is calculated as (Z*dthickness) * modelTransform. It only affects selected primitives: as pline, polyline, arc, circle and shx text.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Sectionable
Returns true if the graphics primitives drawn with this object will participate in sectioning. Returns false if the graphics primitives will not be affected by sectioning operations.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.DrawFlags
Returns the current draw flags value. The default is kNoDrawFlags.