Autodesk.AutoCAD.DatabaseServices.TextEditorColumns.Gutter
Gets and sets the gutter value of the column object in editor. This wraps the ObjectARX AcDbTextEditorColumns::gutter() and AcDbTextEditorColumns::setGutter() methods.