Autodesk.AutoCAD.DatabaseServices.Section
This .NET class wraps the AcDbSection ObjectARX class. It represents the section plane entity in AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Section.AddVertex(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Inserts or adds a new vertex to the section plane. If nInsertAt is less than zero, or is equal to or more than the number of vertices, the new vertex will be added after the last vertex.
nInsertAt:  Input index at which to add the new vertex
pt:  Input position of the new vertex

Autodesk.AutoCAD.DatabaseServices.Section.RemoveVertex(System.Int32)
Removes a vertex from the section plane. The first vertex cannot be removed.
nIndex:  Input index of the vertex to remove
nHeightType:  Input one of the Height enum values
fHeight:  Input height

Autodesk.AutoCAD.DatabaseServices.Section.Height(Autodesk.AutoCAD.DatabaseServices.SectionHeight)
Returns the height of the section plane above or below the section line. The returned height is the indicator height when the section plane type is either plane or boundary, since the cut extends infinitely in the vertical direction for these two types. The height of the cut is returned when the section plane type is volume.
nHeightType:  Input one of the SectionHeight enum values

Autodesk.AutoCAD.DatabaseServices.Section.GenerateSectionGeometry(Autodesk.AutoCAD.DatabaseServices.Entity,System.Array&,System.Array&,System.Array&,System.Array&,System.Array&)
This function generates 2D or 3D section geometry. Sectionable entities include 3dSolid, Surface, Body, and Region.
pEnt:  Input sectionable entity
pIntFillEnts:  Return array containing intersection boundary geometry
pBackgroundEnts:  Return array containing intersection fill annotation geometry
pForegroundEnts:  Return array containing background geometry
pFurveTangencyEnts:  Return array containing foreground geometry
pCurveTangencyEnts:  Return array containing curve tangency geometry

Autodesk.AutoCAD.DatabaseServices.Section.IsSlice
Specifies if a section object is a slice type. If it is, the state will be set as kBoundary and all jogs will be removed.

Autodesk.AutoCAD.DatabaseServices.Section.ThicknessDepth
Returns the thickness depth of a slice type section. Else it returns 0.0.

Autodesk.AutoCAD.DatabaseServices.Section.Name
Returns the name of the section plane. The name should not be blank and should be unique. It cannot contain the vertical bar, or pipe, character ("|").

Autodesk.AutoCAD.DatabaseServices.Section.ViewingDirection
Returns a unit vector that specifies the viewing direction of the section plane. The returned vector is perpendicular to the first segment's plane.

Autodesk.AutoCAD.DatabaseServices.Section.VerticalDirection
Returns a unit vector specifying the vertical direction of the section plane. The returned vector is on first segment's plane, perpendicular to the section line.

Autodesk.AutoCAD.DatabaseServices.Section.Normal
Returns the normal  vector. The returned unit vector is perpendicular to the first segment of the section plane.

Autodesk.AutoCAD.DatabaseServices.Section.IndicatorTransparency
Returns the transparency value for the section plane indicator. The transparency value is in the range 1 to 100.

Autodesk.AutoCAD.DatabaseServices.Section.NumVertices
Returns the number of vertices on the section line of the section plane. A valid section plane has a minimum of two vertices.

Autodesk.AutoCAD.DatabaseServices.Section.SectionPlaneOffset
Returns the section plane offset distance. The offset is the distance between the section plane and the parallel plane passing through WCS origin. If the section line has multiple segments, it is the plane of the first segment.