Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadHardOwnershipId
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteHardOwnershipId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadSoftOwnershipId
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteSoftOwnershipId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadHardPointerId
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteHardPointerId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadSoftPointerId
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteSoftPointerId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadString
This interface, when implemented, checks filer status. If the status is OK, it reads the data into the System.String reference, and returns it.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteString(System.String)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadHandle
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteHandle(Autodesk.AutoCAD.DatabaseServices.Handle)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
handle:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadInt32
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteInt32(System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadInt16
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteInt16(System.Int16)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadUInt32
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteUInt32(System.UInt32)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadUInt16
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteUInt16(System.UInt16)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadByte
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteByte(System.Byte)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadBoolean
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteBoolean(System.Boolean)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadDouble
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteDouble(System.Double)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadPoint2d
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WritePoint2d(Autodesk.AutoCAD.Geometry.Point2d)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadPoint3d
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WritePoint3d(Autodesk.AutoCAD.Geometry.Point3d)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadVector2d
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteVector2d(Autodesk.AutoCAD.Geometry.Vector2d)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadVector3d
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteVector3d(Autodesk.AutoCAD.Geometry.Vector3d)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadScale3d
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteScale3d(Autodesk.AutoCAD.Geometry.Scale3d)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadBytes(System.Byte[])
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  A pre-allocated memory area to read bytes into

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteBytes(System.Byte[])
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadAddress
The implementation of this function should follow that of the ObjectARX internal filers. It should:.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteAddress(System.IntPtr)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ExtendedMinorVersion
Gets the drawing file minor version.