Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d
This .NET class wraps the AcGeAugPolyline3d ObjectARX class. It represents a mathematical entity used to support different types of spline curves in 3D space.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,System.Double,System.Double,System.Double)
Constructs polyline which approximates the input curve. Each vertex of the polyline lies on the input curve. The maximum distance from any point on any segment of the polyline to the input curve does not exceed eps.
curve:  Input any 3D curve
fromParameter:  Input parameter value on curve
toParameter:  Input parameter value on curve (must be larger than fromParam)
eps:  Input approximation distance

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.#ctor
Default constructor. Used as a placeholder only. No data members are allocated.