Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterVolume
This class encapsulates the data required to describe a spatial filter's volume. Properties of this class correlate to the arguments used by the SpatialFilter.getVolume ObjectARX function.