Autodesk.AutoCAD.DatabaseServices.DetailSymbol.#ctor
This .NET method wraps the ObjectARX method. For internal use only.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.IsOverriddenProperty(Autodesk.AutoCAD.DatabaseServices.DetailSymbolOverriddenProperty)
Tests the given flag to see if the property is overridden.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.SymbolStyleId
The object ID of the DetailViewStyle object associated with this entity. Value is the ObjectId.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.Scale
The scale of the detail symbol entity. Value is double.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.Identifier
The identifier of the detail symbol. Value is String.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.BoundaryType
The type of the detail symbol boundary. Value is NAMESPACE_ACDB::DetailSymbolBoundaryType.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.ModelEdgeType
The type of the detail symbol Model Edge. Value is NAMESPACE_ACDB::DetailViewModelEdge.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.DisplayIdentifier
Returns flag indicating whether the detail symbol's identifier is to be displayed. Value is Boolean.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.OwningViewScale
Returns the parent view's scale. Value is double.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.Origin
Returns the detail symbol's origin. Value is Point3d.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.Direction
Returns the detail symbol's direction vector. Value is Vector3d.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.BoundarySize
Returns the detail symbol's boundary size vector. The value is Vector2d.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.ModelEdgeOrigin
Returns the origin of the detail symbol's model edge (full boundary around detail view). Value is Point3d.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.ModelEdgeDirection
Returns the direction of the detail symbol's model edge (full boundary around detail view). Value is Vector3d.