Autodesk.AutoCAD.GraphicsInterface.ShadowParameters
This .NET class wraps the AcGiShadowParameters ObjectARX class. This is a container class for all shadow related light properties.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ShadowMapSize
Returns the shadow map size. The returned value should be one of: 64, 128, 256, 512, 1024, 2048, or 4096.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ShadowMapSoftness
Returns the softness (or fuzziness) of the edge of the shadow. This value represents the number of pixels at the edge of the shadow that are blended into the underlying image.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ShadowSamples
Returns the number of shadow rays to shoot for the light. This controls the softness of sampled shadows.