Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits
This .NET class wraps the AcGiSpotLightTraits ObjectARX class. This class represents a spotlight source. Spotlights emit lights in a specific direction, and have an associated "light cone."