Autodesk.AutoCAD.DatabaseServices.UnderlayHost.GetFile(System.String,System.String)
Gets an underlay file. If password is set to null but is required by the drawing, this function will prompt the user for a password.
path:  Input fully qualified path to the file to open
password:  Input optional password