Autodesk.AutoCAD.DatabaseServices.CustomScale.ToString
Returns an equivalent string representation of this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.CustomScale.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
provider:  Input System.IFormatProvider object definition.

Autodesk.AutoCAD.DatabaseServices.CustomScale.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.CustomScale,Autodesk.AutoCAD.Geometry.Tolerance)
This method compares this CustomScale object to a. It returns a value that indicates whether the difference between the two falls within the range of tolerance.
a:  Input custom scale to compare
tolerance:  Input tolerance range

Autodesk.AutoCAD.DatabaseServices.CustomScale.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.