Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo
This .NET class wraps the AcFileDependencyInfo ObjectARX class. It describes a file dependency entry.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.ToString
Returns an equivalent string representation of this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
provider:  Culture-specific format string

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.FullFileName
Accesses the saved full path name.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.FileName
Accesses the saved base file name without the path.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.FoundPath
Accesses the alternate path at which the file was found, if any.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.FingerprintGuid
Accesses the fingerprint GUID from the .dwgs.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.VersionGuid
Accesses the version GUID.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.Feature
Accesses the feature name (for example, "Acad:Xref").

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.IsModified
Accesses the current file-modified status.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.IsAffectsGraphics
Assesses if the entry affects the picture.