Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.SetOrientation(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Sets norm to be the Fcf plane normal and dir to be the X-direction for the Fcf. Both values are specified in WCS coordinates. dirmust be perpendicular to norm.
norm:  Input vector (in WCS) to be used to define the new plane that will contain the Fcf
dir:  Input X-Direction vector (WCS) for the Fcf

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.GetBoundingPoints
This function returns all the consecutive distinct corner points of the Fcf object. Used in order, these points could be used to define a pline that overlays the border of the complete Fcf object.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.GetBoundingPolyline
This function returns a Point3dCollection as follows:.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Location
Accesses the insertion point (in WCS) of the Fcf object. The "insertion" point for an Fcf is the middle of the left edge of its first line.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Direction
Accesses the X-direction vector (in WCS) for the object. The X-direction vector determines the direction that the object goes away from its "location" point.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimclrd
Accesses the current DIMCLRD value for the feature control frame. If the value is overridden for this dimension, then that value is returned. See the System Variables section of the AutoCAD Command Reference manual for information on DIMCLRD.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimclrt
Accesses the current DIMCLRT value for the feature control frame. If the value is overridden for this dimension, then that value is returned. See the System Variables section of the AutoCAD Command Reference manual for information on DIMCLRT.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimgap
Accesses the current DIMGAP value for the feature control frame. If the value is overridden for this feature control frame, then that value is returned. See the System Variables section of the AutoCAD Command Reference for information on DIMGAP.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimscale
Accesses the current DIMSCALE value for the feature control frame. If the value is overridden for this dimension, then that value is returned. See the System Variables section of the AutoCAD Command Reference manual for information on DIMSCALE.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimtxsty
Accesses the objectId of the textStyle specified by the current DIMTXSTY value of the feature control frame. If the value is overridden for this dimension, then that value is returned. See the System Variables section of the AutoCAD Command Reference manual for information on DIMTXSTY.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimtxt
Accesses the current DIMTXT value for the feature control frame. If the value is overridden for this dimension, then that value is returned. See the System Variables section of the AutoCAD Command Reference manual for information on DIMTXT.