Autodesk.AutoCAD.DatabaseServices.Entity
This .NET class wraps the AcDbEntity ObjectARX class. It is the base class for all database objects having a graphical representation.

Autodesk.AutoCAD.DatabaseServices.Entity.SetLayerId(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
This method sets entity to reference the LayerTableRecord identified by the name specified in newValue. For an BlockReference entity, this method will also update any associated SequenceEnd subentity..
newValue:  Input name of the LayerTableRecord to be referenced by the entity
allowHidden:  Input Boolean indicating whether to allow newValue to specify a hidden layer

Autodesk.AutoCAD.DatabaseServices.Entity.SetPropertiesFrom(Autodesk.AutoCAD.DatabaseServices.Entity)
This method copies the.
entityPointer:  Input entity from which to copy the properties

Autodesk.AutoCAD.DatabaseServices.Entity.GetGraphicsMarkersAtSubentityPathIntPtr(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Entities use various graphic primitives to draw themselves. Part of this mechanism is the ability to associate an integer identifier called a graphics system marker (or, GS marker) with each primitive or with groups of primitives. Through the use of certain selection mechanisms the GS marker for the actual subentity selected on screen can be obtained and used with this function and several other functions for various purposes such as highlighting or unhighlighting the subentity on screen.
subPath:  Input FullSubentityPath object that contains an SubentId property with the information necessary to determine the subentity (or subentities) for which the GS Marker(s) is requested.

Autodesk.AutoCAD.DatabaseServices.Entity.Highlight(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,System.Boolean)
This function uses the FullSubentityPath ID to determine which subentity in the entity is desired. It then highlights that subentity on screen. If no FullSubentityPath argument is provided, then the entire entity will be highlighted..
subId:  Input FullSubentityPath that identifies the subentity to highlight
highlightAll:  Input Boolean indicating whether to highlight in all viewports

Autodesk.AutoCAD.DatabaseServices.Entity.Highlight
This function highlights the entire entity on the screen.

Autodesk.AutoCAD.DatabaseServices.Entity.Unhighlight(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,System.Boolean)
This function uses the FullSubentityPath id to determine which subentity in the entity is desired. It then unhighlights that subentity on screen. If no FullSubentityPathargument is provided, then the entire entity will be unhighlighted..
subId:  Input FullSubentityPath that identifies which subentity to unhighlight
highlightAll:  Input Boolean indicating whether to unhighlight in all viewports

Autodesk.AutoCAD.DatabaseServices.Entity.Unhighlight
This unhighlights the entire entity on screen.

Autodesk.AutoCAD.DatabaseServices.Entity.GetObjectSnapPoints(Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes,System.Int32,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.Matrix3d)
This function behaves exactly as its counterpart without the insertionMat parameter. Entities contained in a block will receive the block transformation in the insertionMat parameter.
snapMode:  Input osnap mode being requested
gsSelectionMark:  Input GS marker of the subentity involved in the object snap operation
pickPoint:  Input point (in WCS coordinates) picked during the object snap operation
lastPoint:  Input point (in WCS coordinates) selected just before pickPoint
viewTransform:  Input transformation matrix to transform from WCS to DCS
snapPoints:  Input pre-existing array to append osnap points to (may already contain points); output with object snap points appended
geometryIds:  Not in use
insertionMat:  Input block transformation

Autodesk.AutoCAD.DatabaseServices.Entity.GetObjectSnapPoints(Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes,System.Int32,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection)
This function must use the material provided in snapMode, gsSelectionMark, pickPoint, lastPoint, and viewTransform to determine all appropriate osnap points for the entity. It must then append all such osnap points to the snapPoints array.
snapMode:  Input osnap mode being requested
gsSelectionMark:  Input GS marker of the subentity involved in the object snap operation
pickPoint:  Input point (in WCS coordinates) picked during the object snap operation
lastPoint:  Input point (in WCS coordinates) selected just before pickPoint
viewTransform:  Input transformation matrix to transform from WCS to DCS
snapPoints:  Input pre-existing array to append osnap points to (may already contain points); output with object snap points appended
geometryIds:  Not in use

Autodesk.AutoCAD.DatabaseServices.Entity.GetGripPoints(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.IntegerCollection)
This function supports "old style" grips, in applications that existed before the enhancement of grip functionality.
gripPoints:  Input pre-existing array to append the grip points to; output with the entity's grip points appended
snapModes:  not currently used
geometryIds:  not currently used

Autodesk.AutoCAD.DatabaseServices.Entity.MoveGripPointsAt(Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.Vector3d)
This function is intended to be called by AutoCAD during a grip edit of the entity. However, it is certainly possible for ObjectARX applications to call this function.
indices:  Input array containing index values (which correspond to grip points reported by the GetGripPoints() method) that indicate which grip points are currently "hot"
offset:  Input vector (in WCS coordinates) indicating the direction and magnitude that the grip points have been translated

Autodesk.AutoCAD.DatabaseServices.Entity.GetStretchPoints(Autodesk.AutoCAD.Geometry.Point3dCollection)
This function is not intended to be called by ObjectARX applications. However, it is possible to do so (for example, as a pass-through from the GetGripPoints() method).
stretchPoints:  Input pre-existing array to append the stretch points to; output with the entity's stretch points appended

Autodesk.AutoCAD.DatabaseServices.Entity.MoveStretchPointsAt(Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.Vector3d)
This function is intended to be called by AutoCAD during execution of a stretch command in which the entity has been selected. However, it is certainly possible for ObjectARX applications to call this function.
indices:  Input array containing index values (which correspond to stretch points reported by the GetStretchPoints() method) that indicate which stretch points are being translated
offset:  Input vector (in WCS coordinates) indicating the direction and magnitude that the stretch points have been translated

Autodesk.AutoCAD.DatabaseServices.Entity.List
This function is intended to be called from AutoCAD whenever the entity is selected during the LIST command. However, it can be called from ObjectARX applications if desired.

Autodesk.AutoCAD.DatabaseServices.Entity.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
This function provides a means by which AutoCAD and ObjectARX applications can ask the entity to apply a transformation matrix (xform) to itself.
transform:  Input transformation matrix to be applied to the entity

Autodesk.AutoCAD.DatabaseServices.Entity.GetTransformedCopy(Autodesk.AutoCAD.Geometry.Matrix3d)
This function creates a clone of the entity, applies the transform transformation matrix to the clone, and then returns the transformed clone.
transform:  Input matrix by which to transform the copy of the entity

Autodesk.AutoCAD.DatabaseServices.Entity.Explode(Autodesk.AutoCAD.DatabaseServices.DBObjectCollection)
This function is primarily intended for AutoCAD to call as part of an explode operation that includes this entity. However, this function can be used by ObjectARX applications to obtain a collection of pointers to non-database-resident entity objects that are what the entity considers to be its exploded parts.
entitySet:  Input collection of pointers to new entities; this array may already contain pointers from other entities' explode() methods

Autodesk.AutoCAD.DatabaseServices.Entity.RecordGraphicsModified(System.Boolean)
This method sets the entity's state to indicate whether or not the entity should be updated on screen when it is closed. If the entity is set not to update, then any changes made will appear the next time the entity is regenerated..
setModified:  Input Boolean value to indicate if the entity's graphics should be updated on screen when the object is closed

Autodesk.AutoCAD.DatabaseServices.Entity.SetDatabaseDefaults(Autodesk.AutoCAD.DatabaseServices.Database)
This function sets the entity's:.
sourceDatabase:  Input database whose defaults will be used to set the values of the entity

Autodesk.AutoCAD.DatabaseServices.Entity.SetDatabaseDefaults
This function sets the entity's.

Autodesk.AutoCAD.DatabaseServices.Entity.SetDragStatus(Autodesk.AutoCAD.DatabaseServices.DragStatus)
This function is called when a drag operation involving this entity is starting, ending, or aborting. The status argument provides information about what is happening with the drag operation.
status:  Value describing the status of the drag operation; one of the values from the DragStat enumeration

Autodesk.AutoCAD.DatabaseServices.Entity.SetSubentityGripStatus(Autodesk.AutoCAD.DatabaseServices.GripStatus,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This function is called with a status value of GripsToBeDeleted when the grips for the subentity are about to be deleted in the host application. This notification allows the entity to perform any required resource management tasks before the grip's GripStatus objects and any alternate base point objects pointed to by the GripStatus objects are deleted. This notification may be sent more than once for a given grip edit session. If the grip edit session is not over when this notification is sent, the entity will subsequently receive a call to its GetGripPoints() function to acquire new grip points to be used by the grip edit session.
status:  Input the status of the grip operation
subentity:  Input the subentity on the object whose grip status changed

Autodesk.AutoCAD.DatabaseServices.Entity.JoinEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
This wraps AcDbJoinEntityPE::joinEntity, which when implemented for an Entity, it can be used to join two supported entities together. Some implementations might require the this and the secondary entity be of the same type, while other implementations might convert the data from the secondary entity to match the type of the this entity.
secondaryEntity:  The secondary entity, which provides the data to be joined to the this entity.

Autodesk.AutoCAD.DatabaseServices.Entity.JoinEntities(Autodesk.AutoCAD.DatabaseServices.Entity[])
This wraps AcDbJoinEntityPE::joinEntities(), which when implemented for an Entity can be used to join supported entities together. Some implementations might require the entities be of the same type, while other implementations might convert the data from the other entities to match the type of the this entity.
otherEntities:  The other entities to be joined to the primary entity. Note, some implementations might require all of these entities to be of the same type as the primary entity.

Autodesk.AutoCAD.DatabaseServices.Entity.CollisionType
Accesses the collision detection treatment for this entity. Subclasses may override this method to customize how the class interacts in collision-aware features.

Autodesk.AutoCAD.DatabaseServices.Entity.CloneMeForDragging
Accesses whether a clone should be created for use in a dragging operation. AutoCAD has always created a clone in the past, but due to entities with large amounts of data (for example, polylines) it is sometimes desirable to have AutoCAD perform dragging with the original entity.

Autodesk.AutoCAD.DatabaseServices.Entity.ForceAnnoAllVisible
Accesses the current ANNOALLVISIBLE value for the database.