Autodesk.AutoCAD.GraphicsInterface.CommonDraw.RegenType
Read-only.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.RegenAbort
Provides a means to find out if an immediate termination of the graphics regeneration is requested by the system. If the return value is false, then all is well. But, if the return value is true, then an immediate clean up and return should be accomplished.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.SubEntityTraits
Returns the SubEntityTraits object. The object gives the user control of, and access to, the attribute (color, layer, linetype, etc.) settings of the current geometry.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.RawGeometry
Returns the current geometry class as an Geometry. The pointer is guaranteed to be not NULL. This function allows routines to function in both a worldDraw context and a viewportDraw context.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.Context
Returns the controlling context. The pointer is guaranteed to be not NULL.