Autodesk.AutoCAD.DatabaseServices.Arc.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
This constructor creates an arc using the values passed in. center must be in WCS coordinates. The arc is initialized with a thickness of 0.0.
center:  Input the center point of the arc.
normal:  Input the normal vector of the plane containing the arc.
radius:  Input the radius of the arc.
startAngle:  Input the starting angle of the arc.
endAngle:  Input the ending angle of the arc.

Autodesk.AutoCAD.DatabaseServices.Arc.#ctor(Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.Double,System.Double)
This constructor creates an arc using the values passed in. center must be in WCS coordinates. The arc is initialized with a normal of (0,0,1) and a thickness of 0.0.
center:  Input the center point of the arc.
radius:  Input the radius of the arc.
startAngle:  Input the starting angle of the arc.
endAngle:  Input the ending angle of the arc.

Autodesk.AutoCAD.DatabaseServices.Arc.#ctor
Default constructor. Initializes the normal to (0,0,1), the center point to (0,0,0), the radius, start, and end angles to 0.0. The radius needs to be changed to a non-zero value before closing the arc for the first time. The center point and normal must be in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Arc.Normal
Accesses the normal vector of the plane containing the arc. normal must be in WCS coordinates and must be non-zero length.