Autodesk.AutoCAD.Geometry.BoundBlock2d.Contains(Autodesk.AutoCAD.Geometry.Point2d)
Returns true if the point belongs to the block. Returns false otherwise.
point:  Input point to test whether the point belongs to the block

Autodesk.AutoCAD.Geometry.BoundBlock2d.IsDisjoint(Autodesk.AutoCAD.Geometry.BoundBlock2d)
Returns true if the input block does not intersect with this block. Returns false otherwise.
block:  Input another Autodesk.AutoCAD.Geometry.BoundBlock2d object.

Autodesk.AutoCAD.Geometry.BoundBlock2d.Direction1
Read-only.

Autodesk.AutoCAD.Geometry.BoundBlock2d.IsBox
Returns true if the block is a coordinate box. Returns false otherwise.