Autodesk.AutoCAD.GraphicsInterface.Source
This .NET class wraps the AcGiMaterialMap::Source ObjectARX class. This enumeration provides values that describe the source of an MaterialMap object's image data.