Autodesk.AutoCAD.DatabaseServices.MText.#ctor
The constructor creates a default, empty object. The default values are:.

Autodesk.AutoCAD.DatabaseServices.MText.SetContentsRtf(System.String)
This method sets the contents of the MText object from the RTF-encoded text string pointed to by unnamed. RTF codes are translated to MText codes. Fonts, colors, tabs, and indents are preserved. Bullets and numbered lists are mapped to hanging paragraphs using the implied setting for tabs and indents.
value:  Input RTF-encoded string

Autodesk.AutoCAD.DatabaseServices.MText.CorrectSpelling
This function is intended to be used internally, and requires that additional speller initialization be performed before calling. It cannot be used from within ObjectARX applications.

Autodesk.AutoCAD.DatabaseServices.MText.GetBoundingPoints
Appends 4 points to the collection as follows:.

Autodesk.AutoCAD.DatabaseServices.MText.ExplodeFragments(Autodesk.AutoCAD.DatabaseServices.MTextFragmentCallback,System.Object,Autodesk.AutoCAD.GraphicsInterface.WorldDraw)
This function runs through the MText object's text string breaking it up into fragments, calling the fragment elaboration function enumerator for each fragment. The WorldDraw object of context is used.
enumerator:  Input fragment elaboration callback function
userData:  Input user data
context:  Input WorldDraw object

Autodesk.AutoCAD.DatabaseServices.MText.ConvertFieldToText
If the contents of MText contains fields, this function converts them to text and removes the fields. It does not evaluate the fields before converting them.

Autodesk.AutoCAD.DatabaseServices.MText.Rotation
Accesses the angle between the X axis of the OCS for the normal vector of the current AutoCAD editor's UCS and the projection of the MText object's direction vector onto the plane of the AutoCAD editor's current UCS. The rotation value is in radians, with positive angles as counterclockwise when looking down the UCS normal towards the UCS origin.

Autodesk.AutoCAD.DatabaseServices.MText.Width
Accesses the maximum width setting used by the MText object for word wrap formatting. It is possible that none of the lines resulting from word wrap formatting will reach this width value. Words which exceed this width value will not be broken, but will extend beyond the given width. The MText.ActualWidth member function returns the actual width of the text, regardless of the maximum width setting.

Autodesk.AutoCAD.DatabaseServices.MText.Ascent
Accesses the height of the maximum ascender for the first line of the text. This value can be used with the Text.Descent function to help align multiple MText objects in a table or grid.

Autodesk.AutoCAD.DatabaseServices.MText.Descent
Accesses the height of the maximum descender for the last line of the text. This value can be used with the MText.Ascent property to help align multiple MText objects in a table or grid.

Autodesk.AutoCAD.DatabaseServices.MText.Contents
Accesses the character contents of the MText object. Formatting data used for word wrap calculations is removed before the string is copied.

Autodesk.AutoCAD.DatabaseServices.MText.ContentsRTF
Returns an RTF encoded string that is a translated version of the contents of the AcDbMText object. MText codes are translated to RTF codes. Fonts, colors, tabs, and indents are preserved. The conversion uses 24 as the default point size. That is, text with no height override will have a point size of 24 and text with a height override will have a point size of the height override multiplied by 24. The caller is responsible for freeing the memory used by the returned string (preferrably by using acutDelString().

Autodesk.AutoCAD.DatabaseServices.MText.ActualWidth
Accesses the overall width of the bounding rectangle that surrounds the formatted text. Note that this value may be different from the value returned by MText.Width.

Autodesk.AutoCAD.DatabaseServices.MText.NonBreakSpace
Accesses the string "~". This function can be used in place of the string constant "~" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "~" indicates a nonbreaking space.

Autodesk.AutoCAD.DatabaseServices.MText.OverlineOn
Accesses the string "O". This function can be used in place of the string constant "O" in order to make your code more understandable. When used in the string that's returned from Text.Contents, the "O" indicates overline on.

Autodesk.AutoCAD.DatabaseServices.MText.OverlineOff
Accesses the string "o". This function can be used in place of the string constant "o" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "o" indicates overline off.

Autodesk.AutoCAD.DatabaseServices.MText.UnderlineOn
Accesses the string "L". This function can be used in place of the string constant "L" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "L" indicates underline on.

Autodesk.AutoCAD.DatabaseServices.MText.UnderlineOff
Accesses the string "l". This function can be used in place of the string constant "l" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "l" indicates underline off.

Autodesk.AutoCAD.DatabaseServices.MText.StrikethroughOn
Gets the mtext strike-through turning on string. This wraps the AcDbMText::strikethroughOn().

Autodesk.AutoCAD.DatabaseServices.MText.StrikethroughOff
Gets the mtext strike-through turning off string. This wraps the AcDbMText::strikethroughOn().

Autodesk.AutoCAD.DatabaseServices.MText.ColorChange
Accesses the string "C". This function can be used in place of the string constant "C" in order to make your code more understandable. When used in the string that's returned from MText.contents, the "C" indicates a color change.

Autodesk.AutoCAD.DatabaseServices.MText.FontChange
Accesses the string "F". This function can be used in place of the string constant "F" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "F" indicates a font change.

Autodesk.AutoCAD.DatabaseServices.MText.HeightChange
Accesses the string "H". This function can be used in place of the string constant "H" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "H" indicates a height change.

Autodesk.AutoCAD.DatabaseServices.MText.ObliqueChange
Accesses the string "Q". This function can be used in place of the string constant "Q" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "Q" indicates an oblique change.

Autodesk.AutoCAD.DatabaseServices.MText.TrackChange
Accesses the string "T". This function can be used in place of the string constant "T" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "T" indicates a tracking change.

Autodesk.AutoCAD.DatabaseServices.MText.LineBreak
Accesses the string "p". This function can be used in place of the string constant "p" in order to make your code more understandable. When used in a string that is returned from MText.Contents, the "p" indicates a line break.

Autodesk.AutoCAD.DatabaseServices.MText.ParagraphBreak
Accesses the string "P". This function can be used in place of the string constant "P" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "P" indicates a paragraph break.

Autodesk.AutoCAD.DatabaseServices.MText.StackStart
Accesses the string "S". This function can be used in place of the string constant "S" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "S" indicates a stack start.

Autodesk.AutoCAD.DatabaseServices.MText.AlignChange
Accesses the string "A". This function can be used in place of the string constant "A" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "A" indicates an alignment change.

Autodesk.AutoCAD.DatabaseServices.MText.BlockBegin
Accesses the string "{". This function can be used in place of the string constant "{" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "{" indicates a block beginning.

Autodesk.AutoCAD.DatabaseServices.MText.BlockEnd
Accesses the string "}". This function can be used in place of the string constant "}" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "}" indicates a block ending.

Autodesk.AutoCAD.DatabaseServices.MText.LineSpacingStyle
Accesses the line spacing style, either AtLeast (the line spacing is a minimum value) or Exactly (the line spacing is absolute). See LineSpacingStyle for more information and examples.

Autodesk.AutoCAD.DatabaseServices.MText.LineSpacingFactor
Accesses the line spacing factor (a value between 0.25 and 4.00). See LineSpacingStyle for more information and examples.

Autodesk.AutoCAD.DatabaseServices.MText.BackgroundScaleFactor
Read-only Accesses.