Autodesk.AutoCAD.Geometry.PointOnSurface
This .NET class wraps the AcGePointOnSurface ObjectARX class. It represents a point on a surface. This class encapsulates all of the geometric information of a point on a surface, including its parameter value, 3D coordinates, derivatives, and normal vector.

Autodesk.AutoCAD.Geometry.PointOnSurface.#ctor
Default constructor. Constructs a point on the surface AcGePlane.XYPlane at the parameter value (0,0).

Autodesk.AutoCAD.Geometry.PointOnSurface.GetPoint(Autodesk.AutoCAD.Geometry.Point2d)
Returns the coordinates of the point on surface at the specified point. This function resets the parameter value of the point on surface.
point:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnSurface.GetUDerivative(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
Returns the U-partial derivative at the specified point. order must be greater than 0 and no larger than 2. This function resets the underlying and parameter value of the point on surface.
order:  Input order of derivative
point:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnSurface.GetUDerivative(System.Int32)
Returns the U-partial derivative of the specified order. order must be greater than 0 and no larger than 2.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetVDerivative(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
Returns the V-partial derivative at the specified parameter value. order must be greater than 0 and no larger than 2. This function resets the underlying and parameter value of the point on surface.
order:  Input order of derivative
point:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnSurface.GetVDerivative(System.Int32)
Returns the V-partial derivative of the specified order. order must be greater than 0 and no larger than 2.
order:  Input order of derivative

Autodesk.AutoCAD.Geometry.PointOnSurface.GetTangentVector(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Point2d)
Maps the input tangent vector to the tangent plane at the specified parameter value. The returned vector is equal to uDeriv(1)*vec.x + vDeriv(1)*vec.y.
vector:  Input any 2D vector
point:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnSurface.GetTangentVector(Autodesk.AutoCAD.Geometry.Vector2d)
Maps the input tangent vector to the tangent plane at the point on surface. The returned vector is equal to uDeriv(1)*vec.x + vDeriv(1)*vec.y.
vector:  Input any 2D vector