Autodesk.AutoCAD.DatabaseServices.AuditInfo.RequestRegen
This method allows objects which are fixing themselves to tell audit that the windows need to be reloaded from the database. Otherwise the in-core window list remains in effect and the changes to the database are overwritten at the next save time.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.AuditPass
Two passes through each object's data are made during the AUDIT command. This method returns if it is PASS1 or PASS2.