Autodesk.AutoCAD.Colors.EntityColor.#ctor(System.Byte,System.Byte,System.Byte)
Initializes the color using the supplied RGB values. The color method defaults to ByColor.
red:  Input red value from 0 to 255
green:  Input green value from 0 to 255
blue:  Input blue value from 0 to 255

Autodesk.AutoCAD.Colors.EntityColor.#ctor(Autodesk.AutoCAD.Colors.ColorMethod,System.Int16)
Initializes the color method and color index.
value:  Input color method
index:  Input color index

Autodesk.AutoCAD.Colors.EntityColor.LookUpRgb(System.Byte)
Looks up the RGB value. colorIndex is an ACI that is to be mapped to an RGB value, where the low byte is blue, the second byte is green, and the third byte is red. The high byte is the color method.
colorIndex:  Input color value and color method

Autodesk.AutoCAD.Colors.EntityColor.IsByLayer
Wrap the ObjectARX function Color.isByLayer(). Assesses if the color method is EntityColor.ByLayer, or if the color method is EntityColor.ByACI and the ACI is EntityColor.ACIbyLayer.