Autodesk.AutoCAD.Geometry.NurbSurface
This .NET class wraps the AcGeNurbSurface ObjectARX class. It represents generic NURB parametric surface.

Autodesk.AutoCAD.Geometry.NurbSurface.SingularityInU
Returns an integer which is one of the .NurbSurfaceProperties values. The returned value is a characterization of U singularity.

Autodesk.AutoCAD.Geometry.NurbSurface.SingularityInV
Returns an integer which is one of the NurbSurfaceProperties values. The returned value is a characterization of V singularity.