Autodesk.AutoCAD.Geometry.CompositeCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d[])
Constructs a composite curve from the list of input curves. The input curves should be connected at their endpoints, although no check of this is made by the constructor. That is, the start point of each curve in the list (excluding the first curve) should be equal to the endpoint of the previous curve in the list.

Autodesk.AutoCAD.Geometry.CompositeCurve3d.GlobalToLocalParameter(System.Double)
Takes a parameter value of a point on the composite and returns the parameter value of that same point on the component curve on which it lies. The index of the component curve on which the point lies is returned in value.
value:  Input global parameter value