Autodesk.AutoCAD.GraphicsInterface.FaceData.SetColors(System.Int16[])
Sets colors to be the array of face color indices used by the FaceData object. The array must have exactly the same number of elements as there are faces in the mesh or shell it is used with. The array elements control the individual face colors. The order of the array elements corresponds with the order of the faces in the mesh or shell--the first array element is used as the color index for the first mesh or shell face, the second element for the second face, etc.
colors:  Input array of AutoCAD color indices

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetLayers(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Sets layers to be the array of LayerTableRecord object IDs used by the FaceData object. The array must have exactly the same number of elements as there are faces in the mesh or shell it is used with. The array elements control the layers the mesh or shell faces reside on--the first array element specifies the layer used for the first face, the second element for the second face, etc.
layers:  Input array of LayerTableRecord object IDs

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetNormalVectors(Autodesk.AutoCAD.Geometry.Vector3d[])
Sets normal to be the array of face normal vectors used by the FaceData object. The array must have exactly the same number of elements as there are faces in the mesh or shell it is used with. The array elements specify the normal vectors of the mesh or shell faces--the first array element specifies the normal vector for the first face, the second element for the second face, etc.
normal:  Input array of normal vectors.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetVisibility(System.Byte[])
Sets visibility to be the array of face visibility flags used by the FaceData object. The array must have exactly the same number of elements as there are faces in the mesh or shell it is used with.
visibility:  Input array of visibility flags

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetColors
Returns an array of AutoCAD color indices, one for each face in the mesh or shell with which this object is used. If the colors array has not been set, an empty array is returned.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetLayers
Returns an array of LayerTableRecord object IDs, one for each face in the mesh or shell the FaceData object is used with. If the layerId's data array has not been set, then NULL is returned.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetSelectionMarkers
Returns an array of graphic system selection markers (gsmarkers), one for each face in the mesh or shell the FaceData object is used with. If the selectionMarker's data array has not been set, then NULL is returned.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetSelectionMarkers(System.IntPtr[])
Sets selectionMarker to be the array of graphics system selection markers (gsmarkers) used by the FaceData object. The array must have exactly the same number of elements as there are faces in the mesh or shell it is used with. The array elements control the graphic system selection markers (gsmarkers) used for the mesh or shell faces--the first array element specifies the gsmarker used for the first face, the second element for the second face, etc.
selectionMarker:  Input array of non-zero graphic system selection markers.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetNormalVectors
Returns the array of normal vectors, one for each face in the mesh or shell with which this object is used. If the normal vector array has not been set, an empty array is returned.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetTrueColors
Returns the array of EntityColor objects, one for each face in the mesh or shell with which this object is used. If the true color array has not been set, an empty array is returned.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetVisibility
Returns an array of visibility flags (that is, 0 == invisible, 1 == visible), one for each face in the mesh or shell the FaceData object is used with. If the visibility flag's data array has not been set, then NULL is returned.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetMaterials(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Sets materials to the array of face materials used by the FaceData object. The array must have exactly the same number of elements as there are faces in the mesh or shell it is used with. The array elements control the individual face material. The order of the array elements corresponds with the order of the faces in the mesh or shell--the first array element is used as the material for the first mesh or shell face, the second element for the second face, etc. For faces that do not have a per-face material override, the corresponding entries should be occupied by ObjectId.Null.
materials:  Input array of materials to be set on the this object.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetMaterials
Returns the array of materials assigned to the FaceData object. Please refer to FaceData.SetMaterials for how materials are mapped to individual faces.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetMappers(Autodesk.AutoCAD.GraphicsInterface.Mapper[])
Sets mappers to be the array of face mappers used by the FaceData object. The array must have exactly the same number of elements as there are faces in the mesh or shell it is used with. The array elements control the individual face mapper. The order of the array elements corresponds with the order of the faces in the mesh or shell--the first array element is used as the mapper for the first mesh or shell face, the second element for the second face, etc. For faces that do not have a per-face mapper override, the corresponding entries should be occupied by Mapper.Identity.
mappers:  Input face mappers to be set on the this object.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetMappers
Returns the array of mappers assigned to the FaceData object. Refer to FaceData.SetMappers for how mappers are mapped to individual faces.