Autodesk.AutoCAD.DatabaseServices.Surface.UsesGraphicsCache
This property is a wrapper for the AcDbSurface::usesGraphicsCache() method which is used by AutoCAD to determine whether or not to use cached graphics for the surface. If the method returns true, then cached graphics will be used. Only database resident entities can use graphics caching, so this method is not called for entities not in an AcDbDatabase.