Autodesk.AutoCAD.DatabaseServices.DBObject.DecomposeForSave(Autodesk.AutoCAD.DatabaseServices.DwgVersion)
This member function is used to control behavior for custom objects and entities when saving to previous formats. Custom objects can decompose themselves into other objects and can add additional xdata to the objects created.
version:  DWG version being saved to

Autodesk.AutoCAD.DatabaseServices.DBObject.ReleaseExtensionDictionary
Removes the object's extension dictionary (that is, removes the object as the owner of the dictionary object) if it exists and is empty. Once removed, this function calls the dictionary's erase() method. Any reactors attached to the extension dictionary receive normal notification appropriate to an open for write, erase, close sequence.

Autodesk.AutoCAD.DatabaseServices.DBObject.UpgradeOpen
If the object is currently open OpenMode.ForRead with only one reader, then this function upgrades the object to open OpenMode.ForWrite. In the process of changing to open for write, the object is closed, thus triggering any pertinent notification.

Autodesk.AutoCAD.DatabaseServices.DBObject.DowngradeOpen
Downgrades the object from being open OpenMode.ForWrite, to being OpenMode.ForRead. In the process, all changes made to the object while it was open for write are committed to the database and appropriate notification is sent.

Autodesk.AutoCAD.DatabaseServices.DBObject.DowngradeToNotify(System.Boolean)
Restores an object from being open both OpenMode.ForNotify and OpenMode.ForWrite, to being open just OpenMode.ForNotify. The wasWritable value that was returned from the matching DBObject.upgradeFromNotify() call should be passed into this function to restore the proper open status..
wasWritable:  Input indicating if object was open for write when upgradeFromNotify was called

Autodesk.AutoCAD.DatabaseServices.DBObject.Cancel
Terminates the current open operation. All changes made to.

Autodesk.AutoCAD.DatabaseServices.DBObject.Close
Closes the object. All changes made to the object since it was opened are committed to the database, the object is marked as pageable, and a "closed" notification (as well as any other appropriate notification such as "modified", "erased", and so on) is sent.

Autodesk.AutoCAD.DatabaseServices.DBObject.SwapReferences(Autodesk.AutoCAD.DatabaseServices.IdMapping)
The purpose of this method is similar to the object ID reference translations done at the end of deep cloning. References between objects in the workset have their object IDs translated to the swapped object IDs of the referenced objects. Unlike cloning, this translation must happen in both directions. Thus, it is possible to see two different ID maps passed in on different calls to this method.
idMap:  Input refedit ID map

Autodesk.AutoCAD.DatabaseServices.DBObject.Audit(Autodesk.AutoCAD.DatabaseServices.AuditInfo)
This function is called by AutoCAD when the AUDIT command is executed. The AuditInfo object pointed to by auditInfo contains member functions that are used to determine what to do and also to report the results of the audit operation on the object.
auditInfo:  An AuditInfo object

Autodesk.AutoCAD.DatabaseServices.DBObject.DwgIn(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
This function does some internal bookkeeping, calls the object's DBObject.dwgInFields() function, and then reads in any xdata attached to the object. If the object's dwgInFields() function does not supermessage its parent class, then an assert is triggered.
filer:  DWG filer to be used for this filing operation

Autodesk.AutoCAD.DatabaseServices.DBObject.DwgOut(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
This function does some internal bookkeeping, calls the object's DBObject.dwgOutFields() function, and then writes out any xdata attached to the object. If the object's dwgOutFields() function does not supermessage its parent class, then an assert is triggered.
filer:  DWG filer to be used for this filing operation

Autodesk.AutoCAD.DatabaseServices.DBObject.DxfIn(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
This function does some internal book keeping by reading in any xdata that comes before the main entity data. The dxfIn function then calls the object's DBObject.dxfInFields() function, and then reads in any xdata that comes after the entity data.
filer:  DXF filer to be used for this filing operation

Autodesk.AutoCAD.DatabaseServices.DBObject.XDataTransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
This method applies the xform transformation matrix to any XData data types 1011, 1021, 1031, 1012, 1022, 1032, 1013, 1023, 1033, 1041, and 1042 in the object's XData. See the documentation on XData for more information on the way the transformation matrix is applied to the different data types.
transform:  Transformation matrix to be applied to the XData

Autodesk.AutoCAD.DatabaseServices.DBObject.GetReactors
This function is obsolete. One can retrieve all reactors by calling GetTransientReactors() and GetPersistentReactors().

Autodesk.AutoCAD.DatabaseServices.DBObject.SetObjectIdsInFlux
This function must be called on any newly created objects in DBObject.DeepClone or DBObject.WblockClone. It indicates that reference object IDs are not yet pointing to the correct objects. The references can be translated only when the entire deep clone operation is complete. The flag is cleared at that time.

Autodesk.AutoCAD.DatabaseServices.DBObject.GetObjectSaveVersion(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
Override this function to specify which version the object data needs to be stored in. This does not require super-messaging.
filer:  DXF filer to be used for this filing operation

Autodesk.AutoCAD.DatabaseServices.DBObject.GetObjectSaveVersion(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
Override this function to specify which version the object data needs to be stored in. This does not require super-messaging.
filer:  Filer to be used for this filing operation

Autodesk.AutoCAD.DatabaseServices.DBObject.RemoveField(System.String)
Removes the specified field. Returns the object ID of the removed field.
propertyName:  Property name whose field is to be removed

Autodesk.AutoCAD.DatabaseServices.DBObject.RemoveField
Removes the text field. Returns its field ID.

Autodesk.AutoCAD.DatabaseServices.DBObject.SetFromStyle
Sets the annotative property of an object from its (optionally) associated style. Returns true on successful return if the annotative property of the object changed.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsReallyClosing
Returns true if calling Close() at this time would really close the object completely. For example, if the object is not in a transaction, and is open for read with only one reader, then true would be returned.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsObjectIdsInFlux
This refers to a condition that occurs during deep clone operations. It returns true when the cloned objects' IDs have not yet been translated and thus cannot be used in any operations on the objects. This condition normally occurs only during CEventReactorImpl.beginDeepCloneXlation, DBObject.DeepClone, or DBObject.WblockClone. Any operations that involve ObjectId references, such as symbol table records, should be postponed until after endDeepClone. DBObject.SubClose is never called on any objects whose IDs are in flux.

Autodesk.AutoCAD.DatabaseServices.DBObject.ObjectBirthVersion
Accesses the birth version of an object. The birth version is the version in which the class was introduced. This information needs to be specified when the class is registered with AutoCAD.