Autodesk.AutoCAD.DatabaseServices.AssocActionBody.EvaluateOverride
Called from the corresponding method of the parent AssocAction class that owns this action body object. This method has to be overridden and this is how the behavior of custom actions is implemented.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.IsOwnedDependencyOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.IsExternalDependencyOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.HasDependencyCachedValueOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.IsRelevantDependencyChangeOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.AreDependenciesOnTheSameThingOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.AreDependenciesEqualOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.EvaluateDependencyOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.DependentObjectClonedOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.DBObject)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.AddMoreObjectsToDeepCloneOverride(Autodesk.AutoCAD.DatabaseServices.IdMapping,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.PostProcessAfterDeepCloneOverride(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.PostProcessAfterDeepCloneCancelOverride(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.OwnedDependencyStatusChangedOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.AssocStatus)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.IsEqualToOverride(Autodesk.AutoCAD.DatabaseServices.AssocAction)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.EvaluationPriorityOverride(Autodesk.AutoCAD.DatabaseServices.AssocEvaluationPriority&)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.GetDependentActionsToEvaluateOverride(Autodesk.AutoCAD.DatabaseServices.ActionsToEvaluateCallback)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.TransformActionByOverride(Autodesk.AutoCAD.Geometry.Matrix3d)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.DragStatusOverride(Autodesk.AutoCAD.DatabaseServices.DragStatus)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.