Autodesk.AutoCAD.DatabaseServices.TableEnumerator
This .NET class wraps the AcDbTableIterator ObjectARX class. It creates an iterator to traverse table rows, columns, and cells.

Autodesk.AutoCAD.DatabaseServices.TableEnumerator.Current
Input cell at which to  position the iterator. This should specify a cell, row, or column depending on what is being iterated.