Autodesk.AutoCAD.GraphicsSystem.View.SetViewportClipRegion(System.Int32,System.Int32[],System.Drawing.Point[])
This method is used to specify a clip region distinct from the rectangular region supplied via SetViewport(). The region consists of the union of a set of polygons (each may be self-intersecting) determined by the application of the even-odd winding rule to the specified contour; this region is open (it does not include the contour itself).
contours:  Input number of polygonal contours and the size of the counts array.
counts:  Input array where each entry corresponds to the number of device coordinate points used to specify that contour in the points array. For example, counts[i] contains the number of points that represent the (ith + 1) polygonal contour.
points:  Input array of points that specify polygonal contours.

Autodesk.AutoCAD.GraphicsSystem.View.SetView(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double)
Sets the camera parameters needed to define the transformation from world space to normalized device coordinates. All values are specified in the world space coordinate system. Ensure that the camera position and target are distinct. As well, the specified upVector cannot be parallel to the eye vector (computed as the vector from the target to the position). fieldWidth and fieldHeight help define the transformation from view space to normalized device coordinates.
position:  Input camera position.
target:  Input camera target.
upVector:  Input camera up vector.
fieldWidth:  Input width of the projection plane.
fieldHeight:  Input height of the projection plane.

Autodesk.AutoCAD.GraphicsSystem.View.Add(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsSystem.Model)
Specifies which portions of which models are viewed by this view. The proper way to employ this function is to construct a directed acyclic graph (the scene graph) of Drawable objects, each of which tells the Graphic System to draw its children by using Geometry.Draw(). Add the root of this graph (a Drawable) and the Model that handles its notifications with this method. This method always returns true.
drawable:  Input root of scene graph.
model:  Input object to which all notifications for the above scene graph are directed.

Autodesk.AutoCAD.GraphicsSystem.View.Update
When called non-interactively, this method flushes any queued graphics to the device. This may involve a full transformation and rasterization pass (which can be quite expensive).When called interactively, this method requests an update (but one is not guaranteed); the call returns immediately, and any transformation and rasterization occur asynchronously.

Autodesk.AutoCAD.GraphicsSystem.View.Flush
Use this method to stimulate an interactive View to flush its message queue, upgrade (if degradation has occurred), and attempt to render the frame. During this rendering pass, tessellated objects will employ the appropriate level of detail (which may trigger a regeneration of those objects). Only use this method during interactivity.

Autodesk.AutoCAD.GraphicsSystem.View.Hide
Makes the view invisible. Nothing from this view should appear on the device while it is hidden.

Autodesk.AutoCAD.GraphicsSystem.View.FreezeLayer(System.IntPtr)
Informs the view that the specified layer is frozen in this view. By default all layers are thawed.
layerId:  Input Layer to be treated as frozen.

Autodesk.AutoCAD.GraphicsSystem.View.ThawLayer(System.IntPtr)
Informs the view that the specified layer should be thawed in this view. ThawLayer() only needs to be called if the layer was previously frozen in the view.
layerId:  Input Layer to be treated as thawed.

Autodesk.AutoCAD.GraphicsSystem.View.Dolly(System.Double,System.Double,System.Double)
Translates the camera target and position by the specified camera space dolly amounts. All other camera parameters are left unaffected. The basis of camera space is as follows: positive Y is along the up vector, positive Z is along the eye vector from the camera position to the camera target, and X is the cross product of those two vectors.
y:  Input Camera space y dolly amount.
z:  Input Camera space z dolly amount.

Autodesk.AutoCAD.GraphicsSystem.View.Dolly(Autodesk.AutoCAD.Geometry.Vector3d)
Translates the camera target and position by the specified camera space dolly vector. All other camera parameters are left unaffected. The basis of camera space is as follows: positive Y is along the up vector, positive Z is along the eye vector from the camera position to the camera target, and X is the cross product of those two vectors.
vector:  Input camera space dolly vector.

Autodesk.AutoCAD.GraphicsSystem.View.Roll(System.Double)
Rotates the camera’s up vector about the eye vector by the specified amount in radians. Positive angles correspond to a clockwise rotation when viewed from the camera position to the camera target.
angle:  Input angular rotation about the eye vector in radians.

Autodesk.AutoCAD.GraphicsSystem.View.Orbit(System.Double,System.Double)
Orbits the camera. During orbit, the camera target and distance from position to target remain fixed; the camera position moves along the surface of a sphere described by these constraints. The X and Y parameters are in radians and correspond to angles traversed on this sphere along the cross product of the up vector and the eye vector (X) and along the up vector (Y). The X component of the orbit is performed before the Y component.
y:  Input up vector.

Autodesk.AutoCAD.GraphicsSystem.View.Zoom(System.Double)
Changes the viewing field (the focal length) of the camera to give the effect of dynamically moving in or out of a scene. The camera position and target are not changed. The specified factor must be positive.
factor:  Input zoom factor.

Autodesk.AutoCAD.GraphicsSystem.View.ZoomWindow(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Modifies the current view such that the new window displays the region defined by the input screen coordinates. The aspect ratio is automatically maintained.
lowerLeft:  Input screen coordinate of the lower-left point of the new zoom window.
upperRight:  Input screen coordinate of the upper-right point of the new zoom window.

Autodesk.AutoCAD.GraphicsSystem.View.Pan(System.Double,System.Double)
Pans the camera. During pan, the camera position and distance from position to target remain fixed; the camera target moves along the surface of a sphere described by these constraints. The X and Y parameters are in radians and correspond to angles traversed on this sphere along the cross product of the up vector and the eye vector (X) and along the up vector (Y). The X component of the pan is performed before the Y component.
y:  Input up vector

Autodesk.AutoCAD.GraphicsSystem.View.GetNumPixelsInUnitSquare(Autodesk.AutoCAD.Geometry.Point3d,System.Boolean)
Sets pixelArea's X coordinate to the number of pixels in the vertical axis of a WCS unit square and pixelArea's Y coordinate to the number of pixels in the horizontal axis of the unit square..
givenWorldpt:  Input WCS point for the center point of the display coordinate unit square.
includePerspective:  Input indicating perspective mode.

Autodesk.AutoCAD.GraphicsSystem.View.ViewportId
The viewport ID as a System.IntPtr. This is the same value as is available through the Autodesk.AutoCAD.GraphicsInterface.Viewport.ViewportId property. This is an ID that has no relation to the AutoCAD CVPORT system variable. The ID returned by this function is unique for every viewport in AutoCAD (including Paper Space AcDbViewports and tiled view viewports, AcDbViewportTableRecords), much the way a handle is for an entity.

Autodesk.AutoCAD.GraphicsSystem.View.AcadWindowId
The viewport ID as a System.IntPtr. This is the same value as is available through the Autodesk.AutoCAD.GraphicsInterface.Viewport.ViewportId property. This is an ID that has no relation to the AutoCAD CVPORT system variable. The ID returned by this function is unique for every viewport in AutoCAD (including Paper Space AcDbViewports and tiled view viewports, AcDbViewportTableRecords), much the way a handle is for an entity.

Autodesk.AutoCAD.GraphicsSystem.View.ViewportObjectId
The Autodesk.AutoCAD.DatabaseServices.ObjectId of the viewport associated with the GS view. This ObjectId may refer to either an AcDbViewport or an AcDbViewportTableRecord. Read only.

Autodesk.AutoCAD.GraphicsSystem.View.Position
Returns the camera position. Make sure not to use Position when the view is in the interactive state.

Autodesk.AutoCAD.GraphicsSystem.View.Target
Returns the camera target. Make sure not to use Target when the view is in the interactive state.

Autodesk.AutoCAD.GraphicsSystem.View.UpVector
Returns the camera up vector. Make sure not to use UpVector when the view is in the interactive state.

Autodesk.AutoCAD.GraphicsSystem.View.IsPerspective
Returns true if the projection is perspective and false otherwise. Make sure not to use IsPerspective when the view is in the interactive state.

Autodesk.AutoCAD.GraphicsSystem.View.FieldWidth
Returns the camera field width. Make sure that FieldWidth is not used when the view is in the interactive state.

Autodesk.AutoCAD.GraphicsSystem.View.ViewingMatrix
Returns the viewing matrix used to transform from world space to view space. Make sure not to use ViewingMatrix when the view is in the interactive state.

Autodesk.AutoCAD.GraphicsSystem.View.ProjectionMatrix
Returns the projection matrix used to transform from view space to normalized device space. Make sure not to use ProjectionMatrix when the view is in the interactive state.

Autodesk.AutoCAD.GraphicsSystem.View.ScreenMatrix
Returns the screen matrix used to transform from normalized device space to screen space. Make sure not to use ScreenMatrix when the view is in the interactive state.

Autodesk.AutoCAD.GraphicsSystem.View.WorldToDeviceMatrix
Returns the transformation from world space to screen space. This will be the same as the result of the concatenation of the ViewingMatrix, ProjectionMatrix, and ScreenMatrix. Make sure not to use WorldToDeviceMatrix when the view is in the interactive state.

Autodesk.AutoCAD.GraphicsSystem.View.ObjectToDeviceMatrix
Returns the transformation from model space to screen space. Make sure not to use ObjectToDeviceMatrix when the view is in the interactive state.

Autodesk.AutoCAD.GraphicsSystem.View.BackgroundId
Returns the object ID of the Background-derived object on the view, if one is set. If no background was set, it returns ObjectId.kNull.