Autodesk.AutoCAD.DatabaseServices.FormattedTableData.IsFormatEditable(System.Int32,System.Int32)
This function checks the cell state to determine if a cell format can be modified. Applications should use this function to determine if a cell is editable instead of calling cellState directly and checking the state since the semantics of an editable cell may change as new states are added.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.Unmerge(Autodesk.AutoCAD.DatabaseServices.CellRange)
Unmerges the cells in the range. The specified range can be a cell range, row range, or column range.
range:  Input cell range to unmerge

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetMergeRange(System.Int32,System.Int32)
Returns merge range. The merge range will be invalid if the cell is not part of a merge range.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.