Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotPaperMargins
Accesses the printable area of the configured paper. The values returned are in millimeters, regardless of the units selected by the user. The values are in physical media coordinates, so they are not affected by the current scale of the drawing. This function does not take into account plots that may be rotated or mirrored.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotPaperSize
Accesses the width and height of the configured paper. This is defined as the entire physical paper area including the unprintable area.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.CanonicalMediaName
Accesses the locale-independent name of the currently configured paper. For the localized version of the media name, use LocaleMediaName.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotViewportBorders
Accesses the floating model space viewport borders are plotted. Note that the viewport borders are always displayed on screen during layout mode.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShowPlotStyles
Assesses whether the object style is displayed during layout mode. This setting does not affect the plotting of pen styles.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotCentered
Assesses whether the plot will be centered. If true, the paper margins are automatically computed to position the plot in the center of the sheet.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotHidden
Assesses whether or not the objects in paperspace are processed through the hidden line algorithm. Note that this doesn't affect objects inside of floating model space viewports. A separate control, specified per viewport, controls hidden line removal within those viewports.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShadePlotResLevel
Accesses the shade plot resolution level of the current PlotSettings object. This setting specifies the resolution level at which shaded and rendered viewports will plot.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShadePlotCustomDpi
Accesses the shade plot custom dpi of the current PlotSettings object. This setting specifies the user-defined resolution at which shaded and rendered viewports will plot. This setting should be used only if the shade plot resolution level is set to ShadePlotResLevel.Custom.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotWindowArea
Accesses the portion of the layout to plot. The arguments specify the two points in paperspace positioned on the output media.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.CustomPrintScale
Accesses the custom scale, a ratio of paperspace units to media units. The CustomPrintScale property stores the current scale (actually the numerator and denominator) for the plot settings for both "computed/standard" scales and "custom" scales. It always reflects the scale that will be used to plot.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.StdScale
Accesses the standard scale value as a floating point scale. Each enumerated value in the enum StdScaleType maps to a single floating point number. This method allows an application to retrieve a standard scale without having to do a table lookup to compute the scale value.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.DrawViewportsFirst
Assesses whether the plotting system will plot the objects in paperspace first (if it returns false), or last (if it returns true). This is relative to the floating model space viewports.