Autodesk.AutoCAD.DatabaseServices.MInsertBlock.#ctor
Default constructor. Initializes the number of rows and columns to 0 and the row and column spacing to 0.0. In addition, the default constructor initialization for the BlockReference parent class takes place.