Autodesk.AutoCAD.Geometry.Scale2d.PreMultiplyBy(Autodesk.AutoCAD.Geometry.Scale2d)
Sets this scale vector to the product of itself and the scale vector leftSide. Note that the multiplication of scale vectors is commutative.
leftSide:  Input scale vector

Autodesk.AutoCAD.Geometry.Scale2d.PostMultiplyBy(Autodesk.AutoCAD.Geometry.Scale2d)
Sets this scale vector to the product of itself and the scale vector rightSide. Note that the multiplication of scale vectors is commutative.
rightSide:  Input scale vector

Autodesk.AutoCAD.Geometry.Scale2d.IsProportional(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the matrix of scaling corresponding to this scale vector isUniScaledOrtho(). Returns false otherwise.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Scale2d.RemoveScale(Autodesk.AutoCAD.Geometry.Matrix2d)
For each index i is less than 2, this function sets the i-th scale factor of this scale vector to the length of the i-th column of the matrix mat considered as vector. If Determinant(mat) is not positive, then sx is negated. Then for each index i that is less than 2, the i-th column is divided by i-th scale factor.
mat:  Input matrix