Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.#ctor
Default constructor. Initializes the field length to 0, the flags to 0 (that is, non-constant, visible, not preset, and not verifiable), and the tag to 0. In addition, all the initializations for a default new DBText object take place.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Prompt
Accesses the prompt string for the AttributeDefinition. When the BockTableRecord containing the AttributeDefinition is inserted and an AttributeReference object is created using the AttributeDefinition as the template, the prompt string is displayed to ask the user to input a text string for the AttributeReference.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Invisible
Accesses the visibility flag of the AttributeDefinition. If invisible is true, then the AttributeDefinition object is set to be invisible.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Verifiable
Accesses the verifiable flag of the AttributeDefinition. If true, then the AttributeDefinition object is set to be verifiable.