Autodesk.AutoCAD.DatabaseServices.Circle
This .NET class wraps the AcDbCircle ObjectARX class. The Circle class represents the circle entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Circle.Radius
.