Autodesk.AutoCAD.DatabaseServices.LinkedTableData.AppendColumn(System.Int32)
Appends one or more columns. Returns the starting index of the appended columns.
columnsNumber:  Input number of columns to append

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.AppendRow(System.Int32)
Appends one or more rows. Returns the starting index of the appended row.
rowsNumber:  Input number of rows to append

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetDataLink(System.Int32,System.Int32)
Gets the id of the data link if the specified cell is linked to a data source using a data link. Returns null id if the cell is not linked using a data link.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetDataLink(Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Sets the specified data link in a cell range..
range:  Range of cells to link to external source.
dataLinkId:  Id of the data link to set
bUpdate:  Input true if the data link has is to be updated after setting it, false if not

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetDataLink(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Sets the specified data link in a cell..
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
dataLinkId:  Input id of the data link to set
bUpdate:  Input true if the data link is to be updated after setting it, false if not.