Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.Load(System.String)
Attempts to load the file returned by the UnderlayDefinition.ActiveFileName property. If password is null but is necessary to open the file, this function will prompt the user.
password:  Input optional password

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.Unload
Unloads the underlay file. References will behave as if the file was never loaded.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.SourceFileName
Returns a pointer to the internal data member that holds the name of the file that this underlay references. This name is in the form (relative or full path) that the user specified.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.ActiveFileName
Returns the name of the file that this  underlay references. This name is always a full path.