Autodesk.AutoCAD.GraphicsInterface.MaterialMap
This .NET class wraps the AcGiMaterialMap ObjectARX class. It defines material component maps. Maps are described by dimension, source, format, and mapping properties.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.Texture
Returns the address of the MaterialTexture object contained in this map. Returns null if no texture has been set.