Autodesk.AutoCAD.DatabaseServices.AssocEvaluationPriority
Negative numbers mean that an AssocAction cannot be evaluated at this time, positive numbers mean that the action can now be evaluated. Higher positive priority numbers mean that the action should be evaluated sooner, ahead of actions with lower positive priority. The negative numbers mean how much the action cannot be evaluated. The smaller the number, the less the action can be evaluated.