Autodesk.AutoCAD.Geometry.ClipBoundary2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs an ortho-aligned rectangular clip boundary. Two diagonally opposite corners define the rectangle.
firstCorner:  Input corner of a rectangle
secondCorner:  Input corner of a rectangle

Autodesk.AutoCAD.Geometry.ClipBoundary2d.#ctor
Null constructor. If this constructor is used, one of the set functions must be called before the object can be used for clipping.