Autodesk.AutoCAD.DatabaseServices.SymbolTable.Has(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function returns true if the table contains a record with an ObjectId that matches id. Otherwise it returns false.
id:  Input object ID of record to search for

Autodesk.AutoCAD.DatabaseServices.SymbolTable.Has(System.String)
This function returns true if the table contains a record with a name that matches key. If no matches are found, then false is returned.
key:  Input name of record to search for