Autodesk.AutoCAD.GraphicsSystem.Device.Invalidate
Flags the entire device area as invalid. This method is used to communicate the fact that the entire display area needs to be refreshed. Re-rasterization is not required unless the device does not have backing store.

Autodesk.AutoCAD.GraphicsSystem.Device.OnSize(System.Drawing.Size)
This function should be called whenever the size of the device changes. Pass in the width and height of the device in pixels. Only positive values should be specified. If your device has a width or height of 0, do not call this API.
size:  Input width and height of device in pixels.

Autodesk.AutoCAD.GraphicsSystem.Device.Add(Autodesk.AutoCAD.GraphicsSystem.View)
Adds a view to be displayed on the device. Returns true if the view was successfully added to the device.
view:  Input view to be displayed on the device.

Autodesk.AutoCAD.GraphicsSystem.Device.Erase(Autodesk.AutoCAD.GraphicsSystem.View)
Removes the view pointed to by view from the device. Returns true if the view was successfully removed from the device.
view:  Input view to be removed from the device.

Autodesk.AutoCAD.GraphicsSystem.Device.SetLogicalPalette(System.Drawing.Color[])
Used to communicate the logical palette used by the client when it makes use of SubEntityTraits.SetColor() method (for example, when the client specifies color with a palette index). AutoCAD sets the logical palette to the ACI color index values. The logical palette may very well not be the physical palette (if any) in use by the underlying hardware.
palette:  Input array of logical palette colors.

Autodesk.AutoCAD.GraphicsSystem.Device.SetPhysicalPalette(System.Drawing.Color[])
Specifies a physical palette. It should be used in conjunction with off-screen devices.
palette:  Input array that constitutes the palette.

Autodesk.AutoCAD.GraphicsSystem.Device.IsValid
Returns true when the device has the correct picture (no invalid flags or regions, no rasterization left to perform, and the rendering pipeline has been fully flushed of any queued drawing commands). Otherwise, returns false.