Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup
The Assoc2dConstraintGroup class represents a set of geometric constraint relations between subentities of geometric entities. All the geometries must lie in a single plane.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.TransformActionBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Transforms the work plane of the constraint group by the rigid motion component of the transformation matrix. If the transformation matrix also contains a uniform scaling factor, it removes all ExplicitConstraint nodes. If the transformation matrix contains a general component, it removes all GeometricalConstraint nodes.
transform:  The given transformation matrix.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GeometryStatus(Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry)
Gets the evaluation status of the passed in constrained geometry. Normally this method should only be called after an evaluation.
consGeom:  Input reference to ConstrainedGeometry indicating the constrained geometry object to be checked.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.AddConstrainedGeometry(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Creates and adds a new ConstrainedGeometry object into this constraint group. The caller should not cache the reference returned for future use; instead the caller may cache the node id of ConstrainedGeometry.
subentPath:  Input FullSubentPath of the constrained entity, down to the subentity level. Only SubentityType.Edge and SubentityType.Vertex are valid subent types. The vertex subent must NOT be edge vertex.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.DeleteConstrainedGeometry(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Deletes an existing ConstrainedGeometry object which is internally held. This function also removes and erases the AssocGeomDependency object from this constraint group action.
geomDependencyId:  Input ObjectId of the AssocGeomDependency object.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GetConstrainedGeometry(Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency)
Gets the reference to the corresponding internally held ConstrainedGeometry. The reference returned might be temporary and the caller should not cache it for future use; instead the caller may cache the node id of ConstrainedGeometry.
geomDependency:  Input reference to AssocGeomDependency of the constrained entity. The AssocGeomDependency object maybe transient, in other words, not added into the database yet.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.RegenDimensionSystem
Regenerates the internal dimension system. For internal use only.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GeometryMirrored(Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency)
Called by the client code to inform the constraint group that the dependent entity for geomDependency has been mirrored. The constraint group then mirrors the implicit points for the constrained curve for the given geom dependency. For the majority of constrained curves it is just a no-op, but for some curves (such as for ConstrainedArc) the implicit points needs to be actually updated.
geomDependency:  Reference to AssocGeomDependency for which implicit point needs to be updated for mirror action.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.AddGlobalCallback(Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintCallback)
See the explanation of Assoc2dConstraintCallback. Multiple global callbacks can be registered and they apply to all Assoc2dConstraintGroup.
callback:  The callback to be registered.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.RemoveGlobalCallback(Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintCallback)
See the explanation for Assoc2dConstraintCallback. Multiple global callbacks can be registered and they apply to all Assoc2dConstraintGroup.
callback:  The callback to be unregistered.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GlobalCallback
Returns a callback that is the collection of all callbacks registered by the client code. This function is meant mostly for private use and there should not be much need for the client code to use it. In any case, the client code must never delete or unregister the returned callback, or do anything with it except for calling its methods.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GetDOF
Gets the remaining DOF (Degree of Freedom) of this constraint group. It includes the positional DOF of a well-defined model.