Autodesk.AutoCAD.LayerManager.LayerFilter.ShowEditor
Called by the host application to show an editor window for the filter. The editor is displayed as a child of the active popup window.

Autodesk.AutoCAD.LayerManager.LayerFilter.GetFilterExpressionTree
Returns a read-only expression tree that represents this filter. May return null if the filter cannot be described this way.

Autodesk.AutoCAD.LayerManager.LayerFilter.GenerateNested
Called by the ObjectDBX framework after a filter is loaded from persistent storage. This is an opportunity for the filter to generate nested filters.

Autodesk.AutoCAD.LayerManager.LayerFilter.Name
Returns the name of the filter. This usually what is entered by the user when filter is created. However, for some filters such as the Xref or All filter, this is a localized constant.

Autodesk.AutoCAD.LayerManager.LayerFilter.Parent
Returns the parent filter for this filter. All filters except the top level ("All") filter have a parent. The top level filter Returns null.

Autodesk.AutoCAD.LayerManager.LayerFilter.NestedFilters
Returns an array containing the nested filters of this filter. The returned array is const; clients should not remove or add filters to this array.

Autodesk.AutoCAD.LayerManager.LayerFilter.IsIdFilter
Returns true if this filter only filters for the object ID property of a layer. These filters are also known as layer groups.

Autodesk.AutoCAD.LayerManager.LayerFilter.FilterExpression
Returns a filter expression of this form:.