Autodesk.AutoCAD.Geometry.EllipticalArc3d
This .NET class wraps the AcGeEllipArc3d ObjectARX class. It represents both full ellipses and elliptical arcs in 3D space.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.#ctor
Default constructor. Constructs full ellipse centered at origin (0,0,0) with X and Y axis for major and minor axes respectively. Major and minor radius are both 1, so constructed ellipse is just the unit circle in the XY plane centered at the origin.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IsInside(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines whether the input point lies inside the ellipse. This function treats the ellipse as a full ellipse even if it is bounded. It determines if the input point lies inside the full ellipse.
pointValue:  Input any 3D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.EllipticalArc3d.Normal
Returns the normal vector of the ellipse. The ellipse is oriented counterclockwise around this vector. This function always returns a unit vector.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.MinorAxis
Returns the minor axis vector of the ellipse. This function always returns a unit vector.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.MajorAxis
Returns the major axis vector of the ellipse. This function always returns a unit vector.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.MinorRadius
Returns the minor radius of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.MajorRadius
Returns the major radius of the ellipse.