Autodesk.AutoCAD.DatabaseServices.SymbolTableEnumerator
This .NET class wraps the AcDbSymbolTableIterator ObjectARX class. This class is a base class for iterator classes that are used for iterating over the records in the SymbolTable objects.