Autodesk.AutoCAD.DatabaseServices.MeshFaceterData.FaceterDevSurface
Accesses the devSurface setting. This value is used (when subdividing the edges and also when placing the grid lines across the face) to control the deviation of the mesh from the FACE.

Autodesk.AutoCAD.DatabaseServices.MeshFaceterData.FaceterDevNormal
Accesses the faceter devNormal setting. This value is used (when subdividing the edges and also when placing the grid lines across the face) to control the angle between facets in the mesh.

Autodesk.AutoCAD.DatabaseServices.MeshFaceterData.FaceterMeshType
Accesses the value for the faceter mesh type:.