Autodesk.AutoCAD.Geometry.Scale3d.PreMultiplyBy(Autodesk.AutoCAD.Geometry.Scale3d)
Sets this scale vector to the product of itself and the scale vector leftSide. Note that the multiplication of scale vectors is commutative.
leftSide:  Input scale vector

Autodesk.AutoCAD.Geometry.Scale3d.PostMultiplyBy(Autodesk.AutoCAD.Geometry.Scale3d)
Sets this scale vector to the product of itself and the scale vector rightSide. Note that the multiplication of scale vectors is commutative.
rightSide:  Input scale vector

Autodesk.AutoCAD.Geometry.Scale3d.IsProportional(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the matrix of scaling corresponding to this scale vector isUniScaledOrtho(). Returns false otherwise.

Autodesk.AutoCAD.Geometry.Scale3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Scale3d)
This method calls Scale3d.IsEqualTo(Scale3d a, Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Scale3d.RemoveScale(Autodesk.AutoCAD.Geometry.Matrix3d)
For each index i is less than 2, this function sets the i-th scale factor of this scale vector to the length of the i-th column of the matrix mat considered as vector. If det(mat) is not positive, then sx is negated. Then for each index i that is less than 2, the i-th column is divided by i-th scale factor.
mat:  Input matrix