Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.Add(System.String)
This function will add the input layer to the set of layers within the filter object that define those entities that pass the filter test. Once layer is added, all entities on layer will be accepted.
layer:  Input layer name to add

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.Remove(System.String)
This function will remove the input layer from the filter. This will mean entities NOT on this layer are considered NOT to pass the filtered test.
layer:  Input layer name to remove