Autodesk.AutoCAD.DatabaseServices.UnitsConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)
This method is used to convert a string to a Units value. It attempts to interpret value as a System.String object. If successful, it attempts to find a matching string in the Unit enum. If a match is found, this method returns the matching Unit value. If no match is found, this method throws a FormatException exception. If value cannot be cast to a System.String object, this method calls the superclass version of this method.
context:  Input context to convert within
culture:  Input culture to convert within
value:  Input object to convert from