Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.Add(Autodesk.AutoCAD.DatabaseServices.DBObjectReference)
Adds the object represented by value to this collection. Returns the zero-based index of the newly added collection item.
value:  Input object to add