Autodesk.AutoCAD.DatabaseServices.Line.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
This constructor initializes the line object to use pointer1 as the start point, and pointer2 as the endpoint. Both points must be in WCS coordinates.
pointer1:  Input line start point (WCS coordinates)
pointer2:  Input line end point (WCS coordinates)

Autodesk.AutoCAD.DatabaseServices.Line.#ctor
Default constructor. Initializes the normal vector to (0,0,1), the start and end points to (0,0,0), and the thickness to 0.0. All coordinates are WCS.

Autodesk.AutoCAD.DatabaseServices.Line.Thickness
Accesses the line's thickness value. The thickness is the line's dimension along its normal vector direction (sometimes called the extrusion direction).