Autodesk.AutoCAD.GraphicsSystem.Configuration.GetHardwareAcceleratedDrivers
Returns the name and path of the current hardware accelerated driver. It also returns the hardware acceleration mode of the Graphics System as true. If the Graphics System is not currently set to hardware accelerated, the driver name and path are not updated.

Autodesk.AutoCAD.GraphicsSystem.Configuration.CurrentDisplayDriver
Queries the configuration settings for the current display driver. It reports the path name of the current display driver, the name of the current display driver, and whether the driver is capable of hardware acceleration.

Autodesk.AutoCAD.GraphicsSystem.Configuration.SurfaceTessellationTolerance
Retrieves the amount of detail (tessellation lines or triangles) displayed for surfaces.The return value is an integer between 0 and 100. The lower the integer value, the less detail.