Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetUcs(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function sets the UCS for the view or viewport table record. The new UCS will be named and UcsId must reference a valid UcsTableRecord object.
id:  Input the object which references a UcsTableRecord.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetUcs(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
This function sets the UCS for the view or viewport table record. The new UCS will be unnamed and is defined by origin, x, and y.
origin:  Input the object to act as an origin
y:  Input the object to act as a Y-coordinate

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Background
Accesses the background associated with this view. To unset one, set it to NULL.