Autodesk.AutoCAD.DatabaseServices.Face.#ctor
Default constructor. Initializes the visibility flag to 0 (that is, all edges are visible). In addition, standard Entity initialization occurs. The corner points are not explicitly initialized, so any initialization that may occur for them is compiler dependent.