Autodesk.AutoCAD.DatabaseServices.DgnDefinition.UseMasterUnits
Assesses whether the underlay uses master units in the DGN file when the DGN file is being translated to DWG for the underlay to use. If master units are not used, then subunits are used.

Autodesk.AutoCAD.DatabaseServices.DgnDefinition.XrefDepth
Accesses the xref depth value (if any) that the underlay uses. This depth value is used if the DWG file is exported as DGN. For DWG to DGN translation, DGN underlays become DGN xrefs and will be given this depth value.