Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,System.Boolean,Autodesk.AutoCAD.Geometry.KnotParameterizationEnum,System.Int32,System.Double)
Creates a spline that attempts to fit a curve to the array of points within the tolerance fitTolerance..
fitPoints:  Array of points (in WCS coordinates) through which to fit the curve.
isPeriodic:  Indicate whether or not a periodic spline fitting the array of points is created.
knotParam:  Knot parameterization defining the knot values .
degree:  Degree of the spline to be created (in the range 1 to 11)
fitTolerance:  Tolerance to which the spline should approximate fitPoints.

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Int32,System.Double)
Creates a spline that attempts to fit an order degree curve to the array of points within the tolerance fitTolerance. A fitTolerance of 0 will cause the curve to be interpolated precisely through all the points in the points array. The curve order may be in the range 2 to 26.
point:  Array of points (in WCS coordinates) through which to fit the curve
startTangent:  Specifies the tangent at the start of the curve
endTangent:  Specifies the tangent at the end of the curve
order:  Order of the spline to be created (in the range 2 to 26)
fitTolerance:  Tolerance to which the spline should approximate fitPoints

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,System.Int32,System.Double)
Creates a spline that attempts to fit an order degree curve to the array of points within the tolerance fitTolerance. A fitTolerance of 0 causes the curve to be interpolated precisely through all the points in the points array. The curve order may be in the range 2 to 26.
point:  Array of points (in WCS coordinates) through which to fit the curve
order:  Order of the spline to be created (in the range 2 to 26)
fitTolerance:  Tolerance to which the spline should approximate fitPoints

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor
Default constructor. Initializes to line segment between (0,0,0) and (1,0,0).

Autodesk.AutoCAD.DatabaseServices.Spline.ElevateDegree(System.Int32)
Increases the degree (which is the same as the order -1) of the spline to newDegree. Once incremented it cannot be decremented. The valid range is between (current degree) and 25.
newDegree:  Input new spline degree value (in the range (existing degree) to 25)

Autodesk.AutoCAD.DatabaseServices.Spline.GetControlPointAt(System.Int32)
Returns the value of the control point at position index in the list of control points. If index is negative or more than the number of control points in the spline, then point at index is set to the last control point.
index:  Input index (0 based) of point to get

Autodesk.AutoCAD.DatabaseServices.Spline.InsertFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Adds point to the list of fit points and refits the spline. point is added at the index position in the fit points list. If index is negative, then point is added at the beginning of the spline. If index is greater than the number of fit points in the spline, then point is added at the end of the spline.
index:  Input index (0 based) where new fit point is to be inserted
point:  Input new fit point (in WCS coordinates)

Autodesk.AutoCAD.DatabaseServices.Spline.RemoveFitPointAt(System.Int32)
Removes the fit point at index in the list of fit points of the spline and refits the spline. There must be at least three fit points in the spline for this function to succeed.
index:  Index (0 based) of fit point to be removed

Autodesk.AutoCAD.DatabaseServices.Spline.PurgeFitData
Purges the fit data if the spline is a fitted spline. Once the fit data has been removed, the spline uses its control point or NURBS data.

Autodesk.AutoCAD.DatabaseServices.Spline.UpdateFitData
Updates the fit data of the spline. If the spline's fit tolerance == 0, then the spline is refitted; otherwise the fit data is purged (in which case the control point or NURBS data will be used by the spline).

Autodesk.AutoCAD.DatabaseServices.Spline.SetWeightAt(System.Int32,System.Double)
Changes the weight of the point at the index location in the control points array to weight. If the spline is not a rational spline, then it is converted to a rational spline.
index:  Input index (0 based) of control point at which to change the weight
weight:  Input new weight value

Autodesk.AutoCAD.DatabaseServices.Spline.InsertKnot(System.Double)
Inserts a new knot into the spline at the location on the spline defined by value. The value must be within the spline's parameter range.
value:  Input parameter where knot is to be added

Autodesk.AutoCAD.DatabaseServices.Spline.ToPolyline(System.UInt32,System.Boolean,System.Boolean)
This .NET method wraps the ObjectARX method..

Autodesk.AutoCAD.DatabaseServices.Spline.ToPolylineWithPrecision(System.Int32,System.Boolean,System.Boolean)
This .NET method wraps the ObjectARX method..

Autodesk.AutoCAD.DatabaseServices.Spline.ModifyPositionAndTangent(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Adjusts the location and tangent of a point on the spline curve with the given parameter. The local control points are adjusted accordingly. If deriv is null, only the location of the point is adjusted.
param:  Parameter
point:  Specify the new location of the point on the spline curve
deriv:  Specify the tangent vector

Autodesk.AutoCAD.DatabaseServices.Spline.Degree
Returns the degree of the spline's  polynomial representation. The value is in the range 1 to 25.

Autodesk.AutoCAD.DatabaseServices.Spline.FitTolerance
Returns the tolerance value used for curve fitting. This is the maximum distance (in drawing units) that the spline curve is allowed to deviate from the fit points.