Autodesk.AutoCAD.GraphicsInterface.SkyBackgroundTraits
This .NET class wraps the AcGiSkyBackgroundTraits ObjectARX class. This class enables sky background definitions to be elaborated to graphics interface implementations.