Autodesk.AutoCAD.DatabaseServices.GradientBackground
This .NET class wraps the AcDbGradientBackground ObjectARX class. This class represents a gradient background.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.Height
Accesses the height value representing a percentage of the second color in a three-color gradient. The start point of the second color is determined by the Horizon setting. If the value is 0, the result is a two-color gradient that uses the Top and Bottom colors.