Autodesk.AutoCAD.Geometry.ExternalCurve2d.#ctor
Default constructor. Creates an empty instance.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.SetToOwnCurve
Forces this instance to own its definition data. If the current instance is the owner, then this is non-operational. Otherwise, this method makes a copy of the curve definition data such that it owns that geometry.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.IsNurbCurve
Determines whether the external curve instance can be represented by a curve definition that is native to gelib. Returns true if the external curve does have an exact gelib native representation, otherwise it returns false.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.IsDefined
Determines whether the instance is empty. Returns true if the instance does have a curve definition, otherwise returns false, implying an empty instance.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.ExternalCurve
Provides access to the external entity in its native form. A caller having access to the precise definition of the external entity can use that knowledge to gain efficient access to the entity in its native form.