Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition
This class encapsulates the data required to define a spatial filter. Properties of this class correlate to the arguments used by the SpatialFilter.setDefinition and AcDbSpatialFilter.getDefinition ObjectARX functions.