Autodesk.AutoCAD.Geometry.Vector3d
This .NET class wraps the AcGeVector3d ObjectARX class. Vector3d represents a vector in 3D space. It can be viewed as a structure consisting of 3 doubles.

Autodesk.AutoCAD.Geometry.Vector3d.#ctor(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Vector2d)
Constructs a 3D vector by the formula.
plane:  Input plane
vector2d:  Input vector

Autodesk.AutoCAD.Geometry.Vector3d.RotateBy(System.Double,Autodesk.AutoCAD.Geometry.Vector3d)
Returns 3D point which is the result of rotation of this vector around the line with axis passing through the origin. Rotation angle is given by the argument angle, where positive direction of rotation is defined by the right-hand rule.
angle:  Input angle of rotation
axis:  Input axis of rotation

Autodesk.AutoCAD.Geometry.Vector3d.GetNormal(Autodesk.AutoCAD.Geometry.Tolerance)
Returns the unit vector codirectional to this vector. The vector is not normalized if its length is less than tolerance.equalVector(), in which case the returned vector is the same as this vector.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector3d.IsUnitLength(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this vector is equal to its normalization. Returns false otherwise.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector3d.IsZeroLength(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this vector is equal to zero vector. Returns false otherwise.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector3d.IsParallelTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is parallel to the vector vector. Namely, it checks if after normalization (and negation in case of negative dot product with the vector vector) this vector is within the distance tolerance.equalVector() from the normalization of the vector vector.
vector:  Input any 3D vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector3d.IsCodirectionalTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
This function checks if this vector is codirectional to the vector. Namely, it checks if after normalization this vector is within the distance tolerance.equalVector() from the normalization of the vector.
vector:  Input any 3D vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector3d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is perpendicular to the vector vector. Namely, it checks if after normalization the dot product of this vector with the normalization of the vector vector is less than tolerance.equalVector() in absolute value.
vector:  Input any 3D vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector3d.ProjectTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Returns the 3D vector that is the result of the parallel projection of this vector into the plane with normal planeNormal passing through the origin. The direction of projection is defined by vector projectDirection.
planeNormal:  Input plane normal
projectDirection:  Input direction of projection

Autodesk.AutoCAD.Geometry.Vector3d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Vector3d)
Returns the vector equal to the product of matrix a and vector b. The order of multiplication is matrix * vector, where vectors are considered as columns.
a:  Input matrix
b:  Input vector