Autodesk.AutoCAD.GraphicsInterface.PointLightTraits
This .NET class wraps the AcGiPointLightTraits ObjectARX class. This class represents a point light source, whose light is emitted in all directions.