Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency
This class represents a dependency on a subentity (face/edge/vertex) of a geometric entity. It keeps an AssocPersSubentId that persistently identitfies the subentity and provides new protocol to set the referenced subentity and get/set the subentity geometry.

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.DependentOnObjectMirrored
Called by the client code to inform the AssocGeomDependency that the object, whose subentity it depends on, has been mirrored. The dependency then mirrors the AssocPersSubentityId it holds. For the majority of dependent-on entity types it is a no-op, but for some entity types (such as for Arc) the AssocPersSubentityId actually needs to be updated.

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.TransientSubentCount
Gets the number of transient SubentityIds corresponding to the internally held AssocPersSubentityId. In typical cases, it is just a single subentity, but generally it may be none, one or any number of subentities.