Autodesk.AutoCAD.DatabaseServices.DimensionStyleOverrule
This .NET class wraps ObjectARX class AcDbDimensionStyleOverrule. it overrules a subset of dimension style related operations that Dimension (AcDbDimension) class specifies. It is intended as a base class for clients who want to alter some or all behavior of a given AcDbDimension-derived class. At the base level, each default implementation simply calls the corresponding method in the target class.

Autodesk.AutoCAD.DatabaseServices.DimensionStyleOverrule.SetXDataFilter(System.String)
Enables the use of xdata in determining whether overrules apply. Use this method when you want AutoCAD to look for xdata with registeredApplicationName on the overruled subject before calling any of your overrules.
registeredApplicationName:  Name of the registered application.