Autodesk.AutoCAD.DatabaseServices.DistanceConstraint
This class represents a distance constraint node in the owning Assoc2dConstraintGroup. It can be applied between two constrained geometries (normally two points).

Autodesk.AutoCAD.DatabaseServices.DistanceConstraint.#ctor(Autodesk.AutoCAD.Geometry.Vector3d)
Constructor. The direction type is set to FixedDirection.
direction:  Input AcGeVector3d indicating the fixed direction which is used to measure the distance. The vector length must not be zero.

Autodesk.AutoCAD.DatabaseServices.DistanceConstraint.#ctor
Default constructor. The direction type is set to NotDirected.

Autodesk.AutoCAD.DatabaseServices.DistanceConstraint.Direction
Gets the fixed direction of this distance constraint. Only valid when the direction type is FixedDirection.

Autodesk.AutoCAD.DatabaseServices.DistanceConstraint.ConstrainedLineId
Gets the constrained line id. Only valid when the direction type is PerpendicularToLine or ParallelToLine.