Autodesk.AutoCAD.DatabaseServices.TransactionManager.AddNewlyCreatedDBObject(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean)
This method wraps the AcDbTransactionManager::addNewlyCreatedDBRObject ObjectARX function..
obj:  Input object to be added or removed
add:  Input Boolean indicating whether to add or remove the object

Autodesk.AutoCAD.DatabaseServices.TransactionManager.TopTransaction
Accesses the the Transaction object that is at the top of the transaction stack (that is, the most recently created Transaction object). This can be compared to a cached Transaction to determine if the cached object is the top (that is, "current") transaction, or it can be used to access the two member functions of that transaction object. However, because there are member functions in the TransactionManager class that provide direct access to the two member functions in the top transaction, there's no need to use TopTransaction for this purpose.