Autodesk.AutoCAD.Geometry.SplineEntity2d
This .NET class wraps the AcGeSplineEnt2d ObjectARX class. It represents different spline entities in 2D space.

Autodesk.AutoCAD.Geometry.SplineEntity2d.GetContinuityAtKnot(System.Int32)
Returns the degree of the highest derivative that is continuous at a knot. For example, if the spline does not have its first derivative at the knot indexed by index, then the value 0 is returned.
index:  Input knot index

Autodesk.AutoCAD.Geometry.SplineEntity2d.GetContinuityAtKnot(System.Int32,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the degree of the highest derivative that is continuous at a knot. For example, if the spline does not have its first derivative at the knot indexed by index, then the value 0 is returned.
index:  Input knot index
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.SplineEntity2d.IsRational
Returns a flag indicating if the spline is a polynomial or rational. This function makes sense only for an NurbCurve2d object derived from the SplineEnt2d class.

Autodesk.AutoCAD.Geometry.SplineEntity2d.Order
Returns spline's order. The curve is defined on the interval between knot values indexed by order - 1 and numberOfKnots - order. In the case of a B-spline, the order is greater than spline degree by 1. In the case of a polyline, the order is equal to 1.

Autodesk.AutoCAD.Geometry.SplineEntity2d.Knots
Return the spline's knot vector. The intervals between two consecutive knots partition the spline into polynomial or rational pieces.

Autodesk.AutoCAD.Geometry.SplineEntity2d.HasFitData
Returns true if the spline is constructed by using any interpolating fit data. Returns false otherwise.