Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.ToString
Returns an equivalent string representation of this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
provider:  Culture-specific format