Autodesk.AutoCAD.DatabaseServices.SectionGeometry
This .NET enum wraps the AcDbSectionSettings::Geometry ObjectARX enum. It gives options for section generation. This enum is used to get and set properties for generated section geometry.