Autodesk.AutoCAD.DatabaseServices.ConstrainedEllipse.MajorRadius
Gets the major radius of the constrained ellipse. The major radius may be smaller than minor radius, this is different from EllipArc3d.