Autodesk.AutoCAD.DatabaseServices.Solid.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
This constructor uses pointer1-pointer3 as the first three points for the solid and then uses pointer2 as the fourth point as well. All points must be in WCS coordinates. The normal vector is initialized to (0,0,1) and the thickness is set to 0.0.
pointer1:  Input first point (in WCS) for solid
pointer2:  Input second point (in WCS) for solid
pointer3:  Input third point (in WCS) for solid

Autodesk.AutoCAD.DatabaseServices.Solid.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
This constructor uses pointer1-pointer4 as the four points for the solid. All points must be in WCS coordinates. The normal vector is initialized to (0,0,1) and the thickness is set to 0.0.
pointer1:  Input first point (in WCS) for solid
pointer2:  Input second point (in WCS) for solid
pointer3:  Input third point (in WCS) for solid
pointer4:  Input fourth point (in WCS) for solid

Autodesk.AutoCAD.DatabaseServices.Solid.GetPointAt(System.Int16)
This function fills the output value of the desired point with the value of the point in the solid whose index is index. index can have a value of 0, 1, 2, or 3, depending on which point is desired (that is, 0 for the first point, 1 for the second point, etc.). If there are only three corners on the solid, then the points with indices 2 and 3 will have the same value. The returned point will be in WCS coordinates.
index:  Input index (1-4) of the desired point in the solid

Autodesk.AutoCAD.DatabaseServices.Solid.SetPointAt(System.Int16,Autodesk.AutoCAD.Geometry.Point3d)
This function sets the index'th point in the solid to the pointValue. index must be 0, 1, 2, or 3. pt must be in WCS coordinates.
index:  Input index (1-4) of the point to set in the solid
pointValue:  Input point value

Autodesk.AutoCAD.DatabaseServices.Solid.Thickness
Returns the thickness of the solid. The thickness is the shape's dimension along its normal vector direction (sometimes called the extrusion direction).