Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord
This .NET class wraps the AcDbSymbolTableRecord ObjectARX class. This is the base class for each type of record corresponding to the various symbol tables.

Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord.IsResolved
Returns true if the SymbolTableRecord is part of an xref which has been successfully "resolved" (loaded into the drawing). If the record is not part of an xref, or it is part of an xref but the xref has not been successfully resolved, then false is returned. The SymbolTableRecord.IsDependent property can be used to determine if the record is part of an xref.