Autodesk.AutoCAD.Geometry.Curve2d
This .NET class wraps the AcGeCurve2d ObjectARX class. It's an abstract base class for all 2D curves. Any class that is derived from this class represents a 2D curve.

Autodesk.AutoCAD.Geometry.Curve2d.GetInterval
Returns the parametric range of the curve. The function evalPoint(double) always returns a point on this curve when called with a value within the returned interval.

Autodesk.AutoCAD.Geometry.Curve2d.GetReverseParameterCurve
Reverses the parametric direction of the curve. The point set of the curve is unchanged, but the direction of the curve is reversed.

Autodesk.AutoCAD.Geometry.Curve2d.GetParameterOf(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the parameter value of point. This function assumes that point lies on the curve and does not verify this. If point does not lie on the curve, this function returns unpredictable results.
point:  Input point on the curve
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.IsPeriodic(System.Double&)
Determines if the curve is periodic. The curve is periodic if and only if it is closed and the two points EvaluatePoint(t) and EvaluatePoint(t+period) are always the same point for all values of t.
period:  Input period of curve parameter

Autodesk.AutoCAD.Geometry.Curve2d.IsLinear(Autodesk.AutoCAD.Geometry.Line2d&)
Determines if curve is linear. The line parameter contains meaningful data only if this function returns true.
line:  Output line on which this curve lies if it is linear

Autodesk.AutoCAD.Geometry.Curve2d.IsLinear(Autodesk.AutoCAD.Geometry.Line2d&,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if curve is linear. The line parameter contains meaningful data only if this function returns true.
line:  Output line on which this curve lies if it is linear
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.GetParameterAtLength(System.Double,System.Double,System.Boolean,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the parameter value of the point whose arc length distance (from the point with parameter value datumParameter) is the input length. In other words, if.
datumParameter:  Input parameter value
length:  Input arc length
parameterDirection:  Input parameter direction
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.GetArea(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the area of the interval of the curve defined by startParameter and endParameter. Returns True if area was successfully computed to within the specified tolerance.
startParameter:  Input parameter value of interval start
endParameter:  Input parameter value of interval end (must be larger than startParameter)
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.GetBoundBlockOf(Autodesk.AutoCAD.Geometry.Interval)
Returns the bounding box of the specified sub-interval of the curve. The sides of the returned box are parallel to the coordinate axes.
range:  Input sub-interval of curve

Autodesk.AutoCAD.Geometry.Curve2d.GetOrthoBoundBlockOf(Autodesk.AutoCAD.Geometry.Interval)
Returns the bounding box of the specified sub-interval of the curve. The sides of the returned box are parallel to the coordinate axes.
range:  Input sub-interval of curve

Autodesk.AutoCAD.Geometry.Curve2d.GetSamplePoints(System.Int32)
Returns the specified number of points on the curve. The points are equally spaced by parameter value. So if the interval of the curve [0,1] and numSample is 5, the parameter values of the returned points will be 0, 0.25, 0.5, 0.75, and 1.
numSample:  Input number of points that are to be returned

Autodesk.AutoCAD.Geometry.Curve2d.GetSamplePoints(System.Double,System.Double,System.Double)
Returns a list of points on the curve between fromParameter and toParameter. The line segment between any two consecutive points does not deviate by more than approxEps from the curve.
fromParameter:  Input starting parameter
toParameter:  Input ending parameter
approxEps:  Input chord-height tolerance

Autodesk.AutoCAD.Geometry.Curve2d.BoundBlock
Returns the bounding box of the curve. The sides of the returned box are parallel to the coordinate axes.

Autodesk.AutoCAD.Geometry.Curve2d.OrthoBoundBlock
Returns the bounding box of the curve. The sides of the returned box are parallel to the coordinate axes.

Autodesk.AutoCAD.Geometry.Curve2d.HasStartPoint
Returns true if curve has a start point. A false means that the parametric interval of the curve does not have a lower bound.