Autodesk.AutoCAD.DatabaseServices.XrecordEnumerator.RemoveCurrent
Allows callers to delete an item from the AcDbXrecord without having to get/set the whole chain. More efficient in terms of amount of data that needs to be copied and also does partial undo. After calling removeResbuf, AcDbXrecordIterator::getCurResbuf will return the first item after the deleted item. You must call AcDbXrecordIterator::done() to determine if the last item was removed.

Autodesk.AutoCAD.DatabaseServices.XrecordEnumerator.InsertAtCurrent(Autodesk.AutoCAD.DatabaseServices.ResultBuffer)
Allows callers to insert one or more resbufs into the AcDbXrecord without having to get/set the whole chain. More efficient in terms of amount of data that needs to be copied and also does partial undo. After calling insertRbChain, AcDbXrecordIterator::getCurResbuf will return the first item inserted.
data:  Input first result buffer (not its address) in a linked list of result buffer that contain the data for the xrecord.

Autodesk.AutoCAD.DatabaseServices.XrecordEnumerator.Current
Allows callers to modify the resbuf chain inside the AcDbXrecord without having to get/set the whole chain. More efficient in terms of amount of data that needs to be copied and also does partial undo. After calling modifyCurResbuf, AcDbXrecordIterator::getCurResbuf will return the new value.