Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection.Add(Autodesk.AutoCAD.DatabaseServices.MlineStyleElement,System.Boolean)
Adds a new element to the collection..
element:  Input element to add
checkIfReferenced:  Input Boolean indicating whether to check if the style is referenced