Autodesk.AutoCAD.DatabaseServices.CompoundObjectId
Class used to identify an Object in an Database when the object is references via a path of BlockReferences, and possibly by some other ways in the future. The object may reside in the host database (the same database as the CompoundObjectId belongs to) or it may reside in an XREF database or even in an unrelated database.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.Database)
Creates CompoundObjectId from an ordinary ObjectId and a path of BlockReferences. If the host database is null, the host database is obtained from the first id in the path. Even if it is in XREF database, the database hosting the XREF is obtained.
id:  ObjectId of the DBObject that this CompoundObjectId is going to reference.
path:  The path of BlockRefrences that lead to the referenced object. The first BlockReference in the path resides in the host database, the second BlockReference is from the BlockTableRecord that the first BlockReference references, the third BlockReference is from the BlockTableRecord that the second BlockReference references, etc.
pHostDatabase:  The host database. If null, the database is taken from the first BlockReference id in the path (even if it is in XREF database).

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.Database)
Creates CompoundObjectId from an ordinary ObjectId. If the host database is null, the host database is obtained from the given ObjectId. Even if it is in XREF database, the database hosting the XREF is obtained.
id:  ObjectId of the DBObject that this CompoundObjectId is going to reference.
hostDatabase:  The host database. If null, the database is taken from the ObjectId (even if it is in XREF database).

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Creates CompoundObjectId from an ordinary ObjectId. If the host database is null, the host database is obtained from the given ObjectId. Even if it is in XREF database, the database hosting the XREF is obtained.
id:  ObjectId of the DBObject that this CompoundObjectId is going to reference.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.Set(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.Database)
Sets this CompoundObjectId from an ordinary ObjectId and a path of BlockReferences. If the host database is null, the host database is obtained from the first id in the path. Even if it is in XREF database, the database hosting the XREF is obtained.
id:  ObjectId of the DBObject that this CompoundObjectId is going to reference.
path:  The path of BlockRefrences that lead to the referenced object. The first BlockRefrence in the path resides in the host database, the second BlockReference is from the BlockTableRecord that the first BlockReference references, the third BlockReference is from the BlockTableRecord that the second BlockReference references, etc.
hostDatabase:  The host database. If null, the database is taken from the first BlockReference id in the path (even if it is in XREF database).

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.Set(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.Database)
Sets this CompoundObjectId from an ordinary ObjectId. If the host database is null, the host database is obtained from the given ObjectId. Even if it is in XREF database, the database hosting the XREF is obtained.
id:  ObjectId of the Object that this CompoundObjectId is going to reference.
hostDatabase:  The host database. If null, the database is taken from the ObjectId (even if it is in XREF database).

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.Remap(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Remaps all the ObjectIds in this CompoundObjectId by the given IdMapping. Returns true if any remapping actually happened, false otherwise.
idMap:  See the description of the IdMapping class.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.Transform
Gets the compound transform from the leaf object to the world, concatenating all the BlockReference transforms, from the most nested one to the topmost one. This transformation represents mapping of the coordinates of the leaf-level object from its BlockTableRecord coordinate space to the world coordinate space.