Autodesk.AutoCAD.DatabaseServices.TableHitTestInfo
This class encapsulates the data returned in the output parameters of the Table.hitTest() ObjectARX function. It performs a hit test for the specified point and viewing direction.