Autodesk.AutoCAD.GraphicsInterface.SkyParameters
This .NET class wraps the AcGiSkyParameters ObjectARX class. This is a container class for all sky-related sun properties.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.#ctor
Default constructor. Initializes members to reasonable default values.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.VisibilityDistance
Returns the distance at which 10% haze occlusion results. Must be a non-negative value. The default value is 10000.0.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.SolarDiskSamples
Returns the number of samples to take on the solar disk. The valid range is between 0 and 1000. The default value is 8.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.GroundColor
Returns the color of the ground plane. Color supports all color models within AutoCAD, including color book colors.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.NightColor
Returns the color of the night sky. Color supports all color models within AutoCAD, including color book colors.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.RedBlueShift
Returns the red-blue shift on the sky. This provides control on the "redness" of the sky. The default of 0.0 is physically accurate. A minimum value of -1.0 will produce an extremely blue sky, whereas the maximum value of 1.0 will produce an extremely red sky.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.Saturation
The the sky's saturation level. The minimum value of 0.0 will produce an extreme of black and white whereas the maximum value of 2.0 will produce highly boosted saturation.