Autodesk.AutoCAD.DatabaseServices.Ole2Frame.#ctor
Default constructor. Objects constructed with this constructor must call OleObject to establish a valid OLE object to be used.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.LinkName
Read-only.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.OutputQuality
Accesses the current output quality assigned to this Ole2Frame object. Output quality affects the color depth and resolution at which the OLE object is plotted.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.Rotation
Accesses the rotation value, which users may change to any angle using the Properties window or the ROTATE command. The angle is returned in degrees.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.ScaleWidth
Accesses the scale width, which represents the current object scale relative to the original scale from the default text size to the AutoCAD units scale. This is expressed as a percentage of the original scale.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.ScaleHeight
Accesses the scale height, which represents the current object scale relative to the original scale from the default text size to the AutoCAD units scale. This is expressed as a percentage of the original scale.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.LockAspect
Accesses the lock aspect ratio property, which affects the behavior of the OLE object when its size is changed. If the lock aspect ratio property is true, and a new value is entered for the object's width, height, scale width, or scale height, both the width and the height change uniformly.