Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId
Abstract base class used to persistently identify an SubentityId of an Entity. Unlike SubentityId that is transient and may change when the entity is modified, reevaluated, or similar, the AssocPersSubentityId identifies the subentity in such a way that it is always possible to obtain the corresponding subentities (if they still exist), even after the entity has been edited or reevaluated any number of times.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.GetTransientSubentIds(Autodesk.AutoCAD.DatabaseServices.Entity)
Mapping: AssocPersSubentityId --> SubentityId(s).
entity:  The entity needs to be open for read.
subents:  The returned SubentityIds.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.TransientSubentCount(Autodesk.AutoCAD.DatabaseServices.Entity)
Returns the number of transient SubentityIds corresponding to this AssocPersSubentityId. The default implementation just calls GetTransientSubentIds() and returns their count which usually is 1.
entity:  The entity needs to be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId)
Returns true if this and the other AssocPersSubentityId reference are exactly the same subentity of the same entity. The base class implementation just checks whether the classes of this and of the other AssocPersSubentityId are identical.
other:  The other AssocPersSubentityId.
ntity:  The entity owning the subentities of this and the other AssocPersSubentityId.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.DwgOutFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
The standard filing protocol. The AssocPersSubentityId base class implementation writes-out the actual class identification so that it is possible to create an object of the same class when the data is read back in (this happens in CreateObjectAndDwgInFields()).
filer:  The filer to write the object data to.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.DwgInFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
The standard filing protocol. The AssocPersSubentityId base class implementation does nothing and doesn't therefore need to be called from the derived classes.
filer:  The filer to read the object data from.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.DxfOutFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
The standard filing protocol. The AssocPersSubentityId base class implementation writes-out the actual class identification so that it is possible to create an object of the same class when the data is read back in (this happens in CreateObjectAndDxfInFields()).
filer:  The filer to write the object data to.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.DxfInFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
The standard filing protocol. The AssocPersSubentityId base class implementation does nothing and doesn't therefore need to be called from the derived classes.
filer:  The filer to read the object data from.