Autodesk.AutoCAD.Runtime.DisposableWrapper
This class implements the IDisposable interface and is the common base class for all ObjectARX managed wrapper classes. It provides the wrapper that creates a managed object from an unmanaged ObjectARX pointer. It also provides access to a wrapper object's underlying unmanaged pointer.

Autodesk.AutoCAD.Runtime.DisposableWrapper.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.