Autodesk.AutoCAD.DatabaseServices.SegmentType
This .NET class wraps the AcDbPolyline::SegType ObjectARX class. This enumeration identifies the different types of line segments that can make up a polyline.