Autodesk.AutoCAD.Geometry.EllipticalArc2d
This .NET class wraps the AcGeEllipArc2d ObjectARX class. It represents both full ellipses and elliptical arcs in 2D space.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.#ctor
Default constructor. Constructs full ellipse centered at origin (0,0) with X and Y axis for major and minor axes respectively. Major and minor radius are both 1, so constructed ellipse is just the unit circle centered at the origin.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IsInside(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines whether the input point lies inside the ellipse. This function treats the ellipse as a full ellipse even if it is bounded. This function also determines if the input point lies inside the full ellipse.
point:  Input any 2D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.EllipticalArc2d.MinorRadius
Returns the minor radius of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.MajorRadius
Returns the major radius of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.MinorAxis
Returns the minor axis vector of the ellipse. This function always returns a unit vector.