Autodesk.AutoCAD.Geometry.Plane
This .NET class wraps the AcGePlane ObjectARX class. Plane represents a parameterized infinite plane in 3D space.

Autodesk.AutoCAD.Geometry.Plane.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructor. Constructs the plane satisfying the equation.
a:  Input coordinate a
b:  Input coordinate b
c:  Input coordinate c
d:  Input coordinate d

Autodesk.AutoCAD.Geometry.Plane.#ctor(Autodesk.AutoCAD.Geometry.Plane)
Copy constructor. Constructs plane with the same origin, uAxis, and vAxis as the plane source.
source:  Another plane

Autodesk.AutoCAD.Geometry.Plane.#ctor
Constructor. Constructs the plane with the origin=(0, 0, 0), uAxis=(1, 0, 0), and vAxis=(0, 1, 0).

Autodesk.AutoCAD.Geometry.Plane.GetSignedDistanceTo(Autodesk.AutoCAD.Geometry.Point3d)
Returns the signed distance from the point pointValue to this plane. The sign of the result is the same as the sign of the dot product of the vector pointValue - originOfPlane and the normal to the plane.
pointValue:  Input point

Autodesk.AutoCAD.Geometry.Plane.IntersectWith(Autodesk.AutoCAD.Geometry.BoundedPlane,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this plane and the bounded plane boundPlane are non-parallel. Intersection is performed with tolerance tolerance. Returns false if there is no intersection.
boundPlane:  Input bounded plane
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Plane.IntersectWith(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this plane and the plane otherPlane are non-parallel. Intersection is performed with tolerance tolerance.
otherPlane:  Input other plane
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Plane.Set(System.Double,System.Double,System.Double,System.Double)
Sets this plane to the plane satisfying the equation.
a:  Input coordinate a
b:  Input coordinate b
c:  Input coordinate c
d:  Input coordinate d