Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase
AssocDimDependencyBodyBase ties together the following objects that define a dimensional constraint:

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.UpdateDependentOnObjectOverride
This method needs to be overriden and implemented by derived classes. It updates the controlled entity position, size and orientation. The base class implementation just handles reference dimensions that are not dimensional constraints. This method updates the corresponding AssocVariable with the current measured value of the dimension and updates the entity text with the current measurement.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.SetVariableNameAndExpression(System.String,System.String)
Sets new name and expression of the AssocVariable that corresponds to this dimensional constraint. Either name or expression may be empty strings which indicates no change.
name:  New name of the AssocVariable.
expression:  New expression of the AssocVariable.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.SetEntityNameAndExpression(System.String,System.String,System.String)
Sets name and expression that the managed entity should display. Either name or expression may be empty strings which indicates not to change them.
name:  New name the managed entity should display.
expression:  New expression the managed entity should display.
value:  New value the managed entity should display.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.SetNameAndExpression(System.String,System.String)
Sets name and expression on both the AssocVariable that corresponds to this dimensional constraint and on the managed entity that serves as the graphical representation of this dimensional constraint. Either name or expression may be empty strings which indicates no change.
name:  New name to be set.
expression:  New expression to be set.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.ValidateEntityText(System.String)
Checks if the given entityTextToValidate can be used as the text the managed entity displays. Either the name or the expression part of the entityTextToValidate text may be empty which means that the current name/expression should be used.
entityTextToValidate:  The entity text to check.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.ComposeEntityText(System.Int32)
Composes the text that the managed entity should display. The text is composed from the corresponding AssocVariable name, expression and/or value. The text formatting follows requiredNameFormat.
requiredNameFormat:  The constraint name format display, deafault value if -1. If requiredNameFormat == -1, CONSTRAINTNAMEFORMAT sysvar is used for choosing the text format.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.SetVariableValueToMeasuredValue
Measures the current dimensional constraint based on the current positions and sizes of the constrained geometries and sets the corresponding AssocVariable to this measured value. If the dimensional constraint is satisfied, the AssocVariable value will already be equal to the measured value and no setting is needed, and nothing happens. Notice that if AssocVariable contained an expression, it will be erased and the variable will just contain a numerical value, not an expression.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.ReactivateConstraint
Reactivates the constraint. Reactivating a constraint means creating a d_node or r_node for this ExplicitConstraint and adding it to the DCM dimension system.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetFromEntity(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the AssocDimDependencyBodyBase from the dependent-on Entity, such as from the AcDbDimension it controls. If the entity does not have an AssocDimDependencyBodyBase attached, ObjectId.Null is returned.
entityId:  The entity id of the dependent-on Entity, such as of an Dimension.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.EntityAttachmentPointMoved(Autodesk.AutoCAD.DatabaseServices.SubentityGeometry[],System.Double)
Updates the constraint geometry when dimension grip points are moved. Any move made through triangular grip should move the constraint geometry by the same amount and update the constraint variable value. Clients of this function need to pass new positions of the dimension attachment in SubentGeometry array, and new dimension measurement. This API performs the following operations:.
newAttachedGeometries:  The new attached geometries to be updated.
measurement:  New measurement, default value is 0.0.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetEraseDimensionIfDependencyIsErased
Under normal circumstances an associated Dimension object is erased if the AssocDimDependencyBodyBase is erased. This static method returns true iff this behavior is suppressed , i.e. not erasing the Dimension if the AssocDimDependencyBodyBase is erased.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.EntityTextOverride
Derived classes needs to override this pure virtual property. This is how they provide the text of the entity they manage.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetMeasuredValue
Gets the current dimensional constraint based on the current positions and sizes of the constrained geometries. If the dimensional constraint is satisfied, the AssocVariable value will already be equal to the measured value.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.IsReferenceOnly
Sets whether the constraint is reference only. A reference "constraint" keeps updating its AssocVariable and the dimension text with the measured value of the dimension, but it does not function as a dimensional constraint.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetCurrentlyUsedEntityNameFormat
Gets the format that is used to display the entity name and expression by looking at the currently displayed entity text. See CONSTRAINTNAMEFORMAT sysvar for the possible format values.