Autodesk.AutoCAD.DatabaseServices.MLeader.SetPlane(Autodesk.AutoCAD.Geometry.Plane)
Sets the plane that will contain the MLeader object. This leader's data members will be updated to reflect the change of plane. To do this, a transformation matrix will be created that will translate all points from the current plane's coordinate system to the new plane's coordinate system--a projection is not used.
value:  Input desired plane within which the MLeader will reside.

Autodesk.AutoCAD.DatabaseServices.MLeader.AddLeader
Adds a new leader cluster to this MLeader object. A leader cluster is made up by a dog-leg and some leader lines.

Autodesk.AutoCAD.DatabaseServices.MLeader.RemoveFirstVertex(System.Int32)
Removes the head of the leader line with specified index. The second vertex in this leader line becomes the new head.
leaderLineIndex:  Input leader line index.