Autodesk.AutoCAD.Colors.Color.#ctor
Default constructor. Initializes the color index to 0.

Autodesk.AutoCAD.Colors.Color.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.Colors.Color.ToString
Returns an equivalent string representation of this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.Colors.Color.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
provider:  Input for culture-specific format

Autodesk.AutoCAD.Colors.Color.DwgIn(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
This function does some internal bookkeeping, calls the object's DwgInFields() function, and then reads in any xdata attached to the object. If the object's DwgInFields() function does not supermessage its parent class, an assert is triggered.
inputFiler:  DWG filer to be used for this filing operation

Autodesk.AutoCAD.Colors.Color.DwgOut(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
This function does some internal bookkeeping, calls the object's function, and then writes out any xdata attached to the object. If the object's DwgOutFields() function does not supermessage its parent class, an assert is triggered.
outputFiler:  DWG filer to be used for this filing operation

Autodesk.AutoCAD.Colors.Color.Audit(Autodesk.AutoCAD.DatabaseServices.AuditInfo)
This function is called by AutoCAD when the AUDIT command is executed. The AuditInfo object pointed to by auditInfo contains member functions that are used to determine what to do and also to report the results of the audit operation on the object.
auditInfo:  Input an AuditInfo object

Autodesk.AutoCAD.Colors.Color.IsByLayer
Wrap the ObjectARX function AcCmColor.isByLayer(). Assesses if the color method is EntityColor.ByLayer, or if the color method is EntityColor.ByACI and the ACI is EntityColor.ACIbyLayer.