Autodesk.AutoCAD.DatabaseServices.ObjectIdGraph.DelNode(Autodesk.AutoCAD.DatabaseServices.ObjectIdGraphNode)
Removes the ObjectIdGraphNode nodeToDelete from the graph, and the AcDbObjectIdGraph wrapped by this ObjectIdGraph deletes the AcDbObjectIdGraphNode wrapped by nodeToDelete.