Autodesk.AutoCAD.GraphicsInterface.WorldGeometry.SetExtents(Autodesk.AutoCAD.DatabaseServices.Extents3d)
Sets the extents of the current entity to extents. extents points to an array of two points that represent the World Coordinate bounding box of the current object.
extents:  Input an array of two points.

Autodesk.AutoCAD.GraphicsInterface.WorldGeometry.StartAttributesSegment
If this drawable is a block and has Attributes, it must call this method exactly once before sending the attributes to Draw(). Once this function is called, the object may draw only attributes and no more primitives. The attributes must be the last objects rendered.