Autodesk.AutoCAD.DatabaseServices.Font
This structure represent the font information needed in the text editor. When the user sets the font, the editor needs to know if the font name is a SHX or a TrueType font.