Autodesk.AutoCAD.DatabaseServices.RasterImageDef.LocateActivePath
Returns the path name of the actual file being currently used to define the image. Requires that the RasterImageDef be open for reading.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Load
This function enables "lazy loading" of the image pixel data from the source image file (specified by RasterImageDef.SourceFileName) into an ATIL object. Requires that the RasterImageDef be open for writing. Triggers notification that causes all dependent RasterImage entities to be redrawn.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Unload(System.Boolean)
Immediately unloads the image data in RasImageDef from the Image Engine's working memory, but does not delete the RasImageDef itself. Triggers notification that causes all dependent RasterImage entities are redrawn as frames only. Requires that the RasterImageDef be open for writing..
modifyDatabase:  Input Boolean indicating whether or not to do undo recording

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.GetEntityCount(System.Boolean&)
Returns the number of RasterImage entities in the current drawing that are dependent upon this object for display graphics. If locked is non-zero, then this function will set the value to true if any dependent entities reside on locked layers.
locked:  Input locked value

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.UpdateEntities
Causes all the RasterImage entities in the current drawing that are dependent upon this object to be redrawn when this object is next closed. This function requires that the image definition be open for writing.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ImageCopy(System.Boolean)
Creates a copy of the image data, and returns a pointer to it..
forceImageLoad:  Input Boolean indicating whether to load the image if it is not currently loaded

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.OpenImage
Returns the associated image data object for writing. (See ATIL documentation for information about the Atil.Image class.) Each call to OpenImage must eventually be followed by a call to RasterImageDef.CloseImage().

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.SetImage(System.IntPtr,System.IntPtr,System.Boolean)
Directly specifies an in-memory Atil.Image or a custom Atil.FileReadDescriptor to be used. Either image or fileDescription can be null, but not both. Copies of the Atil.Image and Atil.FileReadDescriptor are retained by the RasterImageDef, so the caller's copy of these objects may be deleted at any time..
image:  Input NULL or pointer to valid Atil::Image object
fileDescription:  Input NULL or pointer to valid Atil::FileReadDescriptor object
modifyDatabase:  Input Boolean indicating whether to do undo recording

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.SourceFileName
Accesses the path name of the externally referenced image file name. This file name is saved in the DWG file with the object. Requires that the RasterImageDef be open for reading.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ActiveFileName
Accesses the path name of the actual file being currently used to define the image. Requires that the RasterImageDef be open for reading.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.SearchForActivePath
This searches the local drives and network for a valid image file that matches the source file name that is saved in the drawing file. This mechanism allows image files to be located differently on machines that are used for editing or viewing the same drawing file. Users can set up project search paths that contain directories in which image and xref files may be contained.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Organization
Accesses the pixel organization scheme of the source image file. Requires that the image be loaded to work properly. If the image is not loaded, the value RGBA is returned.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ColorDepth
Accesses the number of bits per pixel for the source image data. Possible values are 1, 8, 24, or 32.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ResolutionMMPerPixel
Accesses the default physical size of a single image pixel in millimeters. If the image has no default resolution, then this function returns pixel height and width values equal to 1/width of image in pixels.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ResolutionUnits
Accesses the units in which the image resolution was specified in the source image file. If the image file doesn't contain resolution information, then a value of None is returned.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.FileDescCopy
Accesses a copy to this object's Atil.FileReadDescriptor member. If this object does not have a valid Atil.FileReadDescriptor, null is returned.