Autodesk.AutoCAD.GraphicsInterface.VisualStyleTraits
This .NET class wraps the AcGiVisualStyleTraits ObjectARX class. This class defines the visual style traits. Derived from DrawableTraits, this class provides the interfaces to implement for setting and returning the visual style via drawable traits.