Autodesk.AutoCAD.ComponentModel.ITypeDescriptor
This interface is implemented by TypeDescriptor and provides facilities for adding/removing PropertyDescriptors and IPropertyProviders. There is a single instance for each type. To access it, try: