Autodesk.AutoCAD.DatabaseServices.Database.DwgFileOpened
Wraps AcRxEventReactor::dwgFileOpened. The event indicates that the drawing file is being read and stored in the drawing database.

Autodesk.AutoCAD.DatabaseServices.Database.InitialDwgFileOpenComplete
Wraps AcRxEventReactor::initialDwgFileOpenComplete. The event is sent at the completion of the initial load of a drawing database.

Autodesk.AutoCAD.DatabaseServices.Database.DatabaseConstructed
Wraps AcRxEventReactor::databaseConstructed. The event indicates that the Database constructor has finished.

Autodesk.AutoCAD.DatabaseServices.Database.DatabaseToBeDestroyed
Wraps AcRxEventReactor::databaseToBeDestroyed. The event indicates that the drawing database is about to be destroyed.

Autodesk.AutoCAD.DatabaseServices.Database.BeginSave
Wraps AcRxEventReactor::beginSave. The event indicates that the drawing database being operated on is about to be saved.

Autodesk.AutoCAD.DatabaseServices.Database.SaveComplete
Wraps AcRxEventReactor::saveComplete. The event indicates that the drawing database was saved to a file.

Autodesk.AutoCAD.DatabaseServices.Database.AbortSave
Wraps AcRxEventReactor::abortSave. The event indicates that the drawing database being operated on was not saved, and the save operation failed.

Autodesk.AutoCAD.DatabaseServices.Database.BeginDxfIn
Wraps AcRxEventReactor::beginDxfIn. The event indicates that the drawing database being operated on is about to be altered by a DXF input operation.

Autodesk.AutoCAD.DatabaseServices.Database.AbortDxfIn
Wraps AcRxEventReactor::abortDxfIn. The event indicates that the drawing database being operated on was modified by a DXF input operation, but that the operation was terminated before completion.

Autodesk.AutoCAD.DatabaseServices.Database.DxfInComplete
Wraps AcRxEventReactor::dxfInComplete. The event indicates that the drawing database was successfully modified by a DXF input operation.

Autodesk.AutoCAD.DatabaseServices.Database.BeginDxfOut
Wraps AcRxEventReactor::beginDxfOut. The event indicates that the drawing database being operated on is about to be output in a DXF output operation.

Autodesk.AutoCAD.DatabaseServices.Database.AbortDxfOut
Wraps AcRxEventReactor::abortDxfOut. The event indicates that the drawing database being operated on was modified by a DXF output operation, but that the operation was terminated before completion.

Autodesk.AutoCAD.DatabaseServices.Database.DxfOutComplete
Wraps AcRxEventReactor::dxfOutComplete. The event indicates that the output operation taking place on the drawing database was successful.

Autodesk.AutoCAD.DatabaseServices.Database.BeginInsert
Wraps AcRxEventReactor::beginInsert. The event indicates that the drawing database being operated on is being added to the drawing database.

Autodesk.AutoCAD.DatabaseServices.Database.InsertMappingAvailable
Wraps AcRxEventReactor::otherInsert. The event is sent right before beginDeepCloneTranslation is sent.

Autodesk.AutoCAD.DatabaseServices.Database.InsertAborted
Wraps AcRxEventReactor::abortInsert. The event indicates that an insert operation on the drawing database was terminated and did not complete.

Autodesk.AutoCAD.DatabaseServices.Database.InsertEnded
Wraps AcRxEventReactor::endInsert. The event indicates that an insert operation on the drawing database is complete.

Autodesk.AutoCAD.DatabaseServices.Database.WblockNotice
Wraps AcRxEventReactor::wblockNotice. The event indicates that a wblock operation is about to start.

Autodesk.AutoCAD.DatabaseServices.Database.BeginWblockSelectedObjects
Wraps AcRxEventReactor::beginWblock. The event indicates that a wblock operation is being performed on a set of entities within the drawing database.

Autodesk.AutoCAD.DatabaseServices.Database.BeginWblockBlock
Wraps AcRxEventReactor::beginWblock. The event indicates that a wblock operation is being performed.

Autodesk.AutoCAD.DatabaseServices.Database.BeginWblockEntireDatabase
Wraps AcRxEventReactor::beginWblock. The event indicates that a wblock operation is being performed on the drawing database.

Autodesk.AutoCAD.DatabaseServices.Database.WblockMappingAvailable
Wraps AcRxEventReactor::otherWblock. The event indicates that a wblock is being performed on the drawing database.

Autodesk.AutoCAD.DatabaseServices.Database.WblockAborted
Wraps AcRxEventReactor::abortWblock. The event indicates that a wblock being performed to the drawing was terminated and did not complete.

Autodesk.AutoCAD.DatabaseServices.Database.WblockEnded
Wraps AcRxEventReactor::endWblock. The event indicates that a wblock being performed to the drawing completed successfully.

Autodesk.AutoCAD.DatabaseServices.Database.BeginWblockObjects
Wraps AcRxEventReactor::beginWblockObjects. The event is made once for the database during each wblock clone execution.

Autodesk.AutoCAD.DatabaseServices.Database.BeginDeepClone
Wraps AcRxEventReactor::beginDeepClone. This event indicates that a deep clone operation is starting on the drawing database.

Autodesk.AutoCAD.DatabaseServices.Database.BeginDeepCloneTranslation
Wraps AcRxEventReactor::beginDeepCloneTranslation. A deep clone operation has two stages. First, each object and any owned objects are cloned. Second, any object ID references are translated to their cloned IDs.

Autodesk.AutoCAD.DatabaseServices.Database.DeepCloneAborted
Wraps AcRxEventReactor::abortDeepClone. The event indicates that the deep clone operation terminated.

Autodesk.AutoCAD.DatabaseServices.Database.DeepCloneEnded
Wraps AcRxEventReactor::endDeepClone. The event indicates that the deep clone operation concluded successfully.

Autodesk.AutoCAD.DatabaseServices.Database.PartialOpenNotice
Wraps AcRxEventReactor::partialOpenNotice. The event is invoked just before an attempt to partially open a database.

Autodesk.AutoCAD.DatabaseServices.Database.XrefBeginAttached
Wraps AcEditorReactor::beginAttach. The event indicates that an that an external reference database is to be attached to the database.

Autodesk.AutoCAD.DatabaseServices.Database.XrefBeginOtherAttached
Wraps AcEditorReactor::otherAttach. The event is sent just after beginDeepCloneTranslation notification, but only occurs for the xref attach process.

Autodesk.AutoCAD.DatabaseServices.Database.XrefAttachAborted
Wraps AcEditorReactor::abortAttach. The event indicates that an that an external reference attach operation has been performed to the drawing, but has not completed successfully.

Autodesk.AutoCAD.DatabaseServices.Database.XrefAttachEnded
Wraps AcEditorReactor::endAttach. The event indicates that an that an external reference attach operation has been performed to the drawing, and has completed successfully.

Autodesk.AutoCAD.DatabaseServices.Database.XrefRedirected
Wraps AcEditorReactor::redirected. The event indicates that an objectId is redirected, meaning that an objectId in the xref drawing is modified to point to the associated object in the host drawing (the drawing being XREFd into).

Autodesk.AutoCAD.DatabaseServices.Database.XrefComandeered
Wraps AcEditorReactor::commandeered. The event indicates that an object is commandeered, meaning that the objectId of the object is appended to the host drawing's (the drawing being XREFd into) symbol table.

Autodesk.AutoCAD.DatabaseServices.Database.XrefBeginRestore
Wraps AcEditorReactor::beginRestore. The event indicates that the Xref was previously unloaded, and now is to be reloaded, but its file has not changed.

Autodesk.AutoCAD.DatabaseServices.Database.XrefRestoreAborted
Wraps AcEditorReactor::abortRestore. The event indicates that a restore operation on the drawing database was terminated and did not complete.

Autodesk.AutoCAD.DatabaseServices.Database.XrefRestoreEnded
Wraps AcEditorReactor::endRestore. The event indicates that that the Xref was previously unloaded, and now has been reloaded, but its file has not changed.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectAppended
Wraps AcDbDatabaseReactor::objectAppended. The event indicates that an object has been added to the database.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectUnappended
Wraps AcDbDatabaseReactor::objectUnAppended. The event is invoked when an object has had its addition to the database dwg undone during an Undo operation.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectReappended
Wraps AcDbDatabaseReactor::objectReAppended. The event is invoked when an object has had its addition to the database dwg undone during an Undo operation, and has now been re-appended to the database due to an execution of the AutoCAD REDO command.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectOpenedForModify
Wraps AcDbDatabaseReactor::objectModified. The event is invoked before the object has been modified.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectModified
Wraps AcDbDatabaseReactor::objectModified. The event indicates that an object has been modified.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectErased
Wraps AcDbDatabaseReactor::objectErased. The event indicates that an object is being erased or unerased from the database.

Autodesk.AutoCAD.DatabaseServices.Database.SystemVariableWillChange
Wraps AcDbDatabaseReactor::headerSysVarWillChange. The event indicates that an attempt is being made to change the 'name' system variable.

Autodesk.AutoCAD.DatabaseServices.Database.SystemVariableChanged
Wraps AcDbDatabaseReactor::headerSysVarChanged. The event indicates that an attempt was made to change the 'name' system variable.

Autodesk.AutoCAD.DatabaseServices.Database.ProxyResurrectionCompleted
Wraps AcDbDatabaseReactor::proxyResurrectionCompleted. The event is invoked when the loading of an ObjectARX or ObjectDBX module resurrects proxy objects in the DWG database.

Autodesk.AutoCAD.DatabaseServices.Database.Disposed
Wraps AcDbDatabaseReactor::goodbye. The event indicates that the DWG database is about to be deleted.

Autodesk.AutoCAD.DatabaseServices.Database.XrefSubCommandStart
Wraps AcRxEventReactor::xrefSubCommandStart. This notification is sent on the start of an xref subcommand.

Autodesk.AutoCAD.DatabaseServices.Database.XrefPreXrefLockFile
Wraps AcEditorReactor::preXrefLockFile. The event is sent just before an Xref is locked.

Autodesk.AutoCAD.DatabaseServices.Database.XrefSubCommandAborted
Wraps AcRxEventReactor::xrefSubCommandAborted. This notification is sent if the xref subcommand is aborted during the xrefSubCommandStart() call.

Autodesk.AutoCAD.DatabaseServices.Database.GetVisualStyleList
This function returns a list containing the localized names of the visual styles defined in the visual style dictionary. Anonymous visual styles and visual styles marked for internal use only are excluded from this list.

Autodesk.AutoCAD.DatabaseServices.Database.GetDimensionStyleParentId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Given a child dimension style ID, this function returns the parent dimension style ID. If the parent is unavailable, the given child dimension style ID is returned.
childStyle:  Input child dimension style ID

Autodesk.AutoCAD.DatabaseServices.Database.UpdateExt(System.Boolean)
This function iterates through all the entities in the database's Model Space and updates the database's Model Space extents variables EXTMAX and EXTMIN to the values determined during the iteration..
doBestFit:  Determines whether to generate the tightest bounding box

Autodesk.AutoCAD.DatabaseServices.Database.GetDimRecentStyleList
This function allows the application to get the object ID entities of the most recently used dimstyles (up to 6) for dimension context menu dimstyle MRU list support. Most recently used dimstyle objects are tracked by monitoring the past six dimstyle objects that were current in the database.

Autodesk.AutoCAD.DatabaseServices.Database.GetNearestLineWeight(System.Int32)
The getNearestLineWeight() method takes a lineweight and returns the nearest LineWeight enum value. For example, if you pass in 4, then the value LineWeight005 is returned.
weight:  Input lineweight in hundredths of a millimeter

Autodesk.AutoCAD.DatabaseServices.Database.Purge(Autodesk.AutoCAD.DatabaseServices.ObjectIdGraph)
This version of the purge() method works in one pass. The method looks for references between the objects passed in so that it does not need to be called multiple times. In other words, if a Layer and a Linetype are passed in, and the only reference to the Linetype is from the Layer, then the graph returned will indicate that both the Layer and the Linetype can be purged. (The older ObjectIdCollection version of purge() would first indicate that only the Layer could be purged. Then a second call, after erasing the Layer, would say that the Linetype could be purged.).
idGraph:  Input graph of objects in the database. The graph will be returned containing only those objects that may safely be removed from the database.

Autodesk.AutoCAD.DatabaseServices.Database.Purge(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This function searches through the database to see if there are any hard references to objects with object ID entities in the ids array. If any such objects are found, their object ID entities are removed from the ids array. So, when this function returns, the ids array will contain only object ID entities of objects that are not currently hard-referenced and thus can safely be erased.
ids:  Input collection of object ID entities of objects

Autodesk.AutoCAD.DatabaseServices.Database.CountHardReferences(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Int32[])
This function traverses the database looking for objects with a hard reference to any of the objects whose objectId entities are in the ids array. Each time such a hard reference is found, the count will be incremented by 1 within the element of count that corresponds to the ids element of the objectId that is being hard referenced. For example, if a hard reference is found to the objectId in ids[2], then count[2] will be incremented by 1.
ids:  Input collection of objectId entities of objects to find the count of hard references to those objects
count:  Input array of the same size as ids that will be filled in with the counts for each corresponding element in ids

Autodesk.AutoCAD.DatabaseServices.Database.GetObjectId(System.Boolean,Autodesk.AutoCAD.DatabaseServices.Handle,System.Int32)
Returns the objectId of the object that has the handle value contained in objHandle. If createIfNotFound is true and the handle is not found in the database, then a new objectId stub object is created using the handle sought..
createIfNotFound:  Input Boolean indicating to create a objectId stub if input handle is not found
objHandle:  Input Handle object containing the handle being passed in
identifier:  Reserved for future use

Autodesk.AutoCAD.DatabaseServices.Database.ReadDwgFile(System.IntPtr,System.Boolean,System.String)
Reads the drawing file specified by drawingFile into the database object executing this function..
drawingFile:  Input pointer to DWG file to read
allowCPConversion:  Input Boolean indicating whether to allow codepage conversion
password:  Input string containing a DWG password

Autodesk.AutoCAD.DatabaseServices.Database.ReadDwgFile(System.String,Autodesk.AutoCAD.DatabaseServices.FileOpenMode,System.Boolean,System.String)
Reads the drawing file specified by fileName into the database object executing this function. fileName must include the extension of the file (which does not have to be .dwg) if the file to open has one, even if the extension is .dwg. fileName may be a URL..
fileName:  Input name or URL of file to read
mode:  Input open mode
allowCPConversion:  Input Boolean indicating whether to allow codepage conversion
password:  Input string containing a DWG password

Autodesk.AutoCAD.DatabaseServices.Database.SaveAs(System.String,Autodesk.AutoCAD.DatabaseServices.DwgVersion)
Runs the save process on the database and writes the drawing information out to fileName. The fileName argument is taken as is. If no file extension is present, .dwg is not appended.
fileName:  Input file name or URL to write database out to
version:  Input dwg version to which to save the file

Autodesk.AutoCAD.DatabaseServices.Database.DxfOut(System.String,System.Int32,System.Boolean)
This function creates an DXF file.
fileName:  Input name or URL of the new DXF file to create (the .dxf extension is not added automatically)
precision:  Number of bits of accuracy, from 0 to 16
saveThumbnailImage:  Input Boolean indicating whether to save thumbnail

Autodesk.AutoCAD.DatabaseServices.Database.CloseInput(System.Boolean)
If a drawing file is associated with this database, then this function forces an immediate read of all necessary information from the file into the database object. If closeFile is true, the drawing file will be closed when it has been fully read into the Database.
closeFile:  Input System.Boolean indicating whether to close the drawing file

Autodesk.AutoCAD.DatabaseServices.Database.ResolveXrefs(System.Boolean,System.Boolean)
This function resolves existing xrefs in the working database..
useThreadEngine:  Input Boolean indicating whether to use the thread engine for xref resolution
doNewOnly:  Input Boolean indicating whether to process only newly added xrefs

Autodesk.AutoCAD.DatabaseServices.Database.AttachXref(System.String,System.String)
Attaches the xref file specified by fileName to the database, thus creating a new xref BlockTableRecord. The new block table record's name is specified in blockName. Its object ID is returned.
fileName:  Input xref file path name
blockName:  Input xref block name symbol to use

Autodesk.AutoCAD.DatabaseServices.Database.OverlayXref(System.String,System.String)
Overlays the xref file specified by fileName to the database, thus creating a new xref BlockTableRecord. The new block table record's name is specified in blockName. Its object ID is returned.
fileName:  Input xref file path name
blockName:  Input xref block name symbol to use

Autodesk.AutoCAD.DatabaseServices.Database.ReloadXrefs(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This function reloads the xrefs whose BlockTableRecord ObjectIds are in xrefIds. The ObjectIds in xrefIds must all be from the working database.
xrefIds:  Input collection of ObjectIds for the xref BlockTableRecords to unload

Autodesk.AutoCAD.DatabaseServices.Database.BindXrefs(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Boolean)
This function binds the xrefs whose BlockTableRecord object IDs are in xrefIds. If insertBind is true, then the symbolTable record names will be changed from the xref naming convention to normal insert block names..
xrefIds:  Input collection of ObjectIds for the xref BlockTableRecords to bind.
insertBind:  Input System.Boolean to indicate whether or not to convert xref symbols to insert-like bind names.

Autodesk.AutoCAD.DatabaseServices.Database.XBindXrefs(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Boolean)
This function binds the xref symbolTable records whose ObjectIds are in xrefSymbolIds. If insertBind is true, then the symbolTable record names will be changed from the xref naming convention to normal insert symbolTable record names..
xrefSymbolIds:  Input collection of ObjectIds of SymbolTableRecord objects to be bound.
insertBind:  Input bool to indicate whether or not to convert xref symbols to insert-like bind names.

Autodesk.AutoCAD.DatabaseServices.Database.LoadMlineStyleFile(System.String,System.String)
This function loads the MlineStyle specified by mlineStyleName from the file specified by fileName. If fileName is not a URL and does not contain any path information, then the AutoCAD library search path will be searched for the file.
mlineStyleName:  Input MlineStyle name string (no wild cards)
fileName:  Input path/filename or URL of file to load from (path is optional)

Autodesk.AutoCAD.DatabaseServices.Database.ForceWblockDatabaseCopy
This function causes the next (and only the next) Database.wblock() call on this database to result in a copy of the database. (A database copy was always done by ObjectARX SDK 1.0 and 1.1.).

Autodesk.AutoCAD.DatabaseServices.Database.Insert(System.String,System.String,Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
This function creates a new block table record in the database executing this function. This new block table record is given the name pointed to by destinationBlockName. Then, each entity in the block table record whose name is sourceBlockName and which resides in the database pointed to by dataBase is copied into the new block table record..
sourceBlockName:  Input name of the blockTableRecord
destinationBlockName:  Input name to be used by the new block table record created by this function
dataBase:  Input database from which to insert entities
preserveSourceDatabase:  Input bool to determine whether the source database is left intact

Autodesk.AutoCAD.DatabaseServices.Database.Insert(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
Inserts the Model Space of the database pointed to by dataBase into the Model Space of the database invoking the insert() function. All objects being inserted have the xform matrix passed into their transformBy() function during the insertion process..
transform:  Input transformation matrix applied to all objects being inserted
dataBase:  Input database to insert from
preserveSourceDatabase:  Input to determine whether the source database pDb will be left intact

Autodesk.AutoCAD.DatabaseServices.Database.Insert(System.String,Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
This function mimics the AutoCAD INSERT command. First a new block table record is created in the database executing this function. This new block table record is given the name pointed to by blockName. Then, all the Model Space entities in the database pointed to by dataBase are copied into the new block table record..
blockName:  Input name to be used by the new block table record created by this function
dataBase:  Input database from which to insert entities
preserveSourceDatabase:  Input bool to determine whether the source database is left intact

Autodesk.AutoCAD.DatabaseServices.Database.DeepCloneObjects(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.IdMapping,System.Boolean)
Clones all objects in the objectId array and appends them to the container object specified by owner. mapping is filled with IdMapping objects that contain the objectId entities of the original and cloned object pairs. This array can be used for post-processing the objects involved in the deepClone operation..
identifiers:  Input collection of objects to be deep cloned
id:  Input Object ID of object to be the owner of the clones
mapping:  Returns collection of objects to be used for translating object ID relationships
deferTranslation:  Input Boolean indicating whether or not ID translation should be done

Autodesk.AutoCAD.DatabaseServices.Database.AbortDeepClone(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Triggers an Editor notification that the deepClone operation identified by idMap has been aborted. The IdMapping object will uniquely identify a deepClone operation.
idMap:  Input used in the deepClone operation being aborted

Autodesk.AutoCAD.DatabaseServices.Database.DisableUndoRecording(System.Boolean)
This function turns Undo recording on or off for operations performed on the database. If disable==true, then Undo recording is turned off..
disable:  Input Boolean indicating turn Undo on or off

Autodesk.AutoCAD.DatabaseServices.Database.Dimsah
Accesses current DIMSAH value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsd1
Accesses the current DIMSD1 value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsd2
Accesses the current DIMSD2 value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimse1
Accesses the current DIMSD1 value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimse2
Accesses the current DIMSD2 value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsoxd
Accesses the current DIMSOXD value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtfill
Accesses the dimension background color state, which can be one of the following values:.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtih
Accesses the current DIMTIH value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtix
Accesses the current DIMTIX value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtofl
Accesses the current DIMTOFL value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtoh
Accesses the current DIMTOH value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtol
Accesses the current DIMTOL value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimupt
Accesses the current DIMUPT value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.DrawOrderCtl
Returns the value of the DRAWORDERCTL system variable, which enables users to revert to legacy draw order mode if required. This system variable is per drawing in order to be consistent with SORTENTS.

Autodesk.AutoCAD.DatabaseServices.Database.ShadowPlaneLocation
Accesses the current ground plane z position in world coordinates. The ground plane is always parallel to the X-Y world plane.

Autodesk.AutoCAD.DatabaseServices.Database.AnnoAllVisible
Accesses the current ANNOALLVISIBLE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.PlotStyleMode
Returns true when this database is using color-dependent plot styles, and false for named plot styles. See the AutoCAD User's Guide for more information on the two types of plot styles.

Autodesk.AutoCAD.DatabaseServices.Database.Latitude
Accesses the latitude for the location of the model, in decimal degrees. Allowable values are -90 to +90 degrees, where positive numbers represent North latitudes.

Autodesk.AutoCAD.DatabaseServices.Database.Longitude
Accesses the longitude for the location of the model, in decimal degrees. Allowable values are -180 to +180 degrees, where positive numbers represent East longitudes.

Autodesk.AutoCAD.DatabaseServices.Database.Dimalt
Accesses the current DIMALT value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimlim
Accesses the current DIMLIM value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Handseed
Accesses the current HANDSEED value for the database. The HANDSEED is a counter which maintains the next available handle number. Handles are 64-bit integers represented in DXF and LISP/ADS in hexadecimal form as a string. In hexadecimal, a 64-bit integer can be up to 16 digits.

Autodesk.AutoCAD.DatabaseServices.Database.Pucs
Sets the Paper Space UCS. The Pucsorg(), Pucsxdir(), and Pucsydir() are the query properties for this UCS.

Autodesk.AutoCAD.DatabaseServices.Database.Insbase
Accesses the current Model Space INSBASE value for the database. The point is in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Database.Ucs
Sets the Model Space UCS. The Ucsorg(), Ucsxdir(), and Ucsydir() are the query properties for this UCS.

Autodesk.AutoCAD.DatabaseServices.Database.IsBeingDestroyed
Finds out if this database is in the process of being destroyed.

Autodesk.AutoCAD.DatabaseServices.Database.DispSilh
Accesses the current DISPSILH value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.PlineEllipse
Accesses the current PELLIPSE value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Usrtimer
Returns the current USRTIMER value for the database. A value of false is off. A value of true is on.

Autodesk.AutoCAD.DatabaseServices.Database.Skpoly
Accesses the current SKPOLY value for the database. The value of false is 0. The value of true is 1. See the System Variables section of the AutoCAD Command Reference for information on SKPOLY.

Autodesk.AutoCAD.DatabaseServices.Database.Angdir
Accesses the current ANGDIR value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Splframe
Accesses the current SPLFRAME value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Mirrtext
Accesses the current MIRRTEXT value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Worldview
Accesses the current WORLDVIEW value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Plimcheck
Accesses the current Paper Space LIMCHECK value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Visretain
Accesses the current VISRETAIN value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Celweight
Accesses the LineWeight value indicating what the current line weight is for the database. See the System Variables section of the AutoCAD Command Reference for information on CELWEIGHT.

Autodesk.AutoCAD.DatabaseServices.Database.XrefEditEnabled
Accesses the database's XEDIT value. A return value of true is the same as an XEDIT value of 1.

Autodesk.AutoCAD.DatabaseServices.Database.TileMode
Accesses the current TILEMODE value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.LayoutDictionaryId
Accesses the object ID of the ACAD_LAYOUT dictionary, which contains objects of type Layout. The Layout dictionary stores characteristics of each Paper Space layout.

Autodesk.AutoCAD.DatabaseServices.Database.OriginalFileName
Accesses the file name that the database was originally opened under. May return a null pointer if the database was created from a DXF file or a pre-R13 drawing file.

Autodesk.AutoCAD.DatabaseServices.Database.LastSavedAsVersion
Accesses the version that the current drawing was last saved as in the current session. If the current session has not yet done a save on this drawing, then it returns zero.

Autodesk.AutoCAD.DatabaseServices.Database.LastSavedAsMaintenanceVersion
Accesses the maintenance version that the current drawing was last saved as in the current session. If the current session has not yet done a save on this drawing, then it returns zero.

Autodesk.AutoCAD.DatabaseServices.Database.FileDependencyManager
Accesses the FileDependencyManager object for the database.

Autodesk.AutoCAD.DatabaseServices.Database.RetainOriginalThumbnailBitmap
Accesses the status of the thumbnail bitmap toggle flag. The status is FALSE by default. If it is toggled to TRUE, the Database will always try to retain the original image, no matter what other action is taken.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaso
Accesses the current DIMASO value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsho
Accesses the current DIMSHO value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Plinegen
Accesses the current PLINEGEN value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Orthomode
Accesses the current ORTHOMODE value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Regenmode
Accesses the current REGENMODE value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Fillmode
Accesses the current FILLMODE value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Qtextmode
Accesses the current QTEXTMODE value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Psltscale
Accesses the current PSLTSCALE value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Database.Limcheck
Accesses the current Model Space LIMCHECK value for the database. The value of false is 0. The value of true is 1.