Autodesk.AutoCAD.GraphicsInterface.ShadowFlags
This .NET class wraps the ShadowFlags ObjectARX class. This is an enumeration of valid bitmasks for the current shadow display property for the drawing, as set by the Database.Cshadow property.