Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx
The PointCloudDefEx object (or "point cloud extension definition object") controls the actual point cloud data associated with one or more PointCloudEx entities (or "point cloud extension entity"). These objects link the .rcp/.rcs file to the dwg file, similar to how Xrefs work.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.classVersion
Returns the class version number that indicates which version of AcDbPointCloudEx this object represents. This is primarily used during filing operations to determine what data to read or write.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.load
Loads point cloud data from the source point cloud file. If the point cloud is already loaded, true is returned. This will notifies all dependent AcDbPointCloudEx entities to be redrawn.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.unload
Unloads all point cloud data in the AcDbPointCloudDefEx immediately, but does not delete the AcDbPointCloudDefEx itself. This method notifies all dependent AcDbPointCloudEx entities to be redrawn.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.SourceFileName
Sets the pathname of a externally referenced point cloud file. The point cloud filepath name is stored when the current drawing is saved. The point cloud extension definition is initialized and a file descriptor is created for access to the point cloud file.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.ActiveFileName
Sets the active path name of the externally referenced point cloud file. The active path points to the file that is actually used to define the point cloud in the current drawing. However, the active path is not persistent, and is not saved in the drawing file. If pathname does not point to a valid point cloud file, then the active path is unchanged.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.FileType
Returns the file extension of this definition's point cloud file. There are two types: RCP for a ReCap Project file; RCS for a ReCap Scan file.