Autodesk.AutoCAD.Geometry.Position3d
This .NET class wraps the AcGePosition3d ObjectARX class. It represents a point in 3D space.

Autodesk.AutoCAD.Geometry.Position3d.#ctor
Default constructor. Constructs a 3D position object with coordinates of (0,0,0).