Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits
This .NET class wraps the AcGiGroundPlaneBackgroundTraits ObjectARX class. It represents a ground plane background to the underlying display system.