Autodesk.AutoCAD.DatabaseServices.Leader.SetPlane(Autodesk.AutoCAD.Geometry.Plane)
Sets the plane that will contain the leader object. This leader's data members will be updated to reflect the change of plane. To do this, a transformation matrix will be created that will translate all points from the current plane's coordinate system to the new plane's coordinate system--a projection is not used.
value:  Input desired plane within which the leader will reside

Autodesk.AutoCAD.DatabaseServices.Leader.AppendVertex(Autodesk.AutoCAD.Geometry.Point3d)
Appends vertex to the end of the vertex list for this leader. If vertex is not in the plane of the leader, then it will be projected parallel the leader's normal onto the leader's plane and the projection will be appended to the leader's vertex list. If the new vertex is too close to the one next to it (that is, within 1.e-10 for X, Y, and Z), the new vertex will not be appended.
pointToAdd:  Input point (in WCS coordinates) to add to the vertex list

Autodesk.AutoCAD.DatabaseServices.Leader.RemoveLastVertex
Removes the last vertex (the vertex at the annotation end) from the vertex list.

Autodesk.AutoCAD.DatabaseServices.Leader.SetVertexAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Resets the vertex at index to the point point projected (along the plane normal) onto the plane containing the leader. It doesn't reset the vertex if that would cause one of the segments to become zero length (within 1e-10).
index:  Input index number (0 based) of the vertex to change
pointValue:  Input new point value (in WCS) to use

Autodesk.AutoCAD.DatabaseServices.Leader.FirstVertex
Accesses the leader's start point in WCS coordinates. This will be the start of the arrowhead if enabled.

Autodesk.AutoCAD.DatabaseServices.Leader.LastVertex
Accesses the leader's last vertex in WCS coordinates. This is the vertex at the end where the annotation is attached.

Autodesk.AutoCAD.DatabaseServices.Leader.HasHookLine
Assesses if this leader has a hookline. The "hookline" is the small horizontal line at the end of the leader line just before the annotation.

Autodesk.AutoCAD.DatabaseServices.Leader.AnnotationOffset
Read-only.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimasz
Accesses the current DIMASZ value for the leader. If the value is overridden for this object, then that value is returned, otherwise the function will return the value from this dimension's dimension style. See the System Variables section of the AutoCAD Command Reference manual for information on DIMASZ.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimclrd
Accesses the current DIMCLRD value for the leader. If the value is overridden for this object, then that value is returned, otherwise the function will return the value from this dimension's dimension style. See the System Variables section of the AutoCAD Command Reference manual for information on DIMCLRD.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimgap
Accesses the current DIMGAP value for the leader. If the value is overridden for this object, then that value is returned, otherwise the function will return the value from this dimension's dimension style. See the System Variables section of the AutoCAD Command Reference for information on DIMGAP.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimlwd
Accesses the current DIMLWD value for the leader. If the value is overridden for this object, then that value is returned, otherwise the function will return the value from this dimension's dimension style. See the System Variables section of the AutoCAD Command Reference for information on DIMLWD.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimldrblk
Accesses the object ID of the block reference that is the current DIMLDRBLK value for the leader. If the value is overridden for this leader, then that value is returned; otherwise, the function will return the value from this leader's dimension style.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimsah
Accesses the current DIMSAH value for the leader. If the value is overridden for this leader, then that value is returned; otherwise, the function will return the value from this leader's dimension style.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimscale
Accesses the current DIMSCALE value for the leader. If the value is overridden for this object, then that value is returned, otherwise the function will return the value from this dimension's dimension style. See the System Variables section of the AutoCAD Command Reference for information on DIMSCALE.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimtad
Accesses the current DIMTAD value for the leader. If the value is overridden for this object, then that value is returned, otherwise the function will return the value from this dimension's dimension style. See the System Variables section of the AutoCAD Command Reference for information on DIMTAD.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimtxt
Accesses the current DIMTXT value for the leader. If the value is overridden for this leader, then that value is returned; otherwise, the function will return the value from this leader's dimension style.