Autodesk.AutoCAD.Geometry.Position2d
This .NET class wraps the AcGePosition2d ObjectARX class. It represents a point in 2D space.

Autodesk.AutoCAD.Geometry.Position2d.#ctor
Default constructor. Constructs a 2D position object with coordinates of (0,0).