Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.#ctor
Default constructor. Initializes the origin to (0,0,0); the IsAnonymous, HasAttributeDefinitions, IsFromExternalReference, and IsFromOverlayReference flags to false; and the PathName to NULL. In addition, the SymbolTableRecord default constructor is invoked.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.GetErasedBlockReferenceIds
This function returns a list of BlockReferences that directly reference this block. It only returns those block references that have been erased.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.PathName
Accesses the path and name of the xref drawing. If this block table record is not an xref, then this string will be copied into the block table record, but will not be used.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.Origin
Accesses the insertion point of the block table record in WCS coordinates. This point is the origin of the MCS (which is the local WCS for the entities within the block table record).