Autodesk.AutoCAD.DatabaseServices.GripMode.ToolTip
Gets and sets the string tool tip of this mode. (For future use.).

Autodesk.AutoCAD.DatabaseServices.GripMode.Cursor
Gets and sets the type of cursor this mode uses. Optional.

Autodesk.AutoCAD.DatabaseServices.GripMode.CommandString
Gets and sets the command used for this mode if the action type is kCommand. Optional.