Autodesk.AutoCAD.DatabaseServices.AssocValueProviderPE
AcRx protocol extension pure virtual base class that defines protocol to get and set arbitrary simple scalar values of DBObjects. The values are identified by string names (needed if there is more than one of them for the same object) and their meaning is up to the implementor of the concrete protocol extension derived classes.

Autodesk.AutoCAD.DatabaseServices.AssocValueProviderPE.CanGetValue(Autodesk.AutoCAD.DatabaseServices.DBObject,System.String)
Checks whether it is possible to get the value identified by valueName. The default implementation always returns true for any valueName.
valueName:  The name of the queried value.
object:  The object must be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocValueProviderPE.CanSetValue(Autodesk.AutoCAD.DatabaseServices.DBObject,System.String)
Checks whether it is possible to set the value identified by valueName. The default implementation always returns false for any valueName.
valueName:  The name of the queried value.
object:  The object must be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocValueProviderPE.GetValue(Autodesk.AutoCAD.DatabaseServices.DBObject,System.String)
Gets the value identified by valueName. This method must always be overridden by concrete derived classes.
valueName:  The name of the queried value.
object:  The object must be open for read.