Autodesk.AutoCAD.DatabaseServices.MlineStyleElement.ToString
Returns an equivalent string representation of this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElement.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
provider:  Input culture specific format.