Autodesk.AutoCAD.GraphicsInterface.IlluminationModel
This .NET class wraps the IlluminationModel ObjectARX class. It specifies what illumination model is used in the advanced rendering process when dealing with materials.