Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.FastZoomsEnabled
This function always returns true. It is obsolete and will be removed in a future release.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.IconAtOrigin
This function returns true if the ViewportTableRecord is currently set to have the UCS icon follow the current UCS origin (as long as the origin is far enough within the viewport to allow the icon to display properly). If the icon is not set to follow the UCS origin in the viewport, then false is returned.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapIncrements
This function returns an Point2d in which the X value represents the X spacing of the snap grid and the Y value represents the Y spacing of the snap grid. Both values are in drawing units.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.UcsSavedWithViewport
This function returns the value of UCSVP for the viewport. If this function returns true, then the ucs that is saved with this viewport will become active whenever the viewport is made active.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridSubdivisionRestricted
Returns true if the grid adapts to display more lines that specified in the GRIDUNIT setting. When zooming in the gridlines may get too sparse, so more lines are displayed.