Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.FlagBits
Returns the textStyleflagBits value. Only the second and third bits are used. If the second bit is set it indicates that the text is drawn backward (that is, mirrored in X). If the third bit is set it indicates that the text is drawn upside down (that is, mirrored in Y).

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.PriorSize
Returns the text height used for the last text created using this Text Style. This value is updated automatically by AutoCAD after the creation of any text object that references this TextStyleTableRecord. If the textSize value for this textStyle is 0, then the priorSize value is used by AutoCAD as the default text height for the next text created using this Text Style.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.Font
Returns the font definition data from the text style record. The returned values are the typeface, the bold and italics style attributes, the character set, and the pitch and family attributes.