Autodesk.AutoCAD.DatabaseServices.InterferenceProtocolExtension.CreateInterferenceObjects(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Entity,System.Int32)
The implementer is expected to create new Entity instance(s), based on interference between the two provided entities, and append the new entities to the returned array. The caller will either post the new entities to the database or delete them.
ent1:  Input entity 1
ent2:  Input entity 2
flags:  Input interference flags