Autodesk.AutoCAD.DatabaseServices.SectionSymbol.#ctor
Constructor for the SectionSymbol class. For internal use only.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.AddSectionPoint(Autodesk.AutoCAD.Geometry.Point3d,System.Double)
This .NET method wraps the ObjectARX method. For internal use only.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.RemoveSectionPointAt(System.Int32)
This .NET method wraps the ObjectARX method. For internal use only.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.SetSectionPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d,System.Double)
This .NET method wraps the ObjectARX method. For internal use only.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.GetLabelNameAt(System.Int32)
Gets the label at the point identified by the specified index. A section identifier is can be created at ever end and bend line point of the section symbol based on the view section style.
index:  Input: zero-based index into the section symbol point collection.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.SetLabelNameAt(System.Int32,System.String)
This .NET method wraps the ObjectARX method. For internal use only.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.SetLabelOffsetAt(System.Int32,Autodesk.AutoCAD.Geometry.Vector3d)
This .NET method wraps the ObjectARX method. For internal use only.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.SymbolStyleId
The object ID of the SectionViewStyle object associated with this entity. Returns ObjectId.