Autodesk.AutoCAD.DatabaseServices.Vertex2d.Position
Returns the position value of the vertex. The position point value must be in OCS coordinates (the OCS of the polyline containing the vertex), not WCS. The Z coordinate is kept in the owning 2dPolyline only for historical purposes. To find the WCS position of the vertex use AcDb2dPolyline.vertexPosition(), which takes a pointer to the vertex as an argument. To get the OCS Z coordinate, use the owning polyline’s AcDb2dPolyline.elevation() method.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.StartWidth
Returns the start width for the vertex. The start width is used as the width at this vertex for the polyline segment from this vertex to the next vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.EndWidth
Returns the end width for the vertex. The end width is used as the width at the end of the polyline segment from this vertex to the next vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.Bulge
Returns the vertex’s bulge value. The bulge is the tangent of 1/4 of the included angle for the arc between the selected vertex and the next vertex in the polyline’s vertex list. A negative bulge value indicates that the arc goes clockwise from the selected vertex to the next vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.Tangent
Returns the curve-fit tangent direction for the vertex. This is the angle (in radians) between the OCS X axis for the polyline containing the vertex and the tangent direction vector.