Autodesk.AutoCAD.GraphicsInterface.TransientManager.AddChildTransient(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.Drawable)
This function adds a child transient to specified parent transient. This allows for partial updates of the parent drawable.
added:  Input the adding child transient
parent:  Input the parent transient

Autodesk.AutoCAD.GraphicsInterface.TransientManager.UpdateChildTransient(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.Drawable)
This function only updates a child transient of the specified parent transient. This means partial updates of parent drawable.
updated:  Input the updating child transient
parent:  Input the parent transient