Autodesk.AutoCAD.DatabaseServices.SecurityActions
This enumeration encapsulates a corresponding ObjectARX enum that is used by the SecurityParams ObjectARX struct. SecurityParams stores information for security operations requested during DWG file I/O.