Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping.#ctor(System.Boolean,System.Boolean,System.Double,System.Double)
Fills in the parameters with information about the existence and location of front and back display clipping planes. Clipping planes are always perpendicular to the camera target vector. When active, the geometry in front of the front clipping plane or in back of the back clipping plane is not displayed..
clipFront:  Input Boolean indicating if front clip plane is active
clipBack:  Input Boolean indicating if back clip plane is active
front:  Input eye coordinate Z value of front clipping plane
back:  Input eye coordinate Z value of front clipping plane

Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping.IsEqualTo(Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping,Autodesk.AutoCAD.Geometry.Tolerance)
This method tests a for equality to this object by comparing the Front, Back, ClipFront, and ClipBack properties. Front and Back properties must match within the tolerance range specified by tolerance.
a:  Input object with which to check against
tolerance:  Input tolerance value