Autodesk.AutoCAD.GraphicsInterface.Glyph.SetLocation(Autodesk.AutoCAD.Geometry.Point3d)
This method is invoked from a host application immediately prior to invoking ViewportDraw() or WorldDraw() on the glyph. The glyph should be drawn with viewport-specific graphics, typically using the device coordinate members (denoted with dc in their names) of ViewportGeometry, however the location of the position to draw them at is computed as a WCS point, since GetOsnapPoints(), GetOsnapCurves() and GetOsnapInfo() all return their points and lines in WCS coordinates.
point:  Input display coordinate system (DCS) point.