Autodesk.AutoCAD.Geometry.PolylineCurve3d
This .NET class wraps the AcGePolyline3d ObjectARX class. It's represents a piecewise linear spline entity in 3D space.

Autodesk.AutoCAD.Geometry.PolylineCurve3d.#ctor
Default constructor. Constructs placeholder only.