Autodesk.AutoCAD.DatabaseServices.MlineStyle.Set(Autodesk.AutoCAD.DatabaseServices.MlineStyle,System.Boolean)
Copies the information from source into the MlineStyle..
source:  Input MlineStyle to copy from
checkIfReferenced:  Input Boolean indicating whether to check if the style is referenced

Autodesk.AutoCAD.DatabaseServices.MlineStyle.Description
Accesses the description string for the MlineStyle object. The description string is not used by AutoCAD--it is provided as a place to store some descriptive text about the MlineStyle. The description string shows up in the "Description" edit box of the MlineStyle dialog in AutoCAD. The description string can be up to MSTYLE_DESCRIPTION_LENGTH in length.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.Name
Accesses the name string in the MlineStyle. The name string can be up to MSTYLE_NAME_LENGTH in length.