Autodesk.AutoCAD.Geometry.CurveBoundary.#ctor
Default constructor. Creates an empty instance.

Autodesk.AutoCAD.Geometry.CurveBoundary.Set(System.Int32,Autodesk.AutoCAD.Geometry.Entity3d[],Autodesk.AutoCAD.Geometry.Curve2d[],System.Boolean,System.Boolean)
Resets the definition of an instance of this class. If the current instance is not empty, and it owns its definition data, then prior to resetting the definition data, it would delete the existing definition..
numElements:  Input number of elements in curve boundary
curve3ds:  Input array of 3D space geometry of each element of curve boundary
curve2ds:  Input array of parameter space geometry of each element of curve boundary
orientation3d:  Input logical orientation applicable to each element of 3dGeometry
orientation2d:  Input logical orientation applied to each element of paramGeometry

Autodesk.AutoCAD.Geometry.CurveBoundary.SetToOwnCurves
Forces this instance to own its definition data. If the current instance is the owner, then this is non-operational. Otherwise, this method makes a copy of the definition data such that it owns that data.

Autodesk.AutoCAD.Geometry.CurveBoundary.IsDegenerate
Returns true if the curve boundary consists of a single element and it is degenerate to a single 3D space point. Otherwise it returns false.