Autodesk.AutoCAD.Geometry.Entity2d
This .NET class wraps the AcGeEntity2d ObjectARX class. This is an abstract base class for all point set classes. Any class that is derived from this class represents a set of points in 2D space.

Autodesk.AutoCAD.Geometry.Entity2d.ScaleBy(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Scales the entity about the input point by the input scale factor. Input scale factor must be greater than 0.
scaleFactor:  Input amount by which entity is to be scaled
point:  Input point about which entity is to be scaled