Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits
This .NET class wraps the AcGiRenderSettingsTraits ObjectARX class. It represents render settings to the underlying display system.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.ModelScaleFactor
Returns the model scale factor relative to meters. For example, if the model is drawn in mm, the scale factor is 0.001.