Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector
This .NET class wraps the AcGeSurfSurfInt ObjectARX class. This class holds data for intersections of two surfaces.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.#ctor(Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Surface)
The intersection class constructor references surface objects, but the intersection object does not own them. The surface objects are linked to the intersection object. On deletion or modification of one of them, internal intersection results are marked as invalid and to be re-computed.
surface2:  Input second surface object
surface1:  Input first surface object

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.IntersectParameterCurve(System.Int32,System.Boolean,System.Boolean)
Returns NULL if the dimension of this intersection is not 1..
number:  Input index of the intersection
isExternal:  Input Boolean to return curve on first or second surface
isFirst:  Input Boolean flag to return curve on first or second surface