Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.GetViewLabelPattern(Autodesk.AutoCAD.DatabaseServices.Field)
This method gets the pattern for view label. If the view label pattern is using fields, the master field will be copied to the given 'field' including child fields.
field:  Input: a field object to be updated with the view label pattern master field.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.SetViewLabelPattern(System.String,Autodesk.AutoCAD.DatabaseServices.Field)
Sets the pattern for view label. If 'field' parameter is specified and contains child fields, then label pattern will be acquired from the field. Otherwise the 'pattern' string is used.
pattern:  Input: the pattern string for the view label.
field:  Input: optional pointer to a Field

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.PostViewStyleToDb(Autodesk.AutoCAD.DatabaseServices.Database,System.String)
Add this view style object to the given database using the given name. Returns the object id of the newly added DetailViewStyle object.
dataBasePointer:  Input: database to be updated.
styleName:  Input: name to be used for this view style.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.Name
The name of the detail view style. Return value is System::String.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.Description
The description of the detail view style. Return value is System::String.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.IsModifiedForRecompute
Indicates whether the detail view style has been modified and associated detail views and detail view symbols need to be updated. Return value is bool.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.IdentifierStyleId
The id of the text style table record to be associated to detail symbol identifier. Return value is ObjectId.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.IdentifierColor
The color to be used for the identifier detail view symbols. Return value is Color.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.IdentifierHeight
The text height to be used by the identifier of detail view symbols. Return value is double.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.IdentifierOffset
The offset of the detail view symbol identifier from the extension line. Return value is double.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.IdentifierPlacement
The identifer placement flags relating to the detail view symbol boundary. Return value is NAMESPACE_ACDB::DetailViewIdentifierPlacement.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ArrowSymbolId
The objectId of the block table record used to represent the detail view symbol arrowhead. Return value is ObjectId.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ArrowSymbolColor
The color for the detail view symbol arrowhead. Return value is Color.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ArrowSymbolSize
The size for the detail view symbol arrowhead. Return value is double.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ShowArrowheads
Indicates whether the detail symbol should display the detail view symbol arrowhead. Return value is bool.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.BoundaryLineWeight
The line weight for the detail view symbol boundary line. The return value is LineWeight.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.BoundaryLineColor
The color for the detail view symbol boundary line. Return value is Color.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.BoundaryLineTypeId
The ObjectId of the linetype for the detail view symbol boundary line. Return value is ObjectId.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ConnectionLineWeight
The line weight for the detail view symbol connection line. Return value is .ineWeight.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ConnectionLineColor
The color for the detail view symbol connection line. Return value is Color.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ConnectionLineTypeId
The ObjectId of the linetype for the detail view symbol connection line. Return value is ObjectId.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelTextStyleId
The id of the text style table record to be associated to the detial view label text. Return is ObjectId.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelTextColor
The color for detial view label text. Return is Color.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelTextHeight
The height for the detail view label text. Return is double.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelOffset
The offset distance for the detail view label text. Return is double.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelPattern
The pattern for the detail view label text. The return value is String.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ShowViewLabel
Indicates whether the section view should display the detail view label text. Return value is bool.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ModelEdge
The type of model edge for the detail view. Return value is NAMESPACE_ACDB::DetailViewModelEdge.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.BorderLineWeight
The line weight for the detail view border line. Return value is LineWeight.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.BorderLineColor
The color for the detail view border line. Return value is Color.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.BorderLineTypeId
The ObjectId of the linetype for the detail view border line. Return value is ObjectId.