Autodesk.AutoCAD.DatabaseServices.Field.#ctor(System.String,System.Boolean)
Constructor that sets the field code. It does not evaluate the field..
fieldCode:  Input field code
textField:  Input flag indicating whether this is a text field

Autodesk.AutoCAD.DatabaseServices.Field.#ctor(System.String)
Constructor that sets the field code. It does not evaluate the field.
fieldCode:  Input field code

Autodesk.AutoCAD.DatabaseServices.Field.SetFieldCodeWithChildren(Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags,Autodesk.AutoCAD.DatabaseServices.FieldCodeWithChildren)
Sets the field code. For fields attached to DBObject objects, the DBObject object should be closed before calling SetFieldCodeWithChildren() to ensure the field contents are updated correctly.
flag:  Input flag, which can be one or more of the FieldCodeFlags values
fieldCode:  Input field code to set

Autodesk.AutoCAD.DatabaseServices.Field.SetFieldCodeWithChildren(Autodesk.AutoCAD.DatabaseServices.FieldCodeWithChildren)
Sets the field code. For fields attached to DBObject objects, the DBObject object should be closed before calling SetFieldCodeWithChildren() to ensure the field contents are updated correctly.
fieldCode:  Input field code to set

Autodesk.AutoCAD.DatabaseServices.Field.ConvertToTextField
Converts the field to a text field. A text field encapsulates text with embedded fields.

Autodesk.AutoCAD.DatabaseServices.Field.GetFieldCode
This function can be used to get a field code in various forms. It returns the field code as a string.

Autodesk.AutoCAD.DatabaseServices.Field.SetFieldCode(System.String)
Sets the field code. For fields attached to DBObject objects, the DBObject object should be closed before calling SetFieldCode() to ensure the field contents are updated correctly.
fieldCode:  Input field code to set

Autodesk.AutoCAD.DatabaseServices.Field.GetFieldCodeWithChildren
This function can be used to get a field code in various forms. It returns the field code as a string.

Autodesk.AutoCAD.DatabaseServices.Field.Evaluate(System.Int32,Autodesk.AutoCAD.DatabaseServices.Database)
This method evaluates the field. After creating a field object and setting the field code, call this method to evaluate the field.
evaluationOptions:  Input context in which the field is evaluated; the context flag can be one of the predefined FieldEvaluationContext enum flags or a user-defined context flag
database:  Input database to be used for the evaluation, which can be null

Autodesk.AutoCAD.DatabaseServices.Field.SetData(System.String,System.Object,System.Boolean)
Sets data in the field object using a key. The data will be copied and stored in the field object, and filed in and filed out with it. If the data contains an object ID, it will be properly translated during wblock operations..
key:  Input key to use to set and get the data; the key cannot be null or an empty string
data:  Input the object that contains the data
recursive:  Input true if the data is to be set in all child fields, false if it is to be set only in this field

Autodesk.AutoCAD.DatabaseServices.Field.SetData(System.String,System.Object)
Sets data in the field object using a key. The data will be copied and stored in the field object, and filed in and filed out with it. If the data contains an object ID, it will be properly translated during wblock operations.
key:  Input key to use to set and get the data; the key cannot be null or an empty string
data:  Input the object that contains the data

Autodesk.AutoCAD.DatabaseServices.Field.FindField(System.String,System.Int32,System.Int32&,System.Int32&)
This function can be used to extract the embedded fields in text. It can be called in a loop to extract all the fields in the text.

Autodesk.AutoCAD.DatabaseServices.Field.HyperLink
Accesses the hyperlink associated with the field. A field can have only one hyperlink associated with it. The hyperlink can be set in a database-resident field object or an in-memory field object.