Autodesk.AutoCAD.Geometry.OffsetSurface
This .NET class wraps the AcGeOffsetSurface ObjectARX class. It represents an offset object.

Autodesk.AutoCAD.Geometry.OffsetSurface.#ctor
Default constructor. Initializes the base surface pointer to NULL and the offset distance to 0.0.