Autodesk.AutoCAD.Geometry.Line2dCollection.Add(Autodesk.AutoCAD.Geometry.Line2d)
Adds the object represented by value to this collection. Returns the zero-based index of the newly added collection item.
value:  Input value to add