Autodesk.AutoCAD.Geometry.Matrix2d.#ctor(System.Double[])
This constructor creates a 2D matrix based on values in an array.

Autodesk.AutoCAD.Geometry.Matrix2d.PreMultiplyBy(Autodesk.AutoCAD.Geometry.Matrix2d)
Sets this matrix to the product leftSide * (this matrix). Returns a reference to this matrix.
leftSide:  Input left side of matrix

Autodesk.AutoCAD.Geometry.Matrix2d.PostMultiplyBy(Autodesk.AutoCAD.Geometry.Matrix2d)
Sets this matrix to the product (this matrix) * rightSide. Returns a reference to this matrix.
rightSide:  Input right side of matrix

Autodesk.AutoCAD.Geometry.Matrix2d.IsScaledOrtho(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors,. Returns false otherwise.
tolerance:  Input tolerance data value

Autodesk.AutoCAD.Geometry.Matrix2d.GetScale
Returns scale factor of matrix. The returned scale is the square root of the maximum length of the two column vectors.

Autodesk.AutoCAD.Geometry.Matrix2d.IsConformal(Autodesk.AutoCAD.Geometry.Matrix2dInfo)
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors and these two vectors have equal length. Returns false otherwise.
info:  Input matrix to check with

Autodesk.AutoCAD.Geometry.Matrix2d.Mirroring(Autodesk.AutoCAD.Geometry.Point2d)
Returns the matrix of mirroring with respect to point. This is the same as central symmetry with a center point.
point:  Input point that defines the mirror line

Autodesk.AutoCAD.Geometry.Matrix2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if each column of this matrix is equal to the corresponding column of the matrix mat as vectors. Returns false otherwise.
a:  Input matrix to compare against
tolerance:  Input tolerance data value

Autodesk.AutoCAD.Geometry.Matrix2d.ToArray
This method returns this matrix as a 1-dimensional array containing 9 elements of type System.Double. The array elements store the matrix row (rn) and column (cn) indices in the following order:.