Autodesk.AutoCAD.DatabaseServices.AssocArray
AssocArray wraps the ObjectARX class AcDbAssocArrayActionBody. It has the object Id of the ID of an associative array (rectangular, polar or path array) and the ID of that associative array's corresponding AcDbAssocArrayActionBody, which is responsible for evaluating the array's parameters. It owns a AssocArrayParameters object to manipulate the parameters of the associative array.

Autodesk.AutoCAD.DatabaseServices.AssocArray.GetAssociativeArray(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This method returns the AssocArray object with the given entity. The ID of the ActionBody evaluating this entity (associative array) is attached to this AssocArray object. If no such ActionBody exists, a null pointer is returned.

Autodesk.AutoCAD.DatabaseServices.AssocArray.ReplaceItems(Autodesk.AutoCAD.DatabaseServices.ItemLocator[],Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.VertexRef)
Replaces items, identified by their indices in the form of ItemLocator, with given substEntities and basePoint. The substEntities form an array item, and this new array item is placed in the locations indicated by the given indices. The basePoint is relative to the substEntities, and it is transformed along with the substEntities.

Autodesk.AutoCAD.DatabaseServices.AssocArray.getItemLocators(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Obtains a list of ItemLocator for given list of subents of an associative array. The subent provided should be a full subentity path of an entity in an array item.