Autodesk.AutoCAD.DatabaseServices.SectionManager.LiveSection
Gets the currently enabled  live section plane in the database. Live sectioning is either enabled or disabled individually per section object. Live sectioning can be active for no more than one section object at a time.