Autodesk.AutoCAD.GraphicsInterface.VertexData
This .NET class wraps the AcGiVertexData ObjectARX class. This class is a container for the optional data that can be specified for a set of vertices for meshes and shells. An object of this class is meant to be passed in as an argument to Geometry.mesh() and AcGiGeometry.shell().

Autodesk.AutoCAD.GraphicsInterface.VertexData.SetNormalVectors(Autodesk.AutoCAD.Geometry.Vector3d[])
Sets normal to be the array of face normal vectors used by this object. Input one array for each vertex in the mesh or shell, or NULL if specification of normal is not desired at the vertices.
normal:  Input array of normal vectors

Autodesk.AutoCAD.GraphicsInterface.VertexData.SetTrueColors(Autodesk.AutoCAD.Colors.EntityColor[])
Read-only.
colors:  Input array of colors

Autodesk.AutoCAD.GraphicsInterface.VertexData.GetNormalVectors
Returns the vertex normal currently in use by the VertexData object. The object returned is either NULL or points to an array which has exactly the same number of elements as there are vertices in the mesh or shell. If the pointer is not NULL, then each of the elements in the array pointed to is a valid Model Coordinate System vector, which is used as the normal for the corresponding vertex in the mesh or shell's vertex array.

Autodesk.AutoCAD.GraphicsInterface.VertexData.OrientationFlag
Returns the current orientation type for vertices. The orientation type indicates the direction the vertices in a mesh or shell appear to follow when viewed in order while looking down the normal axis towards any given vertex. Essentially the orientation type defines the normal's positive or negative direction at the vertices.