Autodesk.AutoCAD.Runtime.Variable
Represents a variable in the system. Variables are a convenient way to advertise arbitrary state to other parts of the system.

Autodesk.AutoCAD.Runtime.Variable.Reset
Resets this variable to its default value. Observers are notified.