Autodesk.AutoCAD.DatabaseServices.SweptSurface
This .NET class wraps the AcDbSweptSurface ObjectARX class. This class represents a swept surface entity. It provides methods to create and manipulate ASM surfaces