Autodesk.AutoCAD.DatabaseServices.LayerTable.GenerateUsageData
Generates usage data for each LayerTableRecord in this layer table. The usage data is cached in LayerTableRecords and can be retrieved using the IsUsed property.

Autodesk.AutoCAD.DatabaseServices.LayerTable.GetUnreconciledLayers
Retrieves the unreconciled layer.