Autodesk.AutoCAD.DatabaseServices.BlockReference.ExplodeToOwnerSpace
Explodes the block reference into individual components. It appends the resulting entities to the BlockTableRecord that owns the BlockReference on which this method was called.

Autodesk.AutoCAD.DatabaseServices.BlockReference.Rotation
Accesses the rotation value (in radians) of the block reference. The rotation value is relative to the X axis of a coordinate system that is parallel to the OCS of the block reference, but has its origin at the position point of the block reference. The rotation axis is the Z axis of this coordinate system with positive rotations going counterclockwise when looking down the Z axis towards the origin.

Autodesk.AutoCAD.DatabaseServices.BlockReference.BlockTransform
Accesses the block reference’s position (insertion point), normal vector, scale factors, and rotation so that the resulting MCS-to-drawing-WCS transform is the same as the transform matrix. MCS is the WCS within the block table record’s microspace.