Autodesk.AutoCAD.DatabaseServices.Shape
This .NET class wraps the AcDbShape ObjectARX class. It represents the SHAPE entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Shape.Name
Returns the name of the shape. If no name has been set, then NULL is returned. The caller of this function is responsible for freeing the memory used by the returned string.

Autodesk.AutoCAD.DatabaseServices.Shape.Rotation
Returns the rotation angle of the shape. The rotation angle is relative to the X axis of the shape's OCS with positive angles going counterclockwise when looking down the Z axis towards the origin. The OCS X axis is determined by using the shape's normal, the WCS Z axis, and the arbitrary axis algorithm.

Autodesk.AutoCAD.DatabaseServices.Shape.WidthFactor
Returns the width factor (sometimes referred to as the relative X-scale factor). The widthFactor is applied to the shape's width to allow the width to be adjusted independently of the height. For example, if the widthFactor value is 0.8, then the shape will be drawn with a width that is 80% of its normal "unadjusted" width.

Autodesk.AutoCAD.DatabaseServices.Shape.Oblique
Returns the oblique angle of the shape. The obliquing angle is the angle of slant from the shape's vertical.

Autodesk.AutoCAD.DatabaseServices.Shape.Thickness
Returns the thickness of the shape. The thickness is the shape's dimension along its normal vector direction (sometimes called the extrusion direction).

Autodesk.AutoCAD.DatabaseServices.Shape.Normal
Returns the normal vector of the plane containing the shape. The normal vector is in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Shape.ShapeNumber
Returns the number of the shape. A shape is stored as a reference to a font, and a character within that font. Essentially a shape is a single character of a special SHX font. This function sets the number of that character.