Autodesk.AutoCAD.DatabaseServices.TableStyle.SetTextStyle(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
This function sets the table object to use the TextStyleTableRecord specified by ID for the specified row types. Different row types can be OR'ed.
id:  Input TextStyleTableRecord object ID
rowTypes:  Input row types

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetTextHeight(System.Double,System.Int32)
This function sets the text height for the specified row types. Different row types can be combined using the OR operator.
height:  Input value indicating the new text height
rowTypes:  Input row types for which to set the text height

Autodesk.AutoCAD.DatabaseServices.TableStyle.Template
Accesses the ID of the Template object in the table style. If the table style does not contain a template, then the returned objectId will be set to NULL.