Autodesk.AutoCAD.DatabaseServices.LoftedSurface.GetGuideProfile(System.Int32)
Returns the guide profile at zero-based index. The returned object contains the guide entity and edge data if the profile is for an edge or set of edges. The caller is responsible for deleting the returned pointer.
idx:  Input index of guide.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.GetCrossSectionProfile(System.Int32)
Returns the cross section profile at zero-based index. The returned object contains the cross section entity and edge data if the profile is for an edge or set of edges, and also contains the continuity and takeoff vector magnitude if idx references the first or last profile. The caller is responsible for deleting the returned pointer.
idx:  Input index of cross section.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.PathEntity
Gets the path curve of the surface, or null if no path profile was used to create the surface. If the path is for an edge or set of edges then the edge curve will be returned. The caller should not delete this pointer.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.GuideProfiles
Gets the list of guide profiles that were used to create the surface. The returned objects contain the guide entity and edge data if the profile is for an edge or set of edges. The caller is responsible for deleting all pointers in the output list.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.PathProfile
Gets the path profile that was used to create the surface, or null if no path was used. The returned object contains the guide entity and edge data if the profile is for an edge or set of edges.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.StartGuideCurveContinuity
Gets the continuity at the first guide. Input new continuity (must be 0, 1, or 2).

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.StartCrossSectionContinuity
Gets the continuity at the first cross section. Sets the continuity at the first cross section and recreates the surface. Input new continuity (must be 0, 1, or 2).

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.EndGuideCurveContinuity
Gets the continuity at the last guide. 0, 1, or 2 which corresponds to G0, G1, or G2.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.EndCrossSectionContinuity
Gets and set the continuity at the last cross section. 0, 1, or 2 which corresponds to G0, G1, or G2.