Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotConfigurationName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.String,System.String)
Specifies a system printer or PC3 file containing the "how to plot" information.
plotSet:  Input
plotDeviceName:  Input pointer to plot device name
mediaName:  Input media name

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetCanonicalMediaName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.String)
Sets a locale-independent identifier for a specific media size. Use GetLocaleMediaName() to get the locale version of the identifier.
plotSet:  Input
mediaName:  Input pointer to canonical media name

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotOrigin(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.Geometry.Point2d)
Contains the plot origin offset that is applied inside of the paper margins.
plotSet:  Input
origin:  Input offset coordinates

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotPaperUnits(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.PlotPaperUnit)
This method sets the units for plotting using the enumeration PlotPaperUnits.
plotSet:  Input
units:  Input units by which the margins, offset, and paper size are interpreted

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotCentered(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Boolean)
This method sets whether the plot will be centered. If true, the paper margins are automatically computed to position the plot in the center of the sheet.
plotSet:  Input
isCentered:  Input Boolean indicating whether the plot should be centered

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotWindowArea(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.Extents2d)
If a plot type of Window is selected, then these coordinates define the portion of the layout to plot. The arguments specify the two points in paperspace positioned on the output media.
plotSet:  Input
windowArea:  Input window coordinates

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotViewName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.String)
If a plot type of View is selected, then this string specifies a named view that in turn specifies what portion of the layout to plot.
plotSet:  Input
viewName:  Input named view indicating the portion of the layout to plot

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetUseStandardScale(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Boolean)
Determines whether the layout will use the StdScaleType property to calculate the current plot scale..
plotSet:  Input
useStandard:  Input Boolean indicating whether to use standard scale

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetCustomPrintScale(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.CustomScale)
This method sets the custom scale, a ratio of paperspace units to media units. The CustomPrintScale property stores the current scale (actually the numerator and denominator) for the plot settings for both "computed/standard" scales and "custom" scales. It always reflects the scale that will be used to plot.
plotSet:  Input
scale:  Input paperspace units

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetStdScale(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Double)
Sets the standard scale value as a floating point scale. Each enumerated value in the enum StdScaleType maps to a single floating point number. This method allows an application to specify a standard scale without having to do a table lookup to compute the scale value.
plotSet:  Input
standardScale:  Input standard scale value

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.GetPlotDeviceList
Returns a collection of all available plot devices found on the system This list is built only once per AutoCAD session. Call RefreshLists() if plot devices were added or removed from the system after starting the AutoCAD session.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.GetPlotStyleSheetList
Returns an array of all available plot style tables found on the system This list is built only once per AutoCAD session. Call RefreshLists() if plot style tables were added or removed from the system after starting the AutoCAD session.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetClosestMediaName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.PlotPaperUnit,System.Boolean)
For the configured plot device, sets the closest matching media size on the given PlotSettings object using the input criteria..
plotSet:  _nt_
paperWidth:  _nt_
paperHeight:  _nt_
units:  _nt_
matchPrintableArea:  _nt_