Autodesk.AutoCAD.DatabaseServices.XrefGraph.GetXrefNode(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns a pointer to the Terminator Block, if there is one. Otherwise it returns ObjectId.Null.
btrId:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object; Block table record ID to search for

Autodesk.AutoCAD.DatabaseServices.XrefGraph.MarkUnresolvedTrees
This method marks all unresolved xrefs and their nested xrefs with the GraphNode.UnresTree flag. It is really only effective on an xref graph which includes ghost references.