Autodesk.AutoCAD.Geometry.CubicSplineCurve2d
This .NET class wraps the AcGeCubicSplineCurve2d ObjectARX class. This class represent an interpolation cubic spline in 2D space.

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
Constructs an interpolation cubic spline going through the fit points. The constructed spline has start and end derivative specified by the input data.
fitPoints:  Input interpolating points
startDerivative:  Input derivative at the beginning of spline
endDerivative:  Input derivative at the end of spline

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an interpolation cubic spline going through the fit points within tolerance specified by the tolerance object. The constructed spline has start and end derivative specified by the input data.
fitPoints:  Input interpolating points
startDerivative:  Input derivative at the beginning of spline
endDerivative:  Input derivative at the end of spline
tolerance:  Input tolerance object

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection)
Constructs an interpolation cubic spline going through the fit points. The constructed spline is a closed curve.
fitPoints:  Input interpolating points

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an interpolation cubic spline going through the fit points within tolerance specified by the tol object. The constructed spline is a closed curve.
fitPoints:  Input interpolating points
tolerance:  Input tolerance object

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.#ctor
Default constructor. Initializes with an empty points list.