Autodesk.AutoCAD.Geometry.Cone.#ctor
Default constructor. Initializes the sineAngle to -sin(Pi/4), the cosineAngle to cos(Pi/4), the axis of symmetry to (0,1,0), the reference axis to (1,0,0), the baseOrigin to (0,0,0), and the base radius to 2.0.

Autodesk.AutoCAD.Geometry.Cone.BaseRadius
Returns radius of the base.