Autodesk.AutoCAD.DatabaseServices.RadialDimension.#ctor
Default constructor. Initializes the center and chord points to (0,0,0), and the leader length to 0.0. In addition, all the initializations of the default constructor for Dimension, Entity, etc. are performed.