Autodesk.AutoCAD.Runtime.Interop.CheckAdsForCancel(System.Int32)
This method returns true if returnValue is RTNORM or RTNONE, or false if it is RTCAN. If returnValue is any other value, this method throws an eInvalidInput exception.
returnValue:  Input System.Int32 object.