Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.LoadApplication(System.String,Autodesk.AutoCAD.DatabaseServices.ApplicationLoadReasons,System.Boolean,System.Boolean)
The default implementation of this method simply calls DynamicLinker.LoadApp(). The arguments are equivalent and are passed unchanged..
appName:  Input null-terminated string which is the application name (as set in the system registry) of the ObjectARX module to load
why:  Input LoadReasons values to use during this load
printIt:  Input Boolean indicating whether or not to print load status message
asCmd:  Input Boolean indicating whether to load the application as if by user command

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.GetUrl(System.String)
This method is the inverse of the isURL method. It provides a mapping from a local file to the corresponding URL that the file was downloaded from.
localFile:  Input local file

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.GetRemoteFile(System.Uri,System.Boolean)
This method returns the resource (file) identified by the URL url. The Boolean argument ignoreCache determines whether the file should be downloaded even if it has already been transferred earlier in the session..
url:  Input URL
ignoreCache:  Input Boolean indicating whether to download the file even if it has be cached earlier in the session

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.IsCloudFile(System.String)
Determine whether a given string is a valid Cloud file.
filePath:  Input cloud file.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.FatalError(System.String)
The database calls FatalError() when it encounters a fatal error. There is a default implementation that will put the string into the acdb.err error file, and call exit(0) to terminate your application.
message:  The error message.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.MachineRegistryProductRootKey
Use this function to obtain registry root for storing/retrieving product specific data. This location is generally read-only for limited users.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.releaseMarketVersion
This value is primarily used in User Interface. It is the year displayed after the product name, as in "AutoCAD 2013.".

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.WorkingDatabase
Accesses the primary database open in whichever document (window) has focus. In other host applications, the meaning of working database will be application-defined.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.AllUsersRootFolder
Returns the full path to the AutoCAD all users folder where the files shared by all users were installed. The default implementation is to return the directory where the EXE is located. This method can be overridden by DBX applications for their own install structure.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.FontMapFileName
Accesses the name of the fontmap file. The fontmap file is a file containing a list of font names and substitute fonts to use in place of the named fonts.