Autodesk.AutoCAD.Geometry.OffsetCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Constructs an offset curve that is an exact offset of the specified base curve. The direction of offset is determined by the sign of the offsetDistance parameter and by the direction of planeNormal. The base curve must be planar and planeNormal must be perpendicular to the plane of the base curve.
baseCurve:  Input base curve
planeNormal:  Input plane normal
offsetDistance:  Input offset distance

Autodesk.AutoCAD.Geometry.OffsetCurve3d.Transformation
Returns transformation matrix that was applied to this curve by calling transformBy(). If transformBy() has never been called for this curve, the returned matrix will be the identity matrix. If transformBy() has been called more than once, the returned matrix will be the concatenation of all of the transformation matrices.