Autodesk.AutoCAD.DatabaseServices.DataTable.SetRowAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCellCollection,System.Boolean)
This function replaces the row at the specified index ..
index:  Row index of the row to be replaced
row:  New row of data
validate:  Validation flag

Autodesk.AutoCAD.DatabaseServices.DataTable.AppendRow(Autodesk.AutoCAD.DatabaseServices.DataCellCollection,System.Boolean)
This method appends a row to the end of the table..
row:  Row being added
validate:  Validation flag