Autodesk.AutoCAD.Geometry.ClipCondition
This .NET enum wraps the AcGe::ClipCondition ObjectARX enum. It gives information about the spatial relationship between the input polygon and the clip boundary.