Autodesk.AutoCAD.DatabaseServices.LayerStateManager.ImportLayerState(System.String)
ImportLayerState() reads the passed-in filename (saved by a previous export) and extracts layer states to import. If an import file layer state has the same name as a layer state already existing in the drawing, the imported layer state is ignored. If an import file layer state name is not found in the drawing, it is created in the drawing. If any newly-created layer states refer to layers which are nonexistent in the drawing, the layers are created using default settings.
fileName:  Input file to extract layer states from

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.ExportLayerState(System.String,System.String)
ExportLayerState() reads the passed-in layer state name and exports the corresponding layer state to the export file. The layer state name must be passed with a single 0 after the name.
nameToExport:  Input layer state name to export
fileName:  Input filename to export layer state to

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.SaveLayerState(System.String,Autodesk.AutoCAD.DatabaseServices.LayerStateMasks,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Saves the current state of the layer table to the layer state specified by name. This function also captures the VPLAYER settings for the viewport specified. Specify Null for the id argument to capture a layer state without VPLAYER settings.
name:  Input name of layer state to save
mask:  Input mask to apply to layer state
id:  Input object ID of the viewport whose VPLAYER setting is to be captured

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.RestoreLayerState(System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32,Autodesk.AutoCAD.DatabaseServices.LayerStateMasks)
Restores the layer state name and the VPLAYER settings for the viewport specified. Also restores attributes specified in clientMask.
name:  Input name of layer state to make current
id:  Input object ID of the viewport whose VPLAYER setting is to be updated with the viewport data stored
undefinedLayerStatePolicy:  Input value that indicates whether to handle undefined layers
clientMask:  Input layer attribute mask

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LayerStateHasViewportData(System.String)
Returns a Boolean indicating whether the given layer state has viewport data associated with it. A layer state has viewport data if SaveLayerState() was called with a non-null id parameter.
name:  Input layer state to be interrogated

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.ImportLayerStateFromDb(System.String,Autodesk.AutoCAD.DatabaseServices.Database)
Imports the layer state name passed in name from the open drawing file pointer passed in database. This method will also import linetypes, materials and plot styles that are saved in the imported layer state but are missing in the current drawing. This method allows importing of layer states directly from drawing files rather than having to export to an .LAS file format in order to import a layer state.
name:  Input the name of the layer state to be imported
database:  Input a pointer to a valid, readable database from which the layer state is to be imported.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.CompareLayerStateToDb(System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Compares the layer values saved in a layer state to the current layer values in the drawing. This method compares everything except layer description. This method can also use VPLAYER and override settings of a viewport for comparison of visibility and overridable properties. Specify Null for the idVp argument to ignore viewport settings.
name:  Input name of layer state to be compared to the drawing.
idVp:  Input object ID of the viewport whose VPLAYER settings are to be used when comparing.