Autodesk.AutoCAD.DatabaseServices.UnderlayReference.SetClipBoundary(Autodesk.AutoCAD.Geometry.Point2d[])
Sets the clip boundary of the underlay. The boundary is defined in model coordinates. (i.e. Given WCS points one must use the inverse of the transformation matrix return by Transform to obtain points that can be passed to this function.).
points:  Input the clip boundary. An array describing a self intersecting polyline is not allowed. An array of two points is allowed and is treated as the minimum, maximum point of a rectangle.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.GetClipBoundary
Returns an array of points that specify the clip boundary of the underlay. The boundary is defined in model coordinates. You must use the transformation matrix returned by the transform()function to obtain WCS points.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Transform
Gets the transformation matrix from the underlay coordinate system to the world coordinate system (or block space coordinates if the underlay is part of a block). the transformation is defined by position()>, normal(), and rotation().

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.AdjustColorForBackground
Sets or returns a Boolean indicating whether the underlay content is adjusted for the current background color. Not all underlay types observe this setting.