Autodesk.AutoCAD.Geometry.KnotCollection.Split(System.Double,System.Int32,System.Int32)
Splits knot sequence at the specified parameter value. The knot at the end of the first piece and at the beginning of the second piece is inserted or deleted to satisfy the input multiplicity values.
parameter:  Input split parameter
multiplicityLast:  Input multiplicity of the last knot in the head fraction.
multiplicityFirst:  Input multiplicity of the first knot in the tail fraction