Autodesk.AutoCAD.Geometry.BoundedPlane
This .NET class wraps the AcGeBoundedPlane ObjectARX class. It represents a bounded planar parametric surface.

Autodesk.AutoCAD.Geometry.BoundedPlane.IntersectWith(Autodesk.AutoCAD.Geometry.BoundedPlane,Autodesk.AutoCAD.Geometry.Tolerance)
Returns flag indicating if there is any segment intersection. Computes a segment of intersection with another bounded plane.
plane:  Input bounded plane
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.BoundedPlane.IntersectWith(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Tolerance)
Returns flag indicating if a segment intersection takes place. Computes intersection with infinite non-parametric plane.
plane:  Input bounded plane
tolerance:  Input Autodesk.AutoCAD.Geometry.Tolerance object.