Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Add(Autodesk.AutoCAD.DatabaseServices.DataCell)
Adds the object represented by value to this collection. Returns the zero-based index of the newly added collection item.
value:  Input Autodesk.AutoCAD.DatabaseServices.DataCell object