Autodesk.AutoCAD.Geometry.BoundBlock3d.Contains(Autodesk.AutoCAD.Geometry.Point3d)
Returns true if the point belongs to the block. Returns false otherwise.
pointToTest:  Input point to test whether the point belongs to the block

Autodesk.AutoCAD.Geometry.BoundBlock3d.IsDisjoint(Autodesk.AutoCAD.Geometry.BoundBlock3d)
Returns true if the input block does not intersect with this block. Returns false otherwise.
block:  Input another Autodesk.AutoCAD.Geometry.BoundBlock3d object.

Autodesk.AutoCAD.Geometry.BoundBlock3d.IsBox
Returns true if the block is a coordinate box. Returns false otherwise.