Autodesk.AutoCAD.DatabaseServices.ConstrainedSpline.DefinePointAt(System.Int32)
Returns the define point of the constrained spline. Relative to the work plane of the owning Assoc2dConstraintGroup object.
index:  Input the index.