Autodesk.AutoCAD.DatabaseServices.GeometryOverrule.SetXDataFilter(System.String)
Enables the use of xdata in determining whether overrules apply. Use this method when you want AutoCAD to look for xdata with registeredApplicationName on the overruled subject before calling any of your overrules.
registeredApplicationName:  Input the name of the registered application.