Autodesk.AutoCAD.GraphicsInterface.Drawable.IsPersistent
Returns true if the Drawable object is database resident (belongs to an Model that requires the use of open and close functions). Returns false if the Drawable object is non-persistent (pointer-based); these drawables are accessed directly through their Drawable pointer.

Autodesk.AutoCAD.GraphicsInterface.Drawable.Bounds
Accesses the bounds of the drawable, if available. Returns null if the drawable does not have bounds or the bounds cannot be computed.