Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters.CopyFrom(Autodesk.AutoCAD.Runtime.RXObject)
This .NET method wraps the ObjectARX method. Copies member data from source object.

Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters.op_Equality(Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters,Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters)
This .NET method wraps the ObjectARX method. Compares and determines if two entities are equal to each other.

Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters,Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters)
This .NET method wraps the ObjectARX method. This is the comparison operator for this class.