Autodesk.AutoCAD.DatabaseServices.AssocDependency
AssocDependencies represent information about which AssocActions depend on or modify which DBObjects. This is how the associativity in the drawing is represented. Dependencies are owned by actions and are attached to the objects as persistent reactors. When the dependent-on object changes, it notifies the dependency via the persistent reactor mechanism. The dependency checks whether the change is relevant, such as when the dependency is on an endpoint of a line but the color of the line changed, or the other endpoint changed, and if yes, it changes its status indicating that it needs to be evaluated, and also changes the status of the owning action indicating that it needs to be evaluated (and the action changes the status of the AssocNetwork that owns it).

Autodesk.AutoCAD.DatabaseServices.AssocDependency.SetStatus(Autodesk.AutoCAD.DatabaseServices.AssocStatus,System.Boolean)
Sets the AssocStatus of the dependency. If the status is one of the codes that indicate that the action owning the dependency will need to be evaluated (the IsEvaluationRequest() predicate returns true for such a status), it can also notify the action owning the dependency to change its status indicating that it needs to be evaluated. The action may change its status and notify the network owning the action. The network may change its status and notify its owning network, etc. until all the networks in the hierarchy are notified that they contain an action that needs to be evaluated..
newStatus:  The new AssocStatus of the dependency.
notifyOwningAction:  If true, and the passed-in status indicates that the dependency needs to be evaluated, the status of the AssocAction owning this dependency is set to the same status (unless the action evaluation status is already more severe than the new one). The action then notifies its owning network.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.AttachToObject(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId)
Attaches this dependency to a given CompoundObjectId as a persistent reactor and also orders it to be at the correct position in the list of dependencies on the object, based on the dependency order(). The dependency that is being attached must not be currently attached to any object.
compoundId:  The CompoundObjectId to attach the dependency to. If regular ObjectId is passed in, it is automatically converted to CompoundObjectId.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.DetachFromObject
Detaches this dependency from the DBObject it is currently attached to. It also detatches it from the list of persistent reactors of the dependent-on-object, and if the dependency is on a compound object, it detaches this dependency from the persistent reactor lists of all objects the dependency is currently attached to.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.UpdateDependentOnObject
Updates the object the dependency depends on, based on the information the dependency obtains from the owning action. If the dependency owns an AssocDependencyBody object, its UpdateDependentOnObject() method is called, otherwise the default implementation of this method does nothing.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.GetFirstDependencyOnObject(Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets the first dependency on the given DBObject. Dependencies are attached to DBObjects in the form of persistent reactors and are ordered on the object based on their Order(). The first dependency in this ordered list is returned.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.NotifyDependenciesOnObject(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.AssocStatus)
Gets all dependencies on the given DBObject and notifies them about a change by setting their status. It notifies both the primary dependencies on the object (when the object is the DependentOnObject() of the dependency) as well as secondary dependencies (when the object is one of the objects in the CompoundObjectId of the dependency).
newStatus:  The new status to be set to the dependencies.
object:  The DBObject whose dependencies are to be notified. The object needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Compares this dependency with the given dependency and returns true if and only if they are equal (whatever it means). Both dependencies need be open at least for read.
otherDependency:  The other dependency needs to be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.Evaluate
Called by the AssocAction.EvaluateDependencies() to update the "dirty" dependencies of the action. The custom dependency classes can implement code to cache the dependent-on data in order to allow filtering-out irrelevant notifications, or do some other work.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.DependencyBody
Gets and sets the ObjectId of an object of a class derived from AssocDependencyBody, or a null id if no dependency body object has been set. The AssocDependencyBody object is owned by this AssocDependency object and implements the body of the custom dependency. See the comments at the AssocDependencyBody class for more information.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsReadDependency
Sets and gets the IsReadDependency property. True indicates the AssocAction owning the dependency uses the value of the dependent-on DBObject.The default value is false.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsWriteDependency
Sets and gets the IsWriteDependency property. True indicates the AssocAction owning the dependency changes the value of the dependent-on DBObject.The default value of this flag is false.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.Order
Gets and sets the order of the dependency, i.e., the order where it should be positioned in the list of all dependencies on an DBObject. Dependencies with lower Order() are positioned in the list before the dependencies with higher Order(). Dependencies with the same Order() are ordered based on how they were added to the object, the dependencies added later are positioned after the dependencies added earlier.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.DependentOnCompoundObject
A dependency is attached as a persistent reactors to all objects of the CompoundObjectId. If the dependency does not use CompoundObjectId, the returned CompoundObjectId is of the DependentOnObject() converted to an CompoundObjectId.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsDelegatingToOwningAction
Gets and sets whether some dependency methods delegate to the action that owns the dependency if the method is not directly implemented in the dependency or in the AssocDependencyBody object that the dependency may own. The default is true, i.e., the delegation takes place. Examples of dependency methods that perform the delegation to the owning action are methods like IsRelevantChange(), HasCachedValue(), IsEqualTo(), IsDependentOnTheSameThingAs(), Evaluate(), etc.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.HasCachedValue
Indicates whether the dependency currently holds the cached value of the "thing" it depends on. It does not necessarily mean that the cached value is current and the same as the current value of the dependent-on "thing". If the thing changed, the cached value the dependency holds may still be the previously cached value. But if the dependency status is IsUpToDateAssocStatus, the cached value should be in sync with the "thing" the dependency depends on.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsRelevantChange
This property indicates whether the dependent-on "thing" really changed in such a way that the change is relevant to this particular dependency type. For example, if the dependency is on a subentity of a geometric entity, it should check whether the geometry of this subentity is really different from what it was before (such as by comparing it with the cached geometry).

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsDependentOnObjectReadOnly
Indicates whether the dependent on object is read-only, i.e., the object is not allowed to be changed. The default implementation returns true if the dependent-on object is an Entity on locked layer, otherwise it returns false.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.CurrentEvaluationCallback
Gets the current AssocEvaluationCallback set by the AssocAction.Evaluate() call, or NULL if no action evaluation is in progress. Notice that when action evaluation is in progress, there always is a non-NULL AssocEvaluationCallback.