Autodesk.AutoCAD.DatabaseServices.LineWeightConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)
This method is used to convert a string to a LineWeight value. It attempts to interpret value as a System.String object. If successful, it attempts to find a matching string in the LineWeight enum. If a match is found, this method returns the matching LineWeight value. If no match is found, this method throws a FormatException exception. If value cannot be cast to a System.String object, this method calls the superclass version of this method.
context:  Input context within which to handle value
culture:  Input culture within which to handle value
value:  Input value to process