Autodesk.AutoCAD.DatabaseServices.LoftOptions.DraftStart
Accesses the start draft angle in radians. This is the surface take-off direction at the first cross section. The default value of this option is 0, which indicates that no draft angle is defined and the system will compute the optimum angle at the first cross section.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.DraftEnd
Accesses the end draft angle in radians. This is the surface take-off direction at the last cross section. The default value of this option is 0, which indicates that no draft angle is defined and the system will compute the optimum angle at the last cross section.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.DraftStartMag
Accesses the start draft magnitude. Controls the magnitude of the surface tangent vector at the first cross-section. The default value of this option is 0, which means that the system will compute the optimum magnitude.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.DraftEndMag
Accesses the end draft magnitude. Controls the magnitude of the surface tangent vector at the last cross-section. The default value of this option is 0, which means that the system will compute the optimum magnitude.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.NoTwist
Accesses the value of the noTwist option. This option can be used to minimize the amount of twist in the resulting surface or solid when the cross-sections are all closed. The default value of this option is true. If this option is set then the start point of each closed cross-section is aligned with the other cross-sections to minimize twist.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.AlignDirection
Accesses the value of the AlignDirection option. This option can be used to orient each of the cross sections so that the normal vector of each cross section points towards the next cross section. The default value of this option is true. If the cross sections are not all oriented in the same direction, then this option should be used to avoid creating a twisted or self-intersecting surface or solid.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.Simplify
Accesses the value of the simplify option. If this option is set, then simple surface types (plane, cylinder, cone, sphere, or torus) will be created whenever all of the cross sections lie on such a surface. Otherwise a general surface type will be created. The default value of this option is true.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.Ruled
Accesses the value of the ruled option. If this option is set then a ruled surface will be created between each pair of cross sections rather than a single smooth surface. This will result in a much coarser object. The default value of this option is false.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.NormalOption
Accesses the plane normal option. See LoftOptionsNormalOption for a description of possible values. The default value of this option is NoNormal.