Autodesk.AutoCAD.Geometry.PlanarEntity.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true, if the plane of this planar entity and linear entity linearEntity are perpendicular within the tolerance tolerance. Returns false otherwise.
linearEntity:  Input linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true, if the plane of this planar entity and the plane of the planar entity linearEntity are perpendicular within the tolerance tolerance. Returns false otherwise.
linearEntity:  Input linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.IsParallelTo(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the plane of this planar entity and the plane of the planar entity otherPlanarEntity are parallel within the tolerance tolerance. Returns false otherwise.
otherPlanarEntity:  Input other planar entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this planar entity intersects the linear entity linearEntity. In this case the function returns the point within the tolerance from the intersection point. If there is no intersection, the return value of the function is false.
linearEntity:  Input linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.ClosestPointToLinearEntity(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Evaluates the pair of closest points between this planar entity and the linear entity line. The point on this planar entity is returned as a return value of the function. Points are evaluated with a tolerance.
line:  Input any LinearEntity3d object
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.ClosestPointToPlanarEntity(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Evaluates the pair of closest points between this planar entity and the planar entity otherPlane. The point on this planar entity is returned as a return value of the function. Points are evaluated with a tolerance.
otherPlane:  Input any PlanarEntity object
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.IsCoplanarTo(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the plane of this planar entity and the plane of the planar entity otherPlanarEntity are equal within the tolerance tolerance. Returns false otherwise.
otherPlanarEntity:  Input other planar entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.Normal
Returns the unit normal to the plane of this planar entity. One of the two possible directions of the normal is set according to functions isNormalReversed and reverseNormal of the class Surface.