Autodesk.AutoCAD.DatabaseServices.NurbsData.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.NurbsData.Periodic
Assesses if the spline is periodic. A periodic spline is a spline with period T such that the point at parameter t + T is equal to the point at parameter t for any value of t.