Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.MoveNext
This function attempts to advance the iterator one entry in the dictionary. If another entry is found, it returns true; otherwise, it returns false.