Autodesk.AutoCAD.DatabaseServices.RasterVariables.ImageQuality
Accesses the current image display quality setting. The Image Quality setting allows users to trade display speed for displayed image quality. In draft mode, fast low-quality image resampling and processing algorithms are used. In high quality mode, more computationally intensive algorithms are used, which usually generate more accurate and visually pleasing output.