Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.#ctor(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Double)
Parameterized constructor. The angle, which stands for angle between, is measured in degrees.