Autodesk.AutoCAD.DatabaseServices.XrefObjectId.IsValid
This returns true if the xref is loaded and the handle is valid within that xref. This method actually performs the check and does not rely on a cached value.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.IsXref
Read-only.