Autodesk.AutoCAD.DatabaseServices.ProxyEntity.GetReferences
This function appends to the ids array all reference objectIds in the data of the custom entity contained in the proxy. The types array have the corresponding reference type DXF group code numbers for the objectIds in the ids array. For example, if the ids[3] element is a hard pointer ID, then types[3] will be HardPointerId (integer value 340).

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.OriginalClassName
Accesses the string that is the C++ class name of the custom object stored in the proxy. NULL is returned, if the operation fails.

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.ApplicationDescription
Accesses the string that represents the application description of the class stored within the proxy entity. This string is the last argument in the ACRX_DXF_DEFINE_MEMBERS macro used for the class of the entity contained in the proxy.