Autodesk.AutoCAD.Geometry.LinearEntity3d
This .NET class wraps the AcGeLinearEnt3d ObjectARX class. This is an abstract base class for all 3D line classes.

Autodesk.AutoCAD.Geometry.LinearEntity3d.ProjectedIntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the points on the two lines which project into the same point when projected onto a plane whose normal is projectionDirection. This function is mainly used by graphics where projectionDirection is the line of sight. In this case, this function returns the points on the two lines where the lines appear to intersect. If the lines do not actually intersect, then the vector between the two points is parallel to projectionDirection.
line:  Input any 3D linear entity
projectionDirection:  Input direction of projection
tolerance:  Input Autodesk.AutoCAD.Geometry.Tolerance object.

Autodesk.AutoCAD.Geometry.LinearEntity3d.Overlap(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines overlap and if so returns the line that coincides with their region of overlap. The returned overlap line may be an object of any derived class of LinearEnt3d, depending on the types of the two lines.
line:  Input any 3D linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity3d.GetLine
Returns an infinite line that is coincident with this line. This function can be called for LineSeg3d and Ray3d objects to get an infinite line from a bounded line.

Autodesk.AutoCAD.Geometry.LinearEntity3d.Direction
Returns direction vector of line. This vector is a unit vector and points in the direction of increasing parameter value.