Autodesk.AutoCAD.DatabaseServices.AssocAction
Any object that wants to exhibit associative behavior, i.e. be automatically evaluated by the associative mechanism when objects it depends on change, needs to be derived from an AssocActionBody class (see comments at the AssocActionBody class) and owned by a parent AssocAction object. The action body is fully owned by its parent action, such as when the parent action is erased, it also erases the owned action body.

Autodesk.AutoCAD.DatabaseServices.AssocAction.SetStatus(Autodesk.AutoCAD.DatabaseServices.AssocStatus,System.Boolean,System.Boolean)
Sets the AssocStatus of the action. If the status is one of the codes that indicate that the action will need to be evaluated (the IsEvaluationRequest() predicate returns true for such a status), but the current status of the action is not that it would need to be evaluated, it propagates this status up to the AssocNetwork owning the action, and higher in the network hierarchy to the network owning this network, etc, so that all owning networks know that they contain an action that needs to be evaluated..
newStatus:  The new AssocStatus of the action.
notifyOwningNetwork:  If true, and the passed-in status indicates that the action needs to be evaluated, the status of the AssocNetwork owning this dependency is set to the same status (unless the network evaluation status is already more severe than the new one).
setInOwnedActions:  If true, and this action owns some other actions (such as AssocNetwork owns actions), the status is also set in all owned actions (both directly owned and recursively owned).

Autodesk.AutoCAD.DatabaseServices.AssocAction.SetOwningNetwork(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Every action except for the topmost AssocNetwork is logically owned by a single AssocNetwork..
networkId:  The AssocNetwork logically owning this action.
alsoSetAsDatabaseOwner:  Make the network the database owner of this action.

Autodesk.AutoCAD.DatabaseServices.AssocAction.GetDependencies(System.Boolean,System.Boolean)
Gets AssocDependencies of this action. The default implementation obtains all dependencies owned by the base action class and selects the ones based on the required read/write type..
readDependenciesWanted:  Read-type dependencies wanted.
writeDependenciesWanted:  Write-type dependencies wanted.

Autodesk.AutoCAD.DatabaseServices.AssocAction.RemoveAllDependencies(System.Boolean)
Removes all AssocDependencies kept in the vector of dependencies of this action and optionally also erases them..
alsoEraseThem:  Erase the AssocDependencies after removing them.

Autodesk.AutoCAD.DatabaseServices.AssocAction.GetDependentObjects(System.Boolean,System.Boolean)
Gets objects that this action depends on or modifies. The default implementation collects all objects on which the action has AssocDependencies..
readDependenciesWanted:  Dependent-on objects wanted.
writeDependenciesWanted:  Modified objects wanted.

Autodesk.AutoCAD.DatabaseServices.AssocAction.IsExternalDependency(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Checks whether the given AssocDependency, owned by this action, is external to this action, i.e., it depends on an DBObject that is not this action and is not owned by this action (when the action is a network). Also, when the dependency does not depend on any object, it is considered external.
dependency:  The dependency that is checked whether it is external. Needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.IsRelevantDependencyChange(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Delegated from the owned dependency's AssocDependency.IsRelevantChange() predicate. It allows the owning action, instead of the dependency itself, to decide whether the object change is relevant to that particular dependency. The default implementation just returns true.
dependency:  The dependency that is checked whether the change in the object it depends on is relevant or not. It needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.HasDependencyCachedValue(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Delegated from the owned dependency's AssocDependency.HasCachedValue() predicate. It allows the owning action, instead of the dependency itself, to decide whether the dependency has a cached value. The default implementation just returns false.
dependency:  The dependency that is checked whether it has cached value. It needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.AreDependenciesOnTheSameThing(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Delegated from the owned dependency's AssocDependency.IsDependentOnTheSameThingAs() predicate. It allows the owning action, instead of the dependency itself, to decide whether the two depedencies depend on the same thing. The default implementation just returns true.
dependency1:  The dependency owned by this action. It needs to be open at least for read.
dependency2:  Another dependency. It needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.AreDependenciesEqual(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Delegated from he owned dependency's AssocDependency.isEqualTo() predicate. It allows the owning action, instead of the dependency itself, to decide whether the two dependencies are equal. The default implementation just returns false.
dependency1:  The dependency owned by this action. It needs to be open at least for read.
dependency2:  Another dependency. It needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.DependentObjectCloned(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.DBObject)
Called from the owned dependency's AssocDependency.copied() persistent reactor callback. It notifies the owning action about the fact that an object the action has a dependency on has been cloned. The cloning may be just shallow clone, not necessarily deep or wblock clone.
dependency:  The AssocDependency on the DBObject that has been cloned.
dbObj:  The original object.
newObj:  The newly created clone.

Autodesk.AutoCAD.DatabaseServices.AssocAction.PostProcessAfterDeepClone(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Called from a reactor notification method (ids of the clones have already been translated) to inform the source actions that they have been cloned, so that they can update the clones or do some other work that it needed. Notice that the source action can obtain its clone by consulting the provided IdMapping.
idMap:  The IdMapping of the current deep cloning session.

Autodesk.AutoCAD.DatabaseServices.AssocAction.PostProcessAfterDeepCloneCancel(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Called from a reactor notification method. Notice that the source action can obtain its clone by consulting the provided IdMapping.
idMap:  The IdMapping of the current deep cloning session.

Autodesk.AutoCAD.DatabaseServices.AssocAction.EvaluateDependencies
This method needs to be called from the client code evaluateOverride() method, usually after the client code inspected the dependencies, found which changed, which were on erased objects, etc. It gets all dependencies of the action and evaluates the ones that need to be evaluated, i.e. dependencies for which IsEvaluationRequest() == true.

Autodesk.AutoCAD.DatabaseServices.AssocAction.EvaluateDependency(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Delegated from the owned dependency's AssocDependency.evaluateOverride() method. It allows the owning action, instead of the dependency itself, to do the work. The default implementation just sets the dependency status to IsUpToDateAssocStatus.
dependency:  The dependency that is to be evaluated. It needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.OwnedDependencyStatusChanged(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.AssocStatus)
This callback is called from AssocDependency.SetStatus(..., true) and notifies the action owning the dependency that the status of the dependency has just been changed. The dependency is still open for write and already has the new status.
ownedDependency:  The dependency whose status has just been changed.
previousStatus:  Previous status of the dependency.

Autodesk.AutoCAD.DatabaseServices.AssocAction.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.AssocAction)
Compares this action with the given action and returns true if and only if they are equal (whatever it means). Both actions need to be open at least for read.
otherAction:  The other action needs to be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.GetDependentActionsToEvaluate(Autodesk.AutoCAD.DatabaseServices.ActionsToEvaluateCallback)
Lets the action report all other actions that need to be evaluated because this action is evaluated. It is repeatedly used to transitively collect all actions that need to be evaluated, before an associative network is evaluated. This action needs to be open at least for read and it needs to require to be evaluated: IsEvaluationRequest() == true.
actionsToEvaluateCallback:  The method uses this callback to report other AssocActions, AssocDependencies and arbitrary DBObjects that should also be scheduled to evaluate when this action is evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocAction.Evaluate(Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback)
This method is called by the client code to evaluate an action or an associative network. It is the crux of the whole associative mechanism.
evaluationCallback:  While the action is being evaluated, it calls methods of the callback object to inform the client code about the evaluation. The callback reference must not be NULL. See the definition of AssocEvaluationCallback for more details.

Autodesk.AutoCAD.DatabaseServices.AssocAction.ObjectThatOwnsNetworkInstance
Starting from this AssocAction, checks this AssocAction and its owners (in "physical" AutoCAD database object owhership sense) until an AssocNetwork is encountered whose "database" owner is not another AssocNetwork. Then finds an inverse of AssocNetwork.GetInstanceFromObject(), i.e., it finds the DBObject for which GetInstanceFromObject() method returns the AssocNetwork.

Autodesk.AutoCAD.DatabaseServices.AssocAction.ActionBody
Gets and sets the ObjectId of an object of a class derived from AssocActionBody, or null if no action body object has been set. The AssocActionBody object is owned by this AssocAction object and implements the body of the custom action. See more information see AssocActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocAction.CurrentEvaluationCallback
Gets the current AssocEvaluationCallback set by the AssocAction.evaluate() call, or NULL if no action evaluation is in progress. Notice that when action evaluation is in progress, there is always a non-NULL AssocEvaluationCallback.