Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.LineTypeScale
The scaling factor of linetype can be varied by this trait. A value of 1.0 is the standard scaling, 2.0 will cause the linetype dashes to be twice as long and a value of 0.5 will reduce them to half their normal length.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Thickness
Thickness is an extrusion in WCS units along the positive Z axis. The extrusion vector is calculated as (Z*dthickness) * modelTransform. It only affects selected primitives: as pline, polyline, arc, circle and shx text.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Sectionable
Returns true if the graphics primitives drawn with this object will participate in sectioning. Returns false if the graphics primitives will not be affected by sectioning operations.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.DrawFlags
Returns the current draw flags value. The default is kNoDrawFlags.