Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations
This class contains SurfaceSurfaceIntersectorConfiguration objects that describe the left and right surface configuration data for each of two intersecting surfaces. An object of this class is returned by the SurfaceSurfaceIntersector.GetIntersectionConfigurations method.