Autodesk.AutoCAD.DatabaseServices.ViewBorder.#ctor
This .NET method wraps the ObjectARX method. For internal use only.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.InsertionPoint
Gets the center of the view border in WCS coordinates (in paperspace). Return value is Autodesk.AutoCAD.Geometry.Point3d.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.Height
Gets the height of the model documentation view border. Return value is double.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.Width
Gets the width of the model documentation view border. Return value is double.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.InventorFileReference
This method wraps AcDbViewBorder::inventorFileReference method. Return value is String.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.IsFirstAngleProjection
to indicate whether the projection type is first angle or third angle. Return value is bool.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.ViewportId
This method returns the ObjectID of the associated model documentation view's Viewport entity.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.RotationAngle
Gets the rotation angle (in radians) of the model documentation view in the viewport. The rotation angle is a rotation around the view's line of sight (that is, the vector from camera to target, which is always perpendicular to the display, looking from the front of the display toward the back). The zero angle is horizontally to the right (that is, the display coordinate system's positive X axis). Return value is double, in radians.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.Scale
Gets the scale used by the model documentation view. The scale defines the relationship of units in paperspace to units in model space of the viewport. For example, a scale of 0.5 would indicate that 1 unit in the model space of the viewport maps to 0.5 units in paperspace. Return value is double.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.ShadedDPI
Gets the DPI of the image generated for the shaded view style. Return value is System::UInt32.