Autodesk.AutoCAD.DatabaseServices.DgnUnderlayItem
This .NET class wraps the AcDbDgnUnderlayItem ObjectARX class. It represents underlay items.

Autodesk.AutoCAD.DatabaseServices.DgnUnderlayItem.UseMasterUnits
Assesses whether the underlay uses master units in the DGN file when the DGN file is being translated to DWG for the underlay to use. If master units are not used, then subunits are used.