Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.Dimension
Accesses the dynamic dimension object. It returns null if the application does not create a dynamic dimension and set the pointer.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.Editable
Assesses if the object is editable. An editable dynamic dimension can be either an active or potential type. An informational type of dynamic dimension is not editable.