Autodesk.AutoCAD.DatabaseServices.Extents3d.ExpandBy(Autodesk.AutoCAD.Geometry.Vector3d)
Expand this box by the amount in the vector. This could be used for objects with a constant thickness, for example. You would accumulate the basic box by iterating through the object's points calling AddPoint(), then you would make a single ExpandBy() call to expand that box by the thickness amount.
vector:  Input 3D vector

Autodesk.AutoCAD.DatabaseServices.Extents3d.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Extents3d)
This method returns a value indicating whether the minimum and maximum points of a are equivalent to those of this object. Tolerance is set to Global for this overload.
a:  Input object to compare

Autodesk.AutoCAD.DatabaseServices.Extents3d.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.Extents3d.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider, displayed with a specific format. See the Microsoft .NET API documentation for details.
format:  Input format to display
provider:  Input culture-specific format

Autodesk.AutoCAD.DatabaseServices.Extents3d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
provider:  Input culture-specific format

Autodesk.AutoCAD.DatabaseServices.Extents3d.ToString
Returns an equivalent string representation of this object. See the Microsoft .NET API documentation for details.