Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.EvaluateOverride
Called from the corresponding method of the parent AssocDependency class that owns this dependency body object. It has to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.UpdateDependentOnObjectOverride
Called from the corresponding method of the parent AssocDependency class that owns this dependency body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.IsDependentOnTheSameThingAsOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocDependency class that owns this dependency body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.IsEqualToOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocDependency class that owns this dependency body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.ModifiedOverride(Autodesk.AutoCAD.DatabaseServices.DBObject)
Called from the modified() persistent reactor callback method of the parent AssocDependency class that owns this dependency body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.ClonedOverride(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.DBObject)
Called from the copied() persistent reactor callback method of the parent AssocDependency class that owns this dependency body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.HasCachedValueOverride
Called from the corresponding method of the parent AssocDependency class that owns this dependency body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.IsRelevantChangeOverride
Called from the corresponding method of the parent AssocDependency class that owns this dependency body object. It does not need to be overridden.