Autodesk.AutoCAD.Runtime.Marshaler
This class provides utility methods for converting bitmaps and subentity paths between managed objects and unmanaged pointers. It is provided for developers who require interoperability between their own C++ objects and managed code.