Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.#ctor
Default constructor. Initializes the arc point and the extension line 1 & 2 start and end points all to (0,0,0). In addition, all the initializations of the default constructor for Dimension, Entity, etc., are performed.