Autodesk.AutoCAD.DatabaseServices.RasterImage.ImageSize(System.Boolean)
the raw image size in pixels. (The image size is also available directly from the RasterImageDef object.).
getCachedValue:  Input Boolean indicating whether the cached should be used

Autodesk.AutoCAD.DatabaseServices.RasterImage.SetClipBoundaryToWholeImage
Sets the clip boundary to coincide with the image borders. Any existing clip boundary is deleted.

Autodesk.AutoCAD.DatabaseServices.RasterImage.SetClipBoundary(Autodesk.AutoCAD.Geometry.Vector2d)
Specifies a polygonal clip boundary. The clip boundary must be closed, the last point being identical to the first point. The value of type must match the shape of the points in the array.
size:  Input vector of boundary

Autodesk.AutoCAD.DatabaseServices.RasterImage.GetClipBoundary
Returns a collection of clip boundary vertices in image pixel coordinates. Invert the PixelToModelTransform matrix to convert these to model coordinates.

Autodesk.AutoCAD.DatabaseServices.RasterImage.GetVertices
Returns the image frame vertices to it. These points represent either the four corners of the image, or if the image is clipped, the vertices of a polygonal clip boundary.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Orientation
Accesses the position and orientation of an image entity. These vectors lie along the outer edge of the unclipped image. The clipped image may be smaller than the rectangle specified by these vectors.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Scale
Accesses the effective XY scale factor for this image entity, expressed as image size in user units (as inserted and scaled into model space) divided by the original image size (derived from the image resolution specified in the image file.).