Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.NormalVector
This is Z-Axis of the clip space expressed in the compound object's coordinate system. Often this will be Vector3d.ZAxis.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.Point
This is the origin of the clip space expressed in the compound object's coordinate system. Often this will be Point3d.Origin.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.TransformInverseBlockRefXForm
This is the inverse of the transform that the compound object uses to transform its contents. For a block reference, this is based on the block insertion transform and the translation stored in the block table record.