Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBody
Wrapper AssocDimDependencyBody manages a Dimension entity that serves as the graphical representation of a dimensional constraint. It inherits common functionality from the AssocDimDependencyBodyBase class and overrides the base-class pure virtual methods in which it implements the Dimension-specific functionality.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBody.CreateAndPostToDatabase(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId&,Autodesk.AutoCAD.DatabaseServices.ObjectId&)
"Pseudo constructor". Creates a new AssocDependency object owning a new AssocDimDependencyBody object and makes the dependent-on object of the new dependency to be the provided Dimension. Posts both objects to the database of the Dimension.
dimId:  ObjectId of the Dimension.
dimDepId:  ObjectId of the created AssocDependency.
dimDepBodyId:  ObjectId of the created AssocDimDependencyBody.