Autodesk.AutoCAD.Geometry.LineSegment2d
This .NET class wraps the AcGeLineSeg2d ObjectARX class. It represents a bounded line segment in 2D space.

Autodesk.AutoCAD.Geometry.LineSegment2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Constructs a line segment whose start point is point and whose endpoint is point+vector. vector must not be a zero-length vector.
point:  Input start point of line segment
vector:  Input vector between endpoint and start point of line segment

Autodesk.AutoCAD.Geometry.LineSegment2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs a line segment between point1 and point2. point1 and point2 must not be the same point.
point1:  Input start point of line segment
point2:  Input end point of line segment

Autodesk.AutoCAD.Geometry.LineSegment2d.#ctor
Default constructor. Constructs a line segment between (0,0) and (1,0).

Autodesk.AutoCAD.Geometry.LineSegment2d.BaryComb(System.Double)
Returns the point that is the weighted average of the start point and endpoint of the line segment. If blendCoefficient is 0, this function returns the start point of the line segment. If blendCoefficient is 1, this function returns the endpoint of the line segment. If blendCoefficient is 0.5, this function returns the midpoint of the line segment. If blendCoefficient is between 0 and 1, the returned point lies on the line segment. Otherwise the returned point does not lie on the line segment, but lies on the unbounded line that is coincident with the line segment.
blendCoefficient:  Input any real number

Autodesk.AutoCAD.Geometry.LineSegment2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Point2d,System.Double)
Changes the definition of the line segment so that the line segment passes through the input point and is tangent to the input curve. On input, parameter is assumed to contain an initial guess value to the parameter of the tangent point. The output parameter success is set to true if the line segment was computed successfully.
curve:  Input any 2D curve
point:  Input any 2D point
parameter:  Input point on curve where line segment is tangent to curve

Autodesk.AutoCAD.Geometry.LineSegment2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,System.Double,System.Double)
Changes the definition of the line segment so that the line segment is tangent to the two input curves. On input, parameter1 and parameter2 are assumed to contain initial guess values to the parameters of the two tangent points. The output parameter success is set to true if the line segment was computed successfully.
curve1:  Input any 2D curve
curve2:  Input any 2D curve
parameter1:  Input point on curve1 where line segment is tangent to curve
parameter2:  Input point on curve2 where line segment is tangent to curve

Autodesk.AutoCAD.Geometry.LineSegment2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Changes the definition of the line segment so that the start point is point1 and the endpoint is point2. point1 and point2 must not be the same point.
point1:  Input start point of line segment
point2:  Input end point of line segment

Autodesk.AutoCAD.Geometry.LineSegment2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Changes the definition of the line segment so that the start point is point and the endpoint is point+vector. vector must not be a zero-length vector.
point:  Input start point of line segment
vector:  Input vector between endpoint and start point of line segment