Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.#ctor(Autodesk.AutoCAD.DatabaseServices.MLeaderStyle)
Copy constructor.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.MaxLeaderSegmentsPoints
Accesses the max number of leader segment points. When -1, there is no limit to segment points number.