Autodesk.AutoCAD.GraphicsInterface.SolidBackgroundTraits
This .NET class wraps the AcGiSolidBackgroundTraits ObjectARX class. Represents a solid background to the underlying display system. An instance of class is populated by SolidBackground through its SetAttributes method.