Autodesk.AutoCAD.GraphicsInterface.OrientationType
This .NET enum wraps the AcGiOrientationType ObjectARX enum. It gives the current orientation type for vertices. The orientation type indicates the direction the vertices in a mesh or shell appear to follow when viewed in order while looking down the normal axis towards any given vertex. Essentially the orientation type defines the normal's positive or negative direction at the vertices.