Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits
This .NET class wraps the AcGiRenderEnvironmentTraits ObjectARX class. It represents render environment (fog and environment map) to the underlying display system.