Autodesk.AutoCAD.ComponentModel.TypeDescriptor
This class implements Autodesk.AutoCAD.ComponentModel Classes.ITypeDescriptor, which provides methods for adding/removing properties as well as adding and removing per-instance PropertyProviders. There is a single instance for each type.