Autodesk.AutoCAD.Geometry.LinearEntity2d
This .NET class wraps the AcGeLinearEnt2d ObjectARX class. It's an abstract base class for all 2D line classes.

Autodesk.AutoCAD.Geometry.LinearEntity2d.Overlap(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines overlap and if so returns the line that coincides with their region of overlap. The returned overlap line may be an object of any derived class of LinearEnt2d, depending on the types of the two lines.
line:  Input any 2D linear entity
tolerance:  Input Autodesk.AutoCAD.Geometry.Tolerance object.

Autodesk.AutoCAD.Geometry.LinearEntity2d.GetLine
Returns an infinite line that is coincident with this line. This function can be called for LineSeg2d and Ray2d objects to get an infinite line from a bounded line.

Autodesk.AutoCAD.Geometry.LinearEntity2d.Direction
Returns direction vector of line. This vector is a unit vector and points in the direction of increasing parameter value.