Autodesk.AutoCAD.DatabaseServices.GeoLocationData.TransformToLonLatAlt(System.Double,System.Double,System.Double)
This function transforms the dwg point provided into a geo space point. It then returns the longitude, latitude, and elevation.
y:  Input y coordinate of dwg point
z:  Input z coordinate of dwg point