Autodesk.AutoCAD.GraphicsInterface.TextStyle
This .NET class wraps the AcGiTextStyle ObjectARX class. This class is used to set the display attributes of text. It is passed as an argument to one of the Geometry.Text() member functions.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.ExtentsBox(System.String,System.Boolean,System.Boolean,Autodesk.AutoCAD.GraphicsInterface.WorldDraw)
This function provides the means to find out the extents of the text string value1 when using the TextStyle..
value1:  Input text string for which the extents are to be determined
includeSpaces:  Input indicating if leading and trailing spaces are to be included
raw:  Input indicating if the AutoCAD escape sequences are to be interpreted
context:  Input if NULL, the AutoCAD default regen pipeline is used to calculate extents

Autodesk.AutoCAD.GraphicsInterface.TextStyle.FromTextStyleTableRecord(System.String)
Copies the style properties from the TextStyleTableRecord whose name is AcDbStyleName.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.FromTextStyleTableRecord(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Copies the style properties from the TextStyleTableRecord whose ObjectId is AcDbStyleId.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.ToTextStyleTableRecord(System.String)
Copies the style properties to the TextStyleTableRecord whose name is AcDbStyleName.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.ToTextStyleTableRecord(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Copies the style properties to the TextStyleTableRecord whose ObjectId is AcDbStyleId.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.ToTextStyleTableRecord
Copies the style properties to a TextStyleTableRecord whose name is same as this TextStyle's name. If no such record exists, then one is created. If this TextStyle has no name, then a random name will be generated and used for both this TextStyle and the TextStyleTableRecord.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.LoadStyleRec
This function loads a font (not a style) and is run after TextStyle.FileName or TextStyle.BigFontFileName has set the font file name. This function must be called after loading a True Type font (TTF). It also must be called after changing any TextStyle properties, such as tracking percent, in order to load the new values into the graphics system.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.XScale
Returns the X scale factor currently in use by the TextStyle object. The X scale factor is applied to the character cell widths as each character is drawn to allow the width to be adjusted independently of the height. For example, if the xScale value is 0.8, then each character will be drawn at 80% of its normal "unadjusted" width.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.ObliquingAngle
Returns the text obliquing angle (in radians) currently in use by the TextStyle object. If no obliquing angle has been set, then 0 is returned.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.TrackingPercent
Returns the tracking percent in use by the TextStyle object. The value may be between 0.75 and 4.0. The tracking percent is a factor applied to the distance between the starting points of successive characters. A value of 1.0 indicates that the characters have no spacing adjustment (that is, they are spaced based only on the character definitions in the font file).

Autodesk.AutoCAD.GraphicsInterface.TextStyle.UpsideDown
Returns True if the TextStyle object is set to display text upside down. Otherwise returns False.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Vertical
Returns True if the TextStyle object is set to display text vertically rather than horizontally. Otherwise returns False.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Underlined
Returns true if the TextStyle object is set to display underlined text. Otherwise returns false.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Overlined
Returns true if the TextStyle object is set to display text with a line over it (that is, similar to underlining, but over the text instead of under it). Otherwise returns false.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.FileName
Returns the font file name in use by the TextStyle object. If no font file name has been set in the object, then NULL is returned.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.BigFontFileName
Returns the big font file name in use by the TextStyle object. If no big font file name has been set in the object, then NULL is returned.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.StyleName
Returns a pointer to the styleName of the TextStyle object. The returned name meets the same restrictions as any symbol table name (that is, alphanumeric or "|" only and 32 characters maximum). The return value is NULL if no styleName has been set.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Font
Returns the font definition from the TextStyle object. The returned values are the typeface, the bold and italics style attributes, the character set, and the pitch and family attributes.