Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.ToString
Returns an equivalent string representation of this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
provider:  Input System.IFormatProvider object