Autodesk.AutoCAD.DatabaseServices.Polyline.#ctor(System.Int32)
The Polyline dynamically allocates memory when vertices are added. However, if you know the number of vertices to be added, memory can be allocated to the exact size by specifying the number of vertices in the constructor. Specifying a non-zero value for vertices doesn't mean that the polyline automatically has that many vertices. It means that memory has been allocated, ready to be loaded with vertex information. The memory allocated is unused until it gets filled by Polyline.AddVertexAt() calls.
vertices:  Input number of vertices to allocate memory for

Autodesk.AutoCAD.DatabaseServices.Polyline.ConvertFrom(Autodesk.AutoCAD.DatabaseServices.Entity,System.Boolean)
This fills the Polyline with data from the Polyline2d pointed to by entity. entity must point to a SimplePoly or FitCurvePoly type of Polyline2d object in a database. This function should be called from an Polyline that is not yet database-resident..
entity:  Input pointer to the Polyline2d to copy from
transferId:  Input Boolean indicating whether or not to do a HandOverTo between the Polyline2d and the Polyline

Autodesk.AutoCAD.DatabaseServices.Polyline.ConvertTo(System.Boolean)
This function creates an Polyline2d from the Polyline and returns the newly created Polyline2d..
transferId:  Input Boolean indicating whether or not to do a handOverTo between the Polyline and the Polyline2d.

Autodesk.AutoCAD.DatabaseServices.Polyline.OnSegmentAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d,System.Double)
This function determines whether or not pt2d (specified in the polyline's Entity Coordinate System) is on the segment of the polyline starting at vertex index . If pt2d is on the polyline's segment, then param is set to the location of the point on the segment. value will be in the parametric form of the segment type (in other words, linear or arc).
index:  Input index (0 based) of the vertex
pt2d:  Input point (in polyline OCS coords) to check at vertex index
value:  Output parameter of at vertex index

Autodesk.AutoCAD.DatabaseServices.Polyline.AddVertexAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Double,System.Double)
This function adds a vertex to the polyline. If index is 0, the vertex will become the first vertex of the polyline. If index is the value returned by Polyline.NumberOfVertices, then the vertex will become the last vertex of the polyline. Otherwise the vertex will be added just before the index vertex.
index:  Input index (0 based) before which to insert the vertex
pt:  Input vertex location point
bulge:  Input bulge value for vertex
startWidth:  Input start width for vertex
endWidth:  Input end width for vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.GetBulgeAt(System.Int32)
This function gets the bulge factor value at the index vertex. The bulge factor is used to indicate how much of an arc segment is present at this vertex. The bulge factor is the tangent of one fourth the included angle for an arc segment, made negative if the arc goes clockwise from the start point to the endpoint. A bulge of 0 indicates a straight segment, and a bulge of 1 is a semicircle.
index:  Input index (0 based) of the vertex for start of bulge

Autodesk.AutoCAD.DatabaseServices.Polyline.SetBulgeAt(System.Int32,System.Double)
This function sets bulge to be the bulge value for the index vertex. This will determine the bulge for the polyline segment which follows the index vertex.
index:  Input index (0 based) of the vertex
bulge:  Input bulge value for the vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.GetEndWidthAt(System.Int32)
Returns the polyline segment ending width value for the polyline. This value is used as the default end width for all vertices within the polyline.
index:  Input index (0 based) of the polyline

Autodesk.AutoCAD.DatabaseServices.Polyline.MinimizeMemory
This function optimizes the memory usage of the polyline. This process takes time and should not be used until all modifications in a session are complete.

Autodesk.AutoCAD.DatabaseServices.Polyline.MaximizeMemory
This function "decompresses" any memory compression that may currently be used by the polyline. This enables faster access to the polyline for modification.

Autodesk.AutoCAD.DatabaseServices.Polyline.Reset(System.Boolean,System.Int32)
This function resets the polyline's vertex data..
reuse:  Input Boolean indicating whether or not to retain some vertices
vertices:  Input number of vertices to retain

Autodesk.AutoCAD.DatabaseServices.Polyline.HasBulges
Assesses if the polyline has any bulge factors set for any of the segments. Bulge factor values are required for arc segments within the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.HasWidth
Assesses if the polyline has any width values set for any of the segments. Width values are required for varying width segments within the polyline.