Autodesk.AutoCAD.DatabaseServices.DxfFiler.RewindFiler
The implementation of this function should follow that of the ObjectARX internal filers. It should reset the filer to its default condition without changing the position that the filer is pointing to in the data it's reading or writing.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.FilerStatus
The implementation of this function should follow that of the ObjectARX internal filers. It checks the current state of the filer.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.ResetFilerStatus
The implementation of this function should follow that of the ObjectARX internal filers. It should reset the filer's internal error status.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteResultBuffer(Autodesk.AutoCAD.DatabaseServices.ResultBuffer)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
buffer:  Resbuf structure to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteObjectId(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.DatabaseServices.ObjectId)
The implementation of this function should follow that of the ObjectARX internal filers. It should do the following:.
opCode:  DXF group code to be written out
value:  Input object ID value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteString(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.String)
The implementation of this function should follow that of the ObjectARX internal filers. It should do the following:.
opCode:  DXF group code to be written out
value:  Input System.String value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteBytes(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Byte[])
The implementation of this function should follow that of the ObjectARX internal filers. It should do the following:.
opCode:  Input DXF group code to be written out
chunk:  Input byte array to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteHandle(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.DatabaseServices.Handle)
The implementation of this function should follow that of the ObjectARX internal filers. It should do the following:.
opCode:  DXF group code to be written out
value:  Input Handle value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteInt32(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should do the following:.
opCode:  DXF group code to be written out
value:  Input System.Int32 value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteInt16(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Int16)
The implementation of this function should follow that of the ObjectARX internal filers. It should do the following:.
opCode:  DXF group code to be written out
value:  Input System.Int16 value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteUInt32(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.UInt32)
The implementation of this function should follow that of the ObjectARX internal filers. It should do the following:.
opCode:  DXF group code to be written out
value:  Input System.UInt32 value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteUInt16(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.UInt16)
The implementation of this function should follow that of the ObjectARX internal filers. It should do the following:.
opCode:  DXF group code to be written out
value:  Input System.UInt16 value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteByte(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Byte)
The implementation of this function should follow that of the ObjectARX internal filers. It should do the following:.
opCode:  Input DXF group code to be written out
value:  Input byte value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteBoolean(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Boolean)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
opCode:  DXF group code to be written out Boolean to be written out
value:  Input boolean value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteBool(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Boolean)
The implementation of this function should follow that of the ObjectARX internal filers. It should do the following:.
opCode:  Input DXF group code to be written out
value:  Input boolean value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteDouble(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Double,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should do the following:.
opCode:  DXF group code to be written out
value:  Double to be written out
precision:  _nt_

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WritePoint2d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Point2d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
opCode:  DXF group code to be written out
value:  2D point to be written out
precision:  Decimal places to use when writing out the coordinate double values

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WritePoint3d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Point3d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
opCode:  DXF group code to be written out
value:  3D point to be written out
precision:  Decimal places to use when writing out the coordinate double values

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteVector2d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Vector2d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
opCode:  DXF group code to be written out
value:  2D vector to be written out
precision:  Decimal places to use when writing out the 2D vector

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteVector3d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Vector3d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
opCode:  DXF group code to be written out
value:  3D vector to be written out
precision:  Decimal places to use when writing out the 3D vector

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteScale3d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Scale3d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should:.
opCode:  DXF group code to be written out
value:  Scale3d object to be written out
precision:  Decimal places to use when writing out the Scale3d object

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteXDataStart
If the filer is filing to AutoLISP or ADSRX, then this function writes out the DxfCode.XDataStart (value of -3) to indicate the start of xdata. If the filer is filing to a DXF file, then this function does nothing.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.PushBackItem
The implementation of this function should follow that of the ObjectARX internal filers:.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.AtSubclassData(System.String)
The implementation of this function should follow that of the ObjectARX internal filers. It should test to see if the filer is currently pointing to an item with an DxfCode of Subclass and a data value string that exactly matches the subClassName string. If this is the case, then the filer moves the file pointer to the next item and returns true. Otherwise the file pointer is left alone and false is returned.
value:  subClassName that should be compared

Autodesk.AutoCAD.DatabaseServices.DxfFiler.HaltAtClassBoundaries(System.Boolean)
The implementation of this function should follow that of the ObjectARX internal filers. If value is false, then set the filer to read all input without resetting its ErrorStatus unless an I/O error occurs..
value:  Input Boolean indicating whether or not to halt at certain key markers in the file

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteEmbeddedObjectStart
The implementation of this function should follow the implementation used by ObjectARX internal filers. The steps are as follows:.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.ExtendedMinorVersion
Gets the drawing file minor version.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.IncludesDefaultValues
Assesses if the filer is being used for a purpose where default values (that is, color BYLAYER, normal = (0,0,1), etc.) are normally filed out. In such cases, the ObjectARX base classes such as DBObject and Entity are filing out default values.