Autodesk.AutoCAD.Runtime.Dictionary.AtPut(System.Int32,Autodesk.AutoCAD.Runtime.RXObject)
Puts value into the dictionary at index id. This function returns a pointer to the Object that was at this index prior to this call. It returns NULL if the dictionary was set up to delete its entries.
id:  Input dictionary entry ID at which to put value.
value:  Input object to add to the dictionary.

Autodesk.AutoCAD.Runtime.Dictionary.AtPut(System.String,Autodesk.AutoCAD.Runtime.RXObject,System.Int32&)
Puts value into the dictionary with key as the lookup key and returns the new entry's dictionary ID in retId for future searches for this object using retId instead of the key. Returns a pointer to the Object with lookup key prior to this call. It returns NULL if there was nothing at this key or if the dictionary was set up to delete its entries.
key:  Input lookup key string to use.
value:  Input object to add to the dictionary.
retId:  Output dictionary entry ID for the newly entered value.

Autodesk.AutoCAD.Runtime.Dictionary.AtKeyAndIdPut(System.String,System.Int32,Autodesk.AutoCAD.Runtime.RXObject)
Adds value to the dictionary with an existing id. newKey is not used to index into the dictionary.
newKey:  Input lookup key string to use.
id:  Input dictionary entry ID at which to put value.
value:  Input object to add to the dictionary.

Autodesk.AutoCAD.Runtime.Dictionary.Remove(System.Int32)
Removes the dictionary entry at index id. id must be greater than 0.
id:  Input dictionary entry ID of the entry to remove.

Autodesk.AutoCAD.Runtime.Dictionary.IdAt(System.String)
Returns the dictionary ID for the entry indexed by key. If key is not found, 0 is returned.
key:  Input lookup key string to search for.

Autodesk.AutoCAD.Runtime.Dictionary.KeyAt(System.Int32)
Returns a pointer to the lookup key string for the entry indexed by id. id must be greater than 0.
id:  Input dictionary entry ID to search for.

Autodesk.AutoCAD.Runtime.Dictionary.IsCaseSensitive
Returns true or false depending on the value of the "ignoreCase" flag passed to the Kernel.newAcRxDictionary() function. It is intended for use by client code to check the state of an Dictionary in the same way that you call deletesObjects() and isSorted() to check other state data.