Autodesk.AutoCAD.Geometry.Point2d
This class wraps AcGePoint2d ObjectARX class. It represents a point in 2-dimensional space. It can be viewed as a structure consisting of two doubles.

Autodesk.AutoCAD.Geometry.Point2d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix2d)
Transforms this pre-multiplying it by the matrix leftSide. Returns the reference to this point.
leftSide:  Input left side of the matrix

Autodesk.AutoCAD.Geometry.Point2d.RotateBy(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Returns 2D point which is the result of rotation of this point around the origin. Rotation angle is given by the argument angle, where positive direction of rotation is considered from X axis to Y axis.
angle:  Input rotation angle
origin:  Input center of rotation