Autodesk.AutoCAD.DatabaseServices.AssocNetwork
The AssocNetwork class keeps a network of AssocActions. Notice that it is derived from AssocAction, therefore it also behaves as an individual AssocAction. It means as a whole network can depend on other objects via its AssocDependencies or be owned by a higher-level AssocNetwork, allowing to create hierarchical associative structures.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.AddAction(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Adds an AssocAction to be owned by this network. The action being added must not be owned by any network. Every action except for the topmost AssocNetwork is "logically" owned by a single AssocNetwork..
actionId:  AssocAction being added to the network.
alsoSetAsDatabaseOwner:  Make this network the database owner of the action.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.AddActions(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Boolean)
Adds the given AssocActions to be owned by this network. The actions being added must not be owned by any network..
actionIds:  AssocActions being added to the network.
alsoSetAsDatabaseOwner:  Make this network the database owner of the actions.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.OwnedActionStatusChanged(Autodesk.AutoCAD.DatabaseServices.AssocAction,Autodesk.AutoCAD.DatabaseServices.AssocStatus)
This callback is called from AssocAction.SetStatus(..., true) and notifies the network owing the action that the status of the action has just been changed. The action is still open for write and already has the new status.
ownedAction:  The action whose status has just been changed.
previousStatus:  Previous status of the action.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.GetInstanceFromDatabase(Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean,System.String)
Returns ObjectId of the AssocNetwork owned by the given database, optionally creating a new one if it does not exist yet. Returns ObjectId::Null if the network cannot be obtained..
database:  Database owning the network.
createIfDoesNotExist:  If it does not exist yet, create a new subdictionary under the named object dictionary of the database. Create an AssocNetwork and make it owned by this newly created subdictionary.
dictionaryKey:  The name of the sub-dictionary under which the network belongs. If no key name is given, the default "ACAD_ASSOCNETWORK" key is used.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.GetInstanceFromObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean,System.Boolean,System.String)
Returns ObjectId of the AssocNetwork owned by the extension dictionary of the given DBObject, optionally creating a new one if it does not exist yet. Returns ObjectId.Null if the network cannot be obtained..
owningObjectId:  The Object owning the sub-dictionary that owns the AssocNetwork.
createIfDoesNotExist:  If it does not exist yet, create a new subdictionary of the extension dictionary of the object. Create an AssocNetwork and make it owned by this newly created subdictionary.
addToTopLevelNetwork:  If the network is newly created, it also adds it to the the top-level network of the database that owns the owningObjectId. It has no effect if the network already exists or if createIfDoesNotExist is false.
dictionaryKey:  The name of the sub-dictionary under which the network belongs. If no key name is given, the default "ACAD_ASSOCNETWORK" key is used.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.GetActions
Gets the reference to the *internal* array of ObjectIds of all owned AssocActions. If used for anything more than just a simple iteration, or when there is any chance that some actions may be added/removed, you need to make a copy of this array FIRST, because the array may change.