Autodesk.AutoCAD.DatabaseServices.ResultBufferEnumerator.MoveNext
Advances this enumerator to the next node in the ResultBuffer list, or to the first node if the current node is null. Returns false if the pointer advances past the end of the list, or if the list is empty. Otherwise, returns true.