Autodesk.AutoCAD.Geometry.CompositeParameter
This value type encapsulates the data that defines the parameter of a point on a composite curve. This data includes the point's component parameter value, and the index of the component curve on which the point lies.