Autodesk.AutoCAD.Geometry.Entity3d
This .NET class wraps the AcGeEntity3d ObjectARX class. It's an abstract base class for all point set classes. Any class that is derived from this class represents a set of points in 3D space.

Autodesk.AutoCAD.Geometry.Entity3d.ScaleBy(System.Double,Autodesk.AutoCAD.Geometry.Point3d)
Scales the entity about the input point by the input scale factor. Input scale factor must be greater than 0.
scaleFactor:  Input amount by which entity is to be scaled
point:  Input point about which entity is to be scaled