Autodesk.AutoCAD.Geometry.PointOnCurve3d.#ctor
Default constructor. Constructs a point on the curve Line3d.XAxis at the parameter value 0.0.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetPointAtParameter(System.Double)
Returns the coordinates of the point on curve at the specified parameter value. This function resets the parameter value of the point on curve.
parameter:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetPointOnCurve(Autodesk.AutoCAD.Geometry.Curve3d,System.Double)
Returns the coordinates of the point on the input curve at the specified parameter value. This function resets the underlying curve and parameter value of the point on curve.
curve:  Input any 3D curve
parameter:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetDerivative(System.Int32,Autodesk.AutoCAD.Geometry.Curve3d,System.Double)
Returns the derivative of the specified order on the input curve at the specified parameter value. order must be greater than 0 and no larger than 2. This function resets the underlying curve and parameter value of the point on curve.
order:  Input order of derivative
curve:  Input any 3D curve
parameter:  Input parameter value on curve

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetDerivative(System.Int32,System.Double)
Returns the derivative of the specified order at the specified parameter value. order must be greater than 0 and no larger than 2. This function resets the parameter value of the point on curve.
order:  Input order of derivative
parameter:  Input parameter value on curve

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetDerivative(System.Int32)
Returns the derivative of the specified order. order must be greater than 0 and no larger than 2.
order:  Input order of derivative