Autodesk.AutoCAD.DatabaseServices.DBText.CorrectSpelling
This function runs the spell checker on the text to correct any spelling errors. The spell checker is an AutoCAD-specific function, so this method may not be implemented for other database library uses.

Autodesk.AutoCAD.DatabaseServices.DBText.AdjustAlignment(Autodesk.AutoCAD.DatabaseServices.Database)
Normally when a text entity is closed, the text's position and alignment points are adjusted according to the text's justification settings and the text style. But, if the text entity is embedded in another entity, it will never be closed in which case it won't automatically be adjusted. Or, if the text is added to a transaction before it's first close(), and the graphics are flushed to the screen before the outermost transaction ends, the text will be displayed before the automatic adjustment takes place.
alternateDatabaseToUse:  Database to be used if the text entity is not in a database (this argument is ignored if the text entity is in a database)

Autodesk.AutoCAD.DatabaseServices.DBText.ConvertFieldToText
If the text contains fields, this function converts them to text and removes the fields. It does not evaluate the fields before converting them.

Autodesk.AutoCAD.DatabaseServices.DBText.Normal
Accesses the normal vector of the plane containing the text. The normal vector is in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.DBText.Thickness
Accesses the thickness of the text. The thickness is the text's dimension along its normal vector direction (sometimes called the extrusion direction).

Autodesk.AutoCAD.DatabaseServices.DBText.Oblique
Accesses the oblique angle (in radians) of the text. The obliquing angle is the angle from the text's vertical; that is, the top of the text "slants" relative to the bottom, the same as the slope in this italic text. Positive angles slant characters forward at their tops. Negative angles have 2pi added to them to convert them to their positive equivalent.

Autodesk.AutoCAD.DatabaseServices.DBText.Rotation
Accesses the rotation angle of the text. The rotation angle is relative to the X axis of the text's OCS, with positive angles going counterclockwise when looking down the Z axis towards the origin. The OCS X axis is determined by using the text's normal, the WCS Z axis, and the arbitrary axis algorithm.

Autodesk.AutoCAD.DatabaseServices.DBText.WidthFactor
Accesses the width factor (also referred to as the relative X-scale factor) for the text. The width factor is applied to the text's width to allow the width to be adjusted independently of the height. For example, if the width factor value is 0.8, then the text is drawn with a width that is 80% of its normal "unadjusted" width.

Autodesk.AutoCAD.DatabaseServices.DBText.TextString
Accesses the null-terminated text string used by the Text object. The text string can be up to 256 bytes long (not including the null terminator). The application calling this function is responsible for releasing the memory used by the returned string.

Autodesk.AutoCAD.DatabaseServices.DBText.IsMirroredInX
Accesses whether the text is mirrored in the X direction (that is, it appears backward in the horizontal direction). Set to false if it is not mirrored.

Autodesk.AutoCAD.DatabaseServices.DBText.IsMirroredInY
Accesses whether the text is mirrored in the Y direction (that is, it appears upside down). Set to false if it is not mirrored.