Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval)
Constructs an object that represents the intersection of the two input curves. Intersection points and overlaps are only returned if they are within the two specified parameter ranges. Intersection points are returned within the accuracy of the specified tolerance (or to within the default tolerance if no tolerance parameter is specified).
curve1:  Input first curve
curve2:  Input second curve
range1:  Input first range interval
range2:  Input second range interval

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d)
Constructs an object that represents the intersection of the two input curves. Intersection points are returned within the accuracy of the default tolerance.
curve1:  Input first curve
curve2:  Input second curve

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.#ctor
This default constructor would typically be used as a placeholder where the curves would be specified by a subsequent call to one of the Set() functions. This constructor sets the two curves to be the infinite lines represented by the X and Y axes.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetIntersectionPoint(System.Int32)
Returns the specified intersection point. number must be non-negative.
number:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetPointOnCurve1(System.Int32)
Returns the specified intersection point as an PointOnCurve2d object of the first curve. The PointOnCurve2d class contains functions to return the 2D coordinates and the parameter value of the returned point.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetPointOnCurve2(System.Int32)
Returns the specified intersection point as an PointOnCurve2d object of the second curve. The PointOnCurve2d class contains functions to return the 2D coordinates and the parameter value of the returned point.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetOverlapRanges(System.Int32)
Returns the intervals of overlap of each curve of the specified overlap. overlapNumber must be non-negative and be less than the number of overlaps returned by OverlapCount.
overlapNumber:  Input number of overlaps to get intervals for