Autodesk.AutoCAD.GraphicsInterface.Geometry.PushModelTransform(Autodesk.AutoCAD.Geometry.Matrix3d)
This function pushes a new transform onto the transform stack. The transform is the result of multiplying matrix by the existing transform. This allows you to easily handle an entity coordinate system. When you have finished with the transform, you must call PopModelTransform() to leave the pipe in the same state as before.
matrix:  Input input matrix

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushModelTransform(Autodesk.AutoCAD.Geometry.Vector3d)
This function pushes a new transform onto the transform stack. It generates the input matrix using the arbitrary axis algorithm and the supplied vector.
normal:  Input normal vector

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushPositionTransform(Autodesk.AutoCAD.GraphicsInterface.PositionBehavior,Autodesk.AutoCAD.Geometry.Point2d)
This method places the position transform behavior onto the current transform stack. It then returns the resulting matrix.
behavior:  Input transform behavior
offset:  Input position coordinate

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushPositionTransform(Autodesk.AutoCAD.GraphicsInterface.PositionBehavior,Autodesk.AutoCAD.Geometry.Point3d)
This method places the position transform behavior onto the current transform stack. It then returns the resulting matrix.
behavior:  Input transform behavior
offset:  Input position coordinate

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushScaleTransform(Autodesk.AutoCAD.GraphicsInterface.ScaleBehavior,Autodesk.AutoCAD.Geometry.Point2d)
This method places scale transform behavior onto the current transform stack. It then returns the resulting matrix.
behavior:  Input scale transformation behavior
extents:  Input new scale values

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushScaleTransform(Autodesk.AutoCAD.GraphicsInterface.ScaleBehavior,Autodesk.AutoCAD.Geometry.Point3d)
This method places scale transform behavior onto the current transform stack. It then returns the resulting matrix.
behavior:  Input scale transformation behavior
extents:  Input new scale values

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushOrientationTransform(Autodesk.AutoCAD.GraphicsInterface.OrientationBehavior)
This method places the orientation transform behavior onto the current transform stack. It then returns the resulting matrix.
behavior:  Input orientation transform behavior to push

Autodesk.AutoCAD.GraphicsInterface.Geometry.Circle(Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.Geometry.Vector3d)
Displays a circle primitive with center at center and a radius of radius. The circle is on the plane defined by the normal vector normal and the point center.
center:  Input center point for the circle.
radius:  Input radius for the circle.
normal:  Input normal vector for plane to contain the circle.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Polyline(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,System.IntPtr)
Allows the caller to specify sequential sub-entity markers for the segments of the polyline. If subEntityMarker 'n' is greater than zero then the segments of the polyline will be assigned markers beginning with 'n' incrementing by 1 for each segment.
points:  Input number of vertex points in polyline (minimum of two)
normal:  Input normal vector
subEntityMarker:  Input sub-entity marker for first segment

Autodesk.AutoCAD.GraphicsInterface.Geometry.Polygon(Autodesk.AutoCAD.Geometry.Point3dCollection)
A return value of false (that is, 0) indicates that the primitive has been successfully stored in the graphics database. A return value of true indicates that the operation has been terminated and the application wants to get control back as soon as possible.
points:  Input number of vertex points in polyline (minimum of two)

Autodesk.AutoCAD.GraphicsInterface.Geometry.Mesh(System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.GraphicsInterface.EdgeData,Autodesk.AutoCAD.GraphicsInterface.FaceData,Autodesk.AutoCAD.GraphicsInterface.VertexData,System.Boolean)
edgeData points to an EdgeData object that contains arrays of color, layer, visibility, line type, and selection marker settings for the edges. Each of the arrays in the EdgeData object pointed to must either be NULL or must have (row - 1) x column + row x (column -1) elements..
rows:  Input number of rows in mesh
columns:  Input number of columns in mesh
points:  Input array of vertex points (must be rows x columns points)
edgeData:  Input to an existing EdgeData object
faceData:  Input to an existing FaceData object
vertexData:  Input to an existing VertexData object
bAutoGenerateNormals:  Input Boolean to indicate whether the display system should automatically generate normals for vertices and faces if they are not passed in through vertexData and faceData.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Shell(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.GraphicsInterface.EdgeData,Autodesk.AutoCAD.GraphicsInterface.FaceData,Autodesk.AutoCAD.GraphicsInterface.VertexData,System.Boolean)
edgeData points to an EdgeData object that contains arrays of color, layer, visibility, line type, and selection marker settings for the edges. Each of the arrays in the EdgeData object pointed to must either be NULL or must have the same number of elements as the number of edges..
points:  Input array of vertex points
faces:  Input collection of integers
edgeData:  Input to an existing EdgeData object
faceData:  Input to an existing FaceData object
vertexData:  Input to an existing VertexData object
bAutoGenerateNormals:  Input Boolean to indicate whether the display system should automatically generate normals for vertices and faces if they are not passed in through vertexData and faceData

Autodesk.AutoCAD.GraphicsInterface.Geometry.Text(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.String,System.Boolean,Autodesk.AutoCAD.GraphicsInterface.TextStyle)
This function uses an TextStyle object to determine the font, size, etc. to use for the text..
position:  Input start or insertion point for the text
normal:  Input normal for the plane to contain the text
direction:  Input direction the text will go
message:  Input text string to display
raw:  Input informing AutoCAD whether to interpret escape codes.
textStyle:  Input existing text style

Autodesk.AutoCAD.GraphicsInterface.Geometry.Text(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.String)
This method uses the current TextStyle when generating the text graphics primitive. When worldDraw() is first entered, the TextStyle is set to the STANDARD text style that's built into the acad.exe file (not the STANDARD text style in the drawing).
position:  Input start or insertion point for the text
normal:  Input normal for the plane to contain the text
direction:  Input direction the text will go
height:  Input text height
width:  Input text width
oblique:  Input text obliquing angle
message:  Input text string to display

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushClipBoundary(Autodesk.AutoCAD.GraphicsInterface.ClipBoundary)
Block references use clip boundaries to clip their contents. This method pushes a new boundary onto the stack, possibly affecting the display of subsequent primitives until it is removed using PopClipBoundary().
boundary:  Input clip boundary

Autodesk.AutoCAD.GraphicsInterface.Geometry.PopClipBoundary
Removes the top most clip boundary from the stack. This method may only be called following a successful PushClipBoundary() call from within the WorldDraw or ViewportDraw of a drawable.

Autodesk.AutoCAD.GraphicsInterface.Geometry.WorldLine(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Draws a line between the two points startPoint and endPoint. The points must be in world coordinates.
startPoint:  Input start point of the worldline
endPoint:  Input second point on the worldline

Autodesk.AutoCAD.GraphicsInterface.Geometry.Image(Autodesk.AutoCAD.GraphicsInterface.ImageBGRA32,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
This method uses the basic transparent image parameters provided to determine where and what size image to paint. It will stretch the image if its size is not equal to specified size.
imageSource:  Input transparent image
position:  Input start or insertion point for the image, in display coordinates
u:  Input the width of destination rectangle
v:  Input the height of destination rectangle

Autodesk.AutoCAD.GraphicsInterface.Geometry.ModelToWorldTransform
This gets the net block insert transform; that is, the model-to-world coordinate transform. The main purpose of the BLOCK entity is to transform an entity--whether to stretch, rotate, or move it.

Autodesk.AutoCAD.GraphicsInterface.Geometry.WorldToModelTransform
Gets the inverse of the net block insert transform. This can transform an entity's world coordinate representation back into the original model coordinates.