Autodesk.AutoCAD.Geometry.LineSegment3d
This .NET class wraps the AcGeLineSeg3d ObjectARX class. It represents a bounded line segment in 3D space.

Autodesk.AutoCAD.Geometry.LineSegment3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs a line segment between point1 and point2. point1 and point2 must not be the same point.
point1:  Input start point of line segment
point2:  Input end point of line segment

Autodesk.AutoCAD.Geometry.LineSegment3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a line segment whose start point is point and whose endpoint is point+vector. vector must not be a zero-length vector.
point:  Input start point of line segment
vector:  Input vector between endpoint and start point of line segment

Autodesk.AutoCAD.Geometry.LineSegment3d.#ctor
Default constructor. Constructs a line segment between (0,0,0) and (1,0,0).

Autodesk.AutoCAD.Geometry.LineSegment3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Point3d,System.Double)
Changes the definition of the line segment so that the line segment passes through the input point and is tangent to the input curve. The curve must be planar and the input point must lie on the plane of the curve. On input, parameter is assumed to contain an initial guess value to the parameter of the tangent point.
curve:  Input any 3D curve
point:  Input any 3D point
parameter:  Input point on curve where line segment is tangent to curve

Autodesk.AutoCAD.Geometry.LineSegment3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,System.Double,System.Double)
Changes the definition of the line segment so that the line segment is tangent to the two input curves. On input, parameter1 and parameter2 are assumed to contain initial guess values to the parameters of the two tangent points. The output parameter success is set to true if the line segment was computed successfully.
curve1:  Input any 3D curve
curve2:  Input any 3D curve
parameter1:  Input point on curve1 where line segment is tangent to curve
parameter2:  Input point on curve2 where line segment is tangent to curve

Autodesk.AutoCAD.Geometry.LineSegment3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Changes the definition of the line segment so that the start point is point1 and the endpoint is point2. point1 and point2 must not be the same point.
point1:  Input start point of line segment
point2:  Input end point of line segment

Autodesk.AutoCAD.Geometry.LineSegment3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes the definition of the line segment so that the start point is point and the endpoint is point+vector. vector must not be a zero-length vector.
point:  Input start point of line segment
vector:  Input vector between endpoint and start point of line segment