Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimlim
Accesses the current DIMLIM value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimsah
Accesses current DIMSAH value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimsd1
Accesses the current DIMSD1 value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimsd2
Accesses the current DIMSD2 value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimse1
Accesses the current DIMSD1 value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimse2
Accesses the current DIMSD2 value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimsoxd
Accesses the current DIMSOXD value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtfill
Accesses the dimension background color state, which can be one of the following values:.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtih
Accesses the current DIMTIH value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtix
Accesses the current DIMTIX value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtofl
Accesses the current DIMTOFL value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtoh
Accesses the current DIMTOH value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtol
Accesses the current DIMTOL value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimupt
Accesses the current DIMUPT value for the database. The value of false is 0. The value of true is 1.