Autodesk.AutoCAD.ComponentModel.IPropertyProvider
Provides access to optional or "per-instance" properties. Objects that implement this interface can be used by the TypeDescriptor class to provide access to per-instance properties. The system will automatically call the GetProperties method if the Provider has been added to the TypeDescriptor either via the PropertyProviderAttribute or at runtime via TypeDescriptor.AddPropertyProvider.

Autodesk.AutoCAD.ComponentModel.IPropertyProvider.GetProperties(System.Object)
Returns a collection of PropertyDescriptor objects based on a given object instance. The returned PropertyDescriptors may vary from instance to instance.
instance:  Input the instance to retrieve from