Autodesk.AutoCAD.Geometry.Cylinder.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Computes the intersections with a linear entity. Returns false if there are no intersections, otherwise true is returned.
linearEntity:  Input linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Cylinder.Radius
Returns radius of the cylinder.