Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Add(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds the object represented by value to this collection. Returns the zero-based index of the newly added collection item.
value:  Item to add