Autodesk.AutoCAD.Runtime.RXClass.AddX(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.Runtime.RXObject)
Adds the class protocol extension object protocolObject into the protocol extension object dictionary of Class object. The search key is protocolClass, which is the Class object for the class of protocolObject. The value is the protocol object protocolObject.
runtimeClass:  Input object for the protocol extension class.
protocolExtension:  Input protocol extension object.

Autodesk.AutoCAD.Runtime.RXClass.GetX(Autodesk.AutoCAD.Runtime.RXClass)
Returns the protocol extension object stored with the key protocolClass. If there is no such object specific to the class represented by this Class object, then the protocol extension object for the parent class is used, or its parent class, or on up the hierarchy as far as needed to obtain the protocol extension object sought.
runtimeClass:  Input object for the protocol extension class.

Autodesk.AutoCAD.Runtime.RXClass.DelX(Autodesk.AutoCAD.Runtime.RXClass)
Searches the Class object's protocol extension dictionary for an entry with the key protocolClass, and if found, removes the entry. If an entry is found and removed, the protocol extension object removed is returned; otherwise NULL is returned.
runtimeClass:  Input object for the protocol extension class.

Autodesk.AutoCAD.Runtime.RXClass.QueryX(Autodesk.AutoCAD.Runtime.RXClass)
Returns the protocol extension object stored with the key protocolClass. If there is no such object specific to the class represented by this Class object, then the protocol extension object for the parent class is used, or its parent class, or on up the hierarchy as far as needed to obtain the protocol extension object sought.
runtimeClass:  Input Autodesk.AutoCAD.Runtime.RXClass object for the protocol extension class.

Autodesk.AutoCAD.Runtime.RXClass.IsDerivedFrom(Autodesk.AutoCAD.Runtime.RXClass)
When an object's isKindOf() method is called, its associated Class object's isDerivedFrom() is called to make the determination. A recursive search up the parent class chain will be made if need be.
runtimeClass:  Input object for the desired base class.

Autodesk.AutoCAD.Runtime.RXClass.AppName
Returns the application name string which is the last parameter in the ACRX_DXF_DEFINE_MEMBERS macro and is also the last parameter to the global newClass() pseudo-constructor. This string is used as the application identifier in the error dialog that is displayed whenever an object of the class is loaded and the application is not present.

Autodesk.AutoCAD.Runtime.RXClass.DxfName
Returns the DXF name for the class. This string is only required to be non-NULL for classes derived from DBObject. Other classes may set this via the second to the last parameter of the global newClass() pseudo-constructor. If the dxfName string has not been set, then this function will return NULL.

Autodesk.AutoCAD.Runtime.RXClass.ClassVersion
Returns DWG_VERSION and MAINTENANCE_VERSION, which must be specified when the class is registered. These are mandatory, and there is no default. The data members are not persistent; in other words, they are not written to the DWG/DXF files.