Autodesk.AutoCAD.DatabaseServices.SectionViewStyle


Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.GetViewLabelPattern(Autodesk.AutoCAD.DatabaseServices.Field)
This method gets the pattern for view label. If the view label pattern is using fields, the master field will be copied to the given 'field' including child fields.
field:  Input: a field object to be updated with the view label pattern master field.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.SetViewLabelPattern(System.String,Autodesk.AutoCAD.DatabaseServices.Field)
Sets the pattern for view label. If 'field' parameter is specified and contains child fields, then label pattern will be acquired from the field. Otherwise the 'pattern' string is used.
pattern:  Input: the pattern string for the view label.
field:  Input: optional pointer to a Field object to provide the field data to be used in the view label pattern.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.PostViewStyleToDb(Autodesk.AutoCAD.DatabaseServices.Database,System.String)
Add this view style object to the given database using the given name. Returns the object id of the newly added SectionViewStyle object.
dataBasePointer:  Input: database to be updated
styleName:  Input: name to be used for this view style.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.Name
The name of the section view style. Return value is System::String.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.Description
The description of the section view style. Return value is System::String.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IsModifiedForRecompute
Indicates whether the section view style has been modified and associated section views and section view symbols need to be updated. Return value is bool.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IdentifierStyleId
The id of the text style table record to be associated to section symbol identifiers. return value is ObjectId.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IdentifierColor
The color to be used for the identifier of section view symbols. Return value is Color.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IdentifierHeight
The text height to be used by the identifier of section view symbols. Return value is double.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IdentifierExcludeCharacters
The characters excluded from use by section symbol identifiers. Return value is System::String.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IdentifierPosition
The identifier offset type. Return value is SectionViewIdentifierPosition.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IdentifierOffset
The distance the section view symbol identifiers are offset from the section view symbol arrowheads. Return value is double.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ArrowPosition
The section view symbol arrow direction setting which can be towards the cutting plane or away from the cutting plane. Return value is SectionViewArrowDirection.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.EndLineOvershoot
The length of the end line overshoot. Return value is double.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ArrowStartSymbolId
The objectId of the block table record used to represent the arrow start symbol. Return value is ObjectId.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ArrowEndSymbolId
The objectId of the block table record used to represent the arrow end symbol. Return value is ObjectId.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ArrowSymbolColor
The color for the section symbol arrow. Return value is Color.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ArrowSymbolSize
The size for the section symbol arrow. Return value is double.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ArrowSymbolExtensionLength
The length for the section symbol arrow extension line. Return value is double.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.PlaneLineWeight
The line weight for the section symbol plane line. Return value is Lineweight.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.PlaneLineColor
The color for the section symbol plane line. Return value is Color.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.PlaneLineTypeId
The ObjectId of the linetype for the section symbol plane line. Return value is ObjectId.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.BendLineColor
The color for the section bend line. Return value is Color.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.BendLineWeight
The line weight for the section symbol bend lines. Return value is LineWeight.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.BendLineTypeId
The ObjectId of the linetype for the section symbol bend lines. Return value is ObjectId.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.BendLineLength
The length for the section symbol bend lines. Return value is double.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.EndLineLength
The length for the section symbol end lines. Return value is double.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelTextStyleId
The id of the text style table record to be associated to the section view label text. Return value is ObjectId.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelTextColor
The color for section view label text. Return value is Color.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelTextHeight
The height for the section view label text. Return value is double.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelOffset
The offset distance for the section view label text. Return value is double.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelAttachment
The type of attachment for the section view label text. Return value is ModelDocViewLabelAttachmentPoint.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelAlignment
The type of alignment for the section view label text. Return value is ModelDocViewLabelAlignmentType.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelPattern
The pattern for the section view label text. Return value is String.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.HatchPattern
The name of the hatch pattern to be used by the section view hatching. Return value is String.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.HatchColor
The color for the hatching to be used by the section view. Return value is Color.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.HatchBackgroundColor
The color for the hatching background to be used by the section view. Return value is Color.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.HatchScale
The scale for the hatching to be used by the section view. Return value is double.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.HatchAngles
The list of angles to be used by the hatching within a section view. Return value is NAMESPACE_ACGE::DoubleCollection.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.HatchTransparency
The transparency for the hatching to be used by the section view. Return value is Transparency.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IsContinuousLabeling
Indicates whether the section view symbol should be created with continuous labeling at every bend. Return value is bool.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ShowArrowheads
Indicates whether the section symbol should display the arrowheads. Return value is bool.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ShowViewLabel
Indicates whether the section view should display the view label text. Return value is bool.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ShowAllPlaneLines
Indicates whether the section symbol should display all the plane lines. Return value is bool.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ShowAllBendIndentifiers
Indicates whether the section symbol should display the all the bend identifiers. Return value is bool.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ShowEndAndBendLines
Indicates whether the section symbol should display the end and bend lines. Return value is bool.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ShowHatching
Indicates whether the section view should display hatching. Return value is bool.