Autodesk.AutoCAD.GraphicsInterface.Context.DisableFastMoveDrag
For plane transformations it is possible for a graphics system to maintain a cache of the graphics primitives and apply a transformation to those primitives, instead of requerying the object. This works fine for many objects. However if an object would not perform such a transformation, but performs some other operation, then the drag image would not represent the true state of the object. By calling this method, the object is indicating that it requires to be queried for each transformation.

Autodesk.AutoCAD.GraphicsInterface.Context.Database
Every regeneration relates to a specific database, and if your object needs to query the database for any purpose, this is the database you should use. This is in contrast to using the database returned by the DBObject.database() method.

Autodesk.AutoCAD.GraphicsInterface.Context.IsBoundaryClipping
Returns true if boundary clipping is currently active. This indicates that any primitive drawn will be clipped to a boundary. For clarification, if this version of  supports clipping but there is currently no active clip boundary, the return value would be false.

Autodesk.AutoCAD.GraphicsInterface.Context.EffectiveColor
Returns the color that would be used to draw a primitive at this point, any bylayer and byblock resolution has been done. This does not include any change that may be caused in the plot pipeline by any active plot style.

Autodesk.AutoCAD.GraphicsInterface.Context.ByBlockLineWeight
Returns the lineweight that will be used if byblock lineweight is specified. This does not include any change that may be caused in the plot pipeline by any active plot style.

Autodesk.AutoCAD.GraphicsInterface.Context.SupportsTrueTypeText
Returns true if the current implementation of  supports True type font elaboration. A return value of false indicates that the device will be using a stroke based font for any text specified with a true type font.