Autodesk.AutoCAD.DatabaseServices.AutoConstrainEvaluationCallback.GetConstraintPriorityOverride(Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.ConstraintType,Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry[])
This function will be called when the system finds a possible constraint between a given set of constrained geometries. This function expects to get an override to increase, decrease or maintain the priority for the given constraint condition.
type:  Geometric constraint type that is possible between given set of constrained geometry.
geometries:  List of constrained geometry, which are potential candidate for provided constraint type. User may

Autodesk.AutoCAD.DatabaseServices.AutoConstrainEvaluationCallback.GetAutoConstrainPriority
Defines the order in which constraint types can be used for autoConstrain.