Autodesk.AutoCAD.DatabaseServices.Dimension.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)
This function copies the dimension variable information in the DimStyleTableRecord identified by style into the database on which this method is called, making those dimension variable values current for the database. The DimStyleTableRecord with object ID style does not have to reside in the database on which this method is called.
style:  Input object ID of DimStyleTableRecord from which to copy dimension variable information

Autodesk.AutoCAD.DatabaseServices.Dimension.GetDimstyleData
This function copies the dimstyle information from the DimStyleTableRecord referenced by the current dimension. After copying the data, any dimension variable overrides currently applied to the dimension will be copied into the returned table record.

Autodesk.AutoCAD.DatabaseServices.Dimension.RecomputeDimensionBlock(System.Boolean)
This function updates the block table record the dimension references to match any changes made to the dimension since the last time the block table record was updated..
forceUpdate:  Boolean indicating whether or not to force an update on screen

Autodesk.AutoCAD.DatabaseServices.Dimension.GenerateLayout
This function will update the dimension according to the current dimension style. It works similar to the Dim, Update subcommand. It computes dimension geometry, including extension lines, dimension lines, dimension arcs, dimension text, arrowheads from given definition points and dimension style. The generated dimension geometry are maintained internally by member data "mGeom" which is a list of in-memory Entity pointers. This API function does not generate the dimension block.

Autodesk.AutoCAD.DatabaseServices.Dimension.FormatMeasurement(System.Double,System.String)
This method gives you access to the dimension classes' text assembly and formatting logic. You pass in a double corresponding to the desired measurement and get back a string suitable for building MText objects. That MText content string reflects the dimension's dimstyle settings for prefixes, suffixes, units, precision, alternate units, tolerances, text style, and so on. This dimension text string gets combined with DIMPOST, DIMAPOST, and the alternate and primary measurements in the final dimension text.
measurement:  Input measurement value.
dimensionText:  Input alternate value.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimupt
Accesses the current DIMUPT value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Elevation
Accesses the dimension's elevation value. Elevation defines the distance from WCS origin to the plane on which the dimension lies.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimlim
Accesses the current DIMLIM value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimsah
Accesses current DIMSAH value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimsd1
Accesses the current DIMSD1 value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimsd2
Accesses the current DIMSD2 value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimse1
Accesses the current DIMSD1 value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimse2
Accesses the current DIMSD2 value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimsoxd
Accesses the current DIMSOXD value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtfill
Accesses the dimension background color state, which can be one of the following values:.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtih
Accesses the current DIMTIH value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtix
Accesses the current DIMTIX value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtofl
Accesses the current DIMTOFL value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtoh
Accesses the current DIMTOH value for the database. The value of false is 0. The value of true is 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtol
Accesses the current DIMTOL value for the database. The value of false is 0. The value of true is 1.