Autodesk.AutoCAD.DatabaseServices.Handle.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.Handle.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
provider:  Input culture-specific format

Autodesk.AutoCAD.DatabaseServices.Handle.ToString
Returns an equivalent string representation of this object. See the Microsoft .NET API documentation for details.