Autodesk.AutoCAD.Runtime.SecuredApplicationAttribute
This attribute is used to grant access to ObjectDBX. It encapsulates information about the caller's license and digital signature, as well as Autodesk's signature. ObjectDBX APIs query this assembly-level attribute to verify that the caller is properly licensed.