Autodesk.AutoCAD.DatabaseServices.HyperLink.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.HyperLink.SubLocation
Accesses the hyperlink sublocation. A sublocation is a specific target name within the named hyperlink.