Autodesk.AutoCAD.DatabaseServices.AngularConstraint
This class represents an angle constraint node in the owning Assoc2dConstraintGroup. It can be applied between two constrained lines.

Autodesk.AutoCAD.DatabaseServices.AngularConstraint.#ctor
Default constructor. The angle sector type is set to kParallelAntiClockwise.

Autodesk.AutoCAD.DatabaseServices.AngularConstraint.SetAngleMultiplier(System.Double)
Sets a multiplier that is used to multiply angles obtained from AssocValueDependencies that depend on AssocVariables to convert the angles to radians. It is needed because the expression evaluator used by AssocVariables considers all angles to be in degrees. To convert from degrees to radians, the multiplier needs to be set to Pi/180. If no angle multiplier is set, the default is Pi/180.
multiplier:  The angle multiplication factor.