Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem
The GeoCoordinate class represents a coordinate reference system (CRS) definition. A CRS is also being referred to as a spatial reference system (SRS). This is the wrapper class for the AcDbGeoCoordinateSystem class.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.Create(System.String)
Instantiates a new GeoCoordinateSystem object from the current virtual catalog. If no such CRS definition exists but the input string contains enough information(i.e. WKT or XML) for constructing a temporary AcDbGeoCoordinateSystem instance, this is being returned instead.
coordSysIdOrFullDef:  A coordinate system name. For example: "WORLD-MERCATOR"

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.Description
Gets the projection method of this CRS. The projection is the conversion of the CRS.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.ProjectionCode
Gets the unit of the coordinate system axis of this CRS. All axis contains the same unit.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.Unit
Gets the unit of the coordinate system axis of this CRS. All axis contains the same unit.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.GeoUnit
Gets a factor, that the length units of this CRS instance must be multiplied with to calculate the equivalent in meters. If the CRS is geographic, this value represents the distance in meters of 1° measured along the equatorial great circle of the underlying ellipsoid.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.UnitScale
Gets a factor, that the length units of this CRS instance must be multiplied with to calculate the equivalent in meters. If the CRS is geographic, this value represents the distance in meters of 1° measured along the equatorial great circle of the underlying ellipsoid.