Autodesk.AutoCAD.DatabaseServices.Material.Reflectivity
Accesses the refelectivity of the material. A higher value indicates a highly reflective material.

Autodesk.AutoCAD.DatabaseServices.Material.IlluminationModel
Accesses the illumination model set on this material. This model determines the type of shader used to render this material.

Autodesk.AutoCAD.DatabaseServices.Material.ChannelFlags
Accesses the channel flags for this material. The flags indicate which textures are in use by this material.