Autodesk.AutoCAD.DatabaseServices.Group.#ctor(System.String,System.Boolean)
Initializes the group object to use a copy of the description string as the description. If selectable == true, then when any entity within the group is selected, all entities in the group are selected. If selectable == false, then entities within the group are treated as individuals during the selection process..
description:  Input null terminated string describing the group
selectable:  Input Boolean value indicating whether the group is selectable or not

Autodesk.AutoCAD.DatabaseServices.Group.#ctor
Default constructor. Initializes the group description string to NULL, Selectable to true, and the entities list to empty.

Autodesk.AutoCAD.DatabaseServices.Group.SetAnonymous
This method sets the group to be anonymous. The group's current name will be replaced by an automatically generated anonymous group name.

Autodesk.AutoCAD.DatabaseServices.Group.InsertAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Inserts the objects whose objectIds are in the ids collection into the group just after the entry at index. The indices are zero based. Hence the first element in the group will have an index of 0.
index:  Input insertion index
ids:  Input objectId collection containing objects to be inserted

Autodesk.AutoCAD.DatabaseServices.Group.InsertAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Inserts the object specified by id into the group just after the entry at the index. The indices are zero based. Hence the first element in the group will have an index of 0.
index:  Input insertion index
id:  Input objectId of the object to be inserted

Autodesk.AutoCAD.DatabaseServices.Group.RemoveAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Removes, from the group, the objects whose object IDs are in the ids collection. All objects must be in the group and be at index locations equal to or higher than index.
index:  Input starting index of the objects to be removed
ids:  Input objectId array of objects to be removed after start index

Autodesk.AutoCAD.DatabaseServices.Group.Clear
This methods resets or clears the contents of a group. After this method is called the group contains no elements. All other settings in the group remain unchanged (for example, name, description, colorIndex, etc.).

Autodesk.AutoCAD.DatabaseServices.Group.Reverse
This method reverses the indices of all the objects in the group. The first object in the group will become the last object in the group, and so on.

Autodesk.AutoCAD.DatabaseServices.Group.SetLayer(System.String)
Sets the LayerTableRecord with name value to be the layer for all entities in the group. If the layer specified by value exists, the entities will be modified to reference that layer. If the layer does not exist, a layer of name value is created before modifying the entities.
value:  Input null terminated string that is the name of the new layer