Autodesk.AutoCAD.DatabaseServices.AssocSingleEdgePersSubentId.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId)
Returns true if this and the other AssocSingleEdgePersSubentId reference exactly the same subentity of the same entity. It just calls the base class AssocPersSubentityId.IsEqualTo() because there is no additional data stored in this derived AssocSingleEdgePersSubentId class.
entity:  The entity owning the subentities of this and the other AssocSingleEdgePersSubentId.
other:  The other AssocSingleEdgePersSubentId.