Autodesk.AutoCAD.DatabaseServices.DataColumn
This .NET class wraps the AcDbDataColumn ObjectARX class. It represents a single column of a DataTable.

Autodesk.AutoCAD.DatabaseServices.DataColumn.SetCellAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCell)
This function sets the cell at the specified index. The index must be less than the number of cells in the column.
index:  Index of the cell to be updated
cell:  Cell to set

Autodesk.AutoCAD.DatabaseServices.DataColumn.InsertCellAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCell)
This function inserts the cell into the column at the specified index. If index is greater than or equal to the number of cells in the column, it calls the appendCell() function.
index:  Position at which to insert the cell
cell:  Cell to insert

Autodesk.AutoCAD.DatabaseServices.DataColumn.RemoveCellAt(System.Int32)
This function removes the cell at the specified index. The index must be less than the number of cells in the column.
index:  Index of cell to remove from the column

Autodesk.AutoCAD.DatabaseServices.DataColumn.GetIndexAtCell(Autodesk.AutoCAD.DatabaseServices.DataCell)
This function searches the column for the first cell with a value that matches cell. It returns the index of the first cell found in the column with the value of cell.
cell:  Input cell to be matched