Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.DisassociateUcsFromView
Disassociates the ucs from this view. If this function is called, then no ucs will be associated with the view and the ucs will not change when the view is restored.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.IsPaperspaceView
Returns true if this ViewTableRecord is a Paper Space view. Otherwise it returns false.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.IsUcsAssociatedToView
Returns true if this view table record has an associated ucs. If this function returns true, then the ucs that is associated with this view will become active whenever this view is restored. The associated ucs can be obtained by calling getUcs() (defined in AbstractViewTableRecord parent class). A ucs can be associated to this view by calling one of the setUcs() functions in the AcDbAbstractViewTableRecord class.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.LayerState
Returns the name of the layer state. The caller is responsible for creating the layer state and storing it into the ACAD_LAYERSTATES dictionary. Passing in null will clear the layer state from the view.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.LiveSection
Returns a live section to be associated with a view. During the restoration of a view, it's associated live section is enabled.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.Thumbnail
Returns the packed BITMAPINFO structure of the thumbnail with the thumbnail data following it immediately in memory. It can be set to null if no thumbnail is desired for this view.