Autodesk.AutoCAD.DatabaseServices.IdMapping.#ctor
Default constructor. The new IdMapping object is initialized as follows:.

Autodesk.AutoCAD.DatabaseServices.IdMapping.Delete(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function searches the IdMapping ID map for an entry that has a key matching key. If a matching entry is found, it is deleted from the ID map.
key:  Input objectId which is the key of the ID pair to be deleted from the map