Autodesk.AutoCAD.Geometry.NurbCurve2d
This .Net class wraps AcGeNurbCurve2d ObjectARX class. This class represents non-uniform rational B-spline in 2D space.

Autodesk.AutoCAD.Geometry.NurbCurve2d.#ctor(System.Int32,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,System.Boolean)
Constructs a 2D rational spline by a knot vector, control points, and weights. If the spline is rational, control points and weights must have same length..
degree:  Input the degree of the spline.
knots:  Input an array of knot values, partitioning the spline's domain into rational pieces.
controlPoints:  Input an array of 2D control points.
weights:  Input an array of weight values.
periodic:  Input a flag indicating whether the spline is a periodic.

Autodesk.AutoCAD.Geometry.NurbCurve2d.#ctor(System.Int32,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point2dCollection,System.Boolean)
This .NET method wraps the ObjectARX method..

Autodesk.AutoCAD.Geometry.NurbCurve2d.#ctor
Default constructor. This is only a placeholder. No data is stored.

Autodesk.AutoCAD.Geometry.NurbCurve2d.GetFitTangents
Returns the fit tangents of spline. Returns false if spline was not constructed from fit points.

Autodesk.AutoCAD.Geometry.NurbCurve2d.GetFitPointAt(System.Int32)
Returns the fit point corresponding to the specified index. Returns true if index is greater than or equal to 0 and less than the total number of fit points.
index:  Input index of fit point

Autodesk.AutoCAD.Geometry.NurbCurve2d.GetWeightAt(System.Int32)
Resets the weight of the specified control point. index must be greater than or equal to 0 and less than the number of control points.
index:  Input index to weights

Autodesk.AutoCAD.Geometry.NurbCurve2d.GetParametersOfC1Discontinuity(Autodesk.AutoCAD.Geometry.Tolerance)
Returns parameter values of all points on the spline where the tangent vector is not continuous. These will be points where the tangent vector just to the left of the point is not equal to the tangent vector just to the right of the point. The returned parameter values will only be at spline knot values.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.NurbCurve2d.GetParametersOfG1Discontinuity(Autodesk.AutoCAD.Geometry.Tolerance)
Returns parameter values of all points on the spline where the tangent vector is not continuous. These will be points where the tangent vector just to the left of the point does not have the same direction as the tangent vector just to the right of the point. The returned parameter values will only be at spline knot values.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
If spline was not created with fit data, this function returns false. Otherwise, the fit point at the specified index is reset to the new value.
index:  Input index of fit point that is to be modified
point:  Input new fit point

Autodesk.AutoCAD.Geometry.NurbCurve2d.AddFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
If spline was not created with fit data, this function returns false. Otherwise, a new fit point is added at the specified index. The fit point that was formerly at index is moved to index+1, index+1 gets moved to index+2, etc. index must be greater than or equal to 0 and less than or equal to the number of fit points.
index:  Input index of fit point that is to be added
point:  Input new fit point

Autodesk.AutoCAD.Geometry.NurbCurve2d.DeleteFitPointAt(System.Int32)
If spline was not created with fit data, this function returns false. Otherwise, the fit point at the specified index is deleted.
index:  Input index of fit point that is to be deleted

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitTangents(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
If spline was not created with fit data, this function returns false. Otherwise, the spline is recomputed using the new start and end tangent vectors.
startTangent:  Input new start tangent vector
endTangent:  Input new end tangent vector

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitData(System.Int32,Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Tolerance)
Recomputes the spline from the input fit points and makes it of the specified degree. If fitTolerance is not 0, then the constructed spline may not pass through the fit points. But the maximum distance from any fit point to the constructed spline will be no greater than fitTolerance.
degree:  Input new degree of spline
fitPoints:  Input new fit points
fitTolerance:  Input tolerance to which spline will fit the interpolation points

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitData(Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance,System.Boolean)
Recomputes the spline from the input fit points, start and end tangents, and fit tolerance..
fitKnots:  Input new knot values
fitPoints:  Input new fit points
startTangent:  Input new start tangent vector
endTangent:  Input new end tangent vector
fitTolerance:  Input tolerance to which spline will fit the interpolation points
periodic:  Input indicating whether spline should be made periodic

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitData(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
Recomputes the spline from the input fit points, start and end tangents, and fit tolerance. If fitTolerance is not 0, then the constructed spline may not pass through the fit points, but the maximum distance from any fit point to the constructed spline will be no greater than fitTolerance.
fitPoints:  Input new fit points
startTangent:  Input new start tangent
endTangent:  Input new end tangent
fitTolerance:  Input tolerance to which spline will fit the interpolation points

Autodesk.AutoCAD.Geometry.NurbCurve2d.PurgeFitData
Deletes all fit data used to construct the spline. This function does not change the definition of the spline (that is, does not change the control points, knots, or weights).

Autodesk.AutoCAD.Geometry.NurbCurve2d.AddKnot(System.Double)
Adds new knot to the spline knot sequence. If the newKnot value is already a knot, then this function does nothing.
newKnot:  Input new knot value to be inserted into the knot vector of the spline

Autodesk.AutoCAD.Geometry.NurbCurve2d.InsertKnot(System.Double)
Adds new knot to the spline knot sequence. If the newKnot value is already a knot, then the multiplicity of the knot is increased by 1.
newKnot:  Input new knot value to be inserted into the knot vector of the spline

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetWeightAt(System.Int32,System.Double)
Resets the weight of the specified control point. index must be greater than or equal to 0 and less than the number of control points.
index:  Input index of control point
value:  Input new weight to be assigned to control point

Autodesk.AutoCAD.Geometry.NurbCurve2d.JoinWith(Autodesk.AutoCAD.Geometry.NurbCurve2d)
Recomputes spline by joining input spline to this spline. Neither spline may be closed and the start point of the input spline must be equal to the endpoint of this spline.
curve:  Input spline to be joined with this spline

Autodesk.AutoCAD.Geometry.NurbCurve2d.HardTrimByParams(System.Double,System.Double)
Trims the spline to the new start and end parameters. This is done by adding and removing control points and knots, and is not done by just resetting the interval on which the spline is defined.
newStartParameter:  Input new start parameter of spline
newEndParameter:  Input new end parameter of spline

Autodesk.AutoCAD.Geometry.NurbCurve2d.MakeRational(System.Double)
If the spline is not already rational, then it is made rational and each control point is assigned the specified weight. If the spline is already rational, the weight at each control point is multiplied by the input weight.
weight:  Input weight to be assigned to each control point

Autodesk.AutoCAD.Geometry.NurbCurve2d.MakePeriodic
Make a spline into a periodic spline. It converts a spline defined by clamped format into unclamped format. If a spline is not closed, we will make it closed first.

Autodesk.AutoCAD.Geometry.NurbCurve2d.MakeNonPeriodic
Make a periodic spline non-periodic. It converts a spline from unclamped format into clamped format by inserting full knot multiplicity at start and end point.

Autodesk.AutoCAD.Geometry.NurbCurve2d.MakeOpen
If the spline is closed and if,.

Autodesk.AutoCAD.Geometry.NurbCurve2d.NumWeights
Returns number of weights for the spline. This will be 0 if the spline is not rational or equal to the number of control points if the spline is rational.

Autodesk.AutoCAD.Geometry.NurbCurve2d.DefinitionData
Returns all data that defines the spline. If spline is not rational, weights array will be empty.