Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.#ctor
Default constructor. Creates an empty instance.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.GetContours
This function provides access to the curve boundary geometry for the boundaries on the surface. They are obtained as an array of CurveBoundary instances. Each of these instances in general consists of an array of oriented 3D curves or 3D positions, and an array of oriented parameter space curves. For any given 3D space entity, the corresponding parameter space curve may not be present. In such instances, the entry at that index of the corresponding parameter space curve array would be NULL.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.SetToOwnSurface
Forces this instance to own its definition data. If the current instance is the owner, then this is non-operational. Otherwise, this method makes a copy of the surface definition data such that it owns that geometry.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsDefined
Determines whether the instance is empty. Returns true if the instance does have a surface definition. Otherwise it returns false, implying an empty instance.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.BaseSurface
This function provides access to the unbounded surface geometry (that is, unbounded other than by the parametric bounds, if applicable, of the surface). The output surface has been converted to a native surface if an appropriate native surface type exists for it.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.ExternalBaseSurface
Access to the external entity in its native form. A caller having access to the precise definition of the external entity can use that knowledge to gain efficient access to the entity in its native form.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsPlane
Determines the type of the unbounded base surface. Returns true if the base surface is a plane.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsSphere
Determines the type of the unbounded base surface. Returns true if the base surface is a sphere.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsCylinder
Determines the type of the unbounded base surface. Returns true if the base surface is a cylinder.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsCone
Determines the type of the unbounded base surface. Returns true if the base surface is a cone.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsTorus
Determines the type of the unbounded base surface. Returns true if the base surface is a torus.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsNurbs
Determines the type of the unbounded base surface. Returns true if the base surface is NURBS.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsExternalSurface
Determines the type of the unbounded base surface. Returns true if the base surface is an external surface. If none of the other type inquiries (isCone, isCylinder, isNurbs, isPlane, isSphere, isTorus) is true, but the object is defined, then isExternaSurface must be true.