Autodesk.AutoCAD.Runtime.ProgressMeter.Start
Sets the progress meter to its initial reading and make it visible. You may choose to display the string passed into the method. Do not modify this string after passing it to Start().

Autodesk.AutoCAD.Runtime.ProgressMeter.Start(System.String)
Sets the progress meter to its initial reading and make it visible. You may choose to display the string passed into the method. Do not modify this string after passing it to Start().
displayString:  Input optional string to display with the meter.

Autodesk.AutoCAD.Runtime.ProgressMeter.MeterProgress
You should maintain a long data member to count the number of times MeterProgress() has been called. By comparing this value to that provided by SetLimit(), you will be able to calculate and display what percentage of the calculation or operation has completed.