Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor
This wraps the AcGsKernelDescriptor class. Effectively an array of UniqueString objects that describes the Graphics System Kernel.

Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor.addRequirement(Autodesk.AutoCAD.UniqueString)
Require support for a given capability. Effectively the same as addSupport but used for different documentary purposes.

Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor.supports(Autodesk.AutoCAD.UniqueString)
Query support for a given capability. Effectively the same as requires but used for different documentary purposes.
capability:  String describing the graphics capability.