Autodesk.AutoCAD.DatabaseServices.SecurityParameters.TimeServer
Returns the name of the time server used for timestamping. The name must be provided as a wide-char string in the format “Description(server_name)”. An example is “Natl Inst of Standards and Technology(time.nist.gov)”.