Autodesk.AutoCAD.Geometry.Matrix3d.PreMultiplyBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Sets this matrix to the product leftSide * (this matrix). Returns the reference to this matrix.
leftSide:  Input left side of matrix

Autodesk.AutoCAD.Geometry.Matrix3d.PostMultiplyBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Sets this matrix to the product (this matrix) * rightSide. Returns the reference to this matrix.
rightSide:  Input right side of matrix

Autodesk.AutoCAD.Geometry.Matrix3d.Rotation(System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Point3d)
Returns the matrix of the rotation by angle angle around the axis with vector axis passing through the point center. The direction of the rotation is defined by right-hand rule.
angle:  Input angle of rotation
axis:  Input axis of rotation
center:  Input origin point of rotation

Autodesk.AutoCAD.Geometry.Matrix3d.Mirroring(Autodesk.AutoCAD.Geometry.Point3d)
Returns the matrix of mirroring with respect to pointValue. This is the same as central symmetry with a center point.
pointValue:  Input point of symmetry

Autodesk.AutoCAD.Geometry.Matrix3d.Projection(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Vector3d)
Returns the matrix of the parallel projection into the plane projectionPlane. The direction of the projection is defined by the vector projectDir.
projectionPlane:  Input projection plane
projectDir:  Input projection direction

Autodesk.AutoCAD.Geometry.Matrix3d.GetScale
Returns scale factor of matrix. The returned scale is the square root of the maximum length of the three column vectors.

Autodesk.AutoCAD.Geometry.Matrix3d.ToArray
This method returns this matrix as a 1-dimensional array containing 16 elements of type System.Double. The array elements store the matrix row (rn) and column (cn) indices in the following order:.