Autodesk.AutoCAD.GraphicsInterface.Viewport.GetNumPixelsInUnitSquare(Autodesk.AutoCAD.Geometry.Point3d)
In perspective mode, the WCS unit square gets smaller and encompasses fewer pixels as it recedes away from the camera, whereas in non-perspective mode, the unit square stays the same size no matter how far away from the camera. So, if perspective mode is on in the viewport, then givenWorldPoint is used as the center of the unit square so that the distance from the camera to the point will be reflected in the pixel values. If perspective mode is not on, then givenWorldPoint is not used, since location has no effect on pixel count.
givenWorldPoint:  Input WCS point for the center point of the display coordinate unit square

Autodesk.AutoCAD.GraphicsInterface.Viewport.LayerVisible(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if the layer is not frozen in this viewport and not globally frozen. Indicating that geometry on this layer should be regenerated.
idLayer:  Input layer to be investigated

Autodesk.AutoCAD.GraphicsInterface.Viewport.IsPerspective
Returns true if perspective mode is in effect. Otherwise, returns false.

Autodesk.AutoCAD.GraphicsInterface.Viewport.CameraLocation
Returns camera location to the viewport camera's world coordinate location. This is where the viewport's "eye" would be in world space.

Autodesk.AutoCAD.GraphicsInterface.Viewport.CameraTarget
Returns the camera target location point to the viewport camera's world coordinate target. This is a point where the viewport's "eye" is aimed in world space.

Autodesk.AutoCAD.GraphicsInterface.Viewport.CameraUpVector
Returns the camera "up" direction vector to the viewport camera's world coordinate "up" vector. This is the world space vector reference that the viewport's "eye" aligns itself with.

Autodesk.AutoCAD.GraphicsInterface.Viewport.ViewportId
Returns the viewport ID. This is an AcGi-specific ID that has no relation to the AutoCAD CVPORT system variable. This ID is used by the ViewportDraw.isValidId() function to determine if a viewport is still valid.

Autodesk.AutoCAD.GraphicsInterface.Viewport.AcadWindowId
Returns the Viewport index number of the viewport being drawn to. This is the same index that the AutoCAD CVPORT system variable works with. So, if the viewport being drawn to is the current viewport in AutoCAD, then the value reported by the CVPORT system variable will match the value returned by this function.

Autodesk.AutoCAD.GraphicsInterface.Viewport.FrontAndBackClipping
Fills in the parameters with information about the existence and location of front and back display clipping planes. Clipping planes are always perpendicular to the camera target vector. When active, the geometry in front of the front clipping plane or in back of the back clipping plane is not displayed.

Autodesk.AutoCAD.GraphicsInterface.Viewport.LinetypeScaleMultiplier
This is a value supplied by the viewport itself. It is an additional multiplier that is used affecting all linetypes displayed in this viewport.

Autodesk.AutoCAD.GraphicsInterface.Viewport.LinetypeGenerationCriteria
During linetype elaboration of ever smaller objects, a point is reached where the dashes are so small as to be indistinguishable from a continuous line. The viewport defines a value which is used to determine whether or not further linetyping should be carried out for a given object.

Autodesk.AutoCAD.GraphicsInterface.Viewport.ViewDirection
Returns the current view direction of the viewport. This value can be calculated from the target and camera points in WCS:.