Autodesk.AutoCAD.DatabaseServices.PointCloudCrop
This class defines a cropping boundary for the PointCloudEx entity. Each cropping boundary contains a plane which locates the boundary, a cropping type, a flag indicating whether we want what is inside or outside the region, another flag indicating whether the results of this cropping boundary should be inverted.