Autodesk.AutoCAD.Geometry.Interval
This .NET class wraps the AcGeInterval ObjectARX class. It represents a finite or semi-infinite interval as the real axis whose bounds are defined with some given tolerance.

Autodesk.AutoCAD.Geometry.Interval.#ctor(System.Boolean,System.Double,System.Double)
Constructor that creates an interval with the upper bound equal to bound. If the value of the argument boundedBelow is true, then it sets the lower bound also to bound, otherwise the interval remains unbounded below. Sets the boundary tolerance to the value tolerance.
boundedBelow:  Whether to set a lower bound or leave interval unbounded below
bound:  Upper or lower bound
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Interval.#ctor(System.Double,System.Double,System.Double)
Constructor that creates the finite interval with the lower bound equal to lower and the upper bound equal to upper . The boundary tolerance is set to the value tolerance.
lower:  Lower bound
upper:  Upper bound
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Interval.GetBounds
Returns lower and upper bounds of this interval. The bound has a meaningful value only if this interval is bounded in the corresponding direction.

Autodesk.AutoCAD.Geometry.Interval.Subtract(Autodesk.AutoCAD.Geometry.Interval)
The empty result is indicated by a return value of 0. If the result is a single interval, then it returns 1, and the result is in lInterval. If the result is two intervals, then it returns 2 with the left result in lInterval and the right result in rInterval. This occurs only if the other interval is entirely contained within this interval (without touching at the ends).
otherInterval:  Input interval with which to merge

Autodesk.AutoCAD.Geometry.Interval.IntersectWith(Autodesk.AutoCAD.Geometry.Interval)
Returns true and the intersection of this interval and the interval otherInterval in the output argument result, if they are not disjoint up to the boundary tolerance. Returns false otherwise.
otherInterval:  Input interval with which to merge

Autodesk.AutoCAD.Geometry.Interval.IsDisjoint(Autodesk.AutoCAD.Geometry.Interval)
Returns true, if this interval does not intersect the interval otherInterval is bounded within the boundary tolerance of this interval. Returns false otherwise.
otherInterval:  Input terval against which to test

Autodesk.AutoCAD.Geometry.Interval.Contains(System.Double)
Returns true if the value value belongs to this interval with the boundary tolerance of this interval. Returns false otherwise.
value:  Input value

Autodesk.AutoCAD.Geometry.Interval.Contains(Autodesk.AutoCAD.Geometry.Interval)
Returns true if the interval otherInterval belongs to this interval with the boundary tolerance of this interval. Returns false otherwise.
otherInterval:  Input interval against which to test

Autodesk.AutoCAD.Geometry.Interval.IsContinuousAtUpper(Autodesk.AutoCAD.Geometry.Interval)
Returns true if this interval is bounded above, the interval otherInterval is bounded below, and upper bound of this interval is equal to the lower bound of the otherInterval within the boundary tolerance of this interval. Returns false otherwise.
otherInterval:  Input terval against which to test

Autodesk.AutoCAD.Geometry.Interval.IsOverlapAtUpper(Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval)
Returns true if this interval is bounded above, the interval otherInterval is bounded below, both of them are not singleton, their intersection is not empty and does not coincide with this interval, the upper bound of this interval is contained in otherInterval, and the lower bound of otherInterval is contained in this interval. In this case, the function returns the intersection interval in the output argument overlap. If these conditions are not met, the function returns false.
otherInterval:  Input interval against which to test
overlap:  Output intersection interval, if true

Autodesk.AutoCAD.Geometry.Interval.IsEqualAtUpper(System.Double)
Returns true if this interval is bounded above and its upper bound is equal to the value within the boundary tolerance of this interval. Returns false otherwise.
value:  Input value against which to test

Autodesk.AutoCAD.Geometry.Interval.IsEqualAtUpper(Autodesk.AutoCAD.Geometry.Interval)
Returns true if both this interval and the interval otherInterval are either unbounded above or bounded above and their upper bounds are equal within the boundary tolerance of this interval. Returns false otherwise.
otherInterval:  Input value against which to test

Autodesk.AutoCAD.Geometry.Interval.IsEqualAtLower(System.Double)
Returns true if this interval is bounded below and its lower bound is equal to the value within the boundary tolerance of this interval. Returns false otherwise.
value:  Input value against which to test

Autodesk.AutoCAD.Geometry.Interval.IsEqualAtLower(Autodesk.AutoCAD.Geometry.Interval)
Returns true if both this interval and the interval otherInterval are either unbounded below or bounded below and their lower bounds are equal within the boundary tolerance of this interval. Returns true otherwise.
otherInterval:  Input value against which to test

Autodesk.AutoCAD.Geometry.Interval.IsPeriodicallyOn(System.Double,System.Double&)
Returns true if there exists an integer N such that this interval contains the value val + N * period. Returns false otherwise.
period:  Input period length
value:  Output System.Double object; Output value, if True

Autodesk.AutoCAD.Geometry.Interval.Tolerance
Returns the boundary tolerance of this interval. Returns the reference to this interval.

Autodesk.AutoCAD.Geometry.Interval.IsBounded
Returns true if this interval is bounded in both directions. Returns false otherwise.

Autodesk.AutoCAD.Geometry.Interval.IsBoundedAbove
Returns true if this interval is bounded above. Returns false otherwise.

Autodesk.AutoCAD.Geometry.Interval.IsBoundedBelow
Returns true if this interval is bounded below. Returns false otherwise.

Autodesk.AutoCAD.Geometry.Interval.IsUnbounded
Returns true, if this interval is unbounded in either one of two directions. Returns false otherwise.

Autodesk.AutoCAD.Geometry.Interval.IsSingleton
Returns true if this interval is bounded and the lower bound is equal to the upper bound within the boundary tolerance. Returns false otherwise.