Autodesk.AutoCAD.Geometry.CircularArc3d
This .NET class wraps the AcGeCircArc3d ObjectARX class. It represents both full circles and circular arcs in 3D space.

Autodesk.AutoCAD.Geometry.CircularArc3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs an arc through three points. None of the three points may be coincindent and they may not be colinear. This constructor always constructs a bounded arc and cannot be used to construct a full circle.
startPoint:  Input start point of arc
endPoint:  Input endpoint of arc
pnt:  Input point on arc

Autodesk.AutoCAD.Geometry.CircularArc3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Constructs a full circle with the given center, normal vector, and radius. The radius must not be 0. The constructed circle is oriented counterclockwise about the normal vector.
center:  Input center of arc
normal:  Input normal vector of arc
radius:  Input radius of arc

Autodesk.AutoCAD.Geometry.CircularArc3d.#ctor
Default constructor. Constructs a full circle in the XY plane (normal vector (0,0,1) with center (0,0,0) and radius 1.

Autodesk.AutoCAD.Geometry.CircularArc3d.GetTangent(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
This function returns true if the input point lies on the full circle of the arc; otherwise, it returns false. If it returns true, line is set to the tangent line to the circle at the input point.
pointValue:  Input point on full circle
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.CircularArc3d.IsInside(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input point lies inside the arc. This function treats the arc as a full circle even if it is bounded, and determines if the input point lies inside the full circle. Returns a value of false if the point lies on or outside the circle, or does not lie on the same plane as the arc.
pointValue:  Input any 3D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.CircularArc3d.SetAxes(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes the normal vector and reference vector of the arc to the specified vectors. The two input vectors must be perpendicular to each other.
normal:  Input normal vector of arc
referenceVector:  Input reference vector of arc

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,System.Double,System.Double,System.Double)
Changes the definition of the arc to be tangent to the two input curves and have the specified radius. The two input curves must be coplanar.
curve1:  Input any 3D curve
curve2:  Input any 3D curve
radius:  Input radius of arc
param1:  Input parameter value on curve1 where arc touches curve
param2:  Input parameter value on curve2 where arc touches curve

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Changes the definition of the arc to have the specified start and endpoints and pass through pointOnArc. None of the three points may be coincident and they may not be collinear.
startPoint:  Input start point of arc
pointOnArc:  Input point on arc
endPoint:  Input endpoint of arc

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
Changes the definition of the arc to have the specified center, normal vector, radius, start angle, and end angle. Angles are measured by drawing a vector between a point on the arc and the center point and taking the angle between this vector and referenceVector. The angle is measured in a counterclockwise direction about the normal vector. normal must be perpendicular to referenceVector and endAngle must be greater than startAngle. To construct a full circle, the difference between endAngle and startAngle should be 2 x Pi.
center:  Input center of arc
normal:  Input normal vector of arc
referenceVector:  Input reference vector from which arc angles are measured
radius:  Input radius of arc
startAngle:  Input angle of start point of arc
endAngle:  Input angle of endpoint of arc

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Changes the arc definition to be a full circle with the given center, normal vector, and radius. The radius must not be 0. The circle will be oriented counterclockwise about the normal vector.
center:  Input center of arc
normal:  Input normal vector of arc
radius:  Input radius of arc

Autodesk.AutoCAD.Geometry.CircularArc3d.Normal
Returns the normal vector of the arc. The arc is oriented in a counterclockwise direction about this vector. This function always returns a unit vector.

Autodesk.AutoCAD.Geometry.CircularArc3d.ReferenceVector
Returns the reference vector of the arc. The reference vector is the vector from which the start and end angles of the arc are measured. This vector is perpendicular to the normal vector. This function always returns a unit vector.

Autodesk.AutoCAD.Geometry.CircularArc3d.Radius
Returns the radius of the arc.