Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetDragStatus(Autodesk.AutoCAD.DatabaseServices.DragStatus)
This function is called when a drag operation involving this entity is starting, ending, or aborting. The status argument provides information about what is happening with the drag operation.
status:  Value describing the status of the drag operation; one of the values from the DragStat enumeration

Autodesk.AutoCAD.DatabaseServices.SubDMesh.ConvertToSurface(System.Boolean,Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetObjectMesh(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.MeshFaceterData)
Tessellates existing solid or surface object to mesh data using the given faceter settings. The mesh data includes the vertex array, face list array and face data.
dbObj:  Input object to get the mesh.
faceterData:  Input faceter setting information.