Autodesk.AutoCAD.DatabaseServices.PolygonMesh.#ctor
Default constructor. Initializes the polyline flag to 16 (indicating a PolygonMesh open in both M and N directions). Initializes to 0 the MeshType, vertices in M direction, vertices in N direction, Smooth surface density in M direction, and Smooth surface density in N direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MakeMClosed
This function sets the PolygonMesh to be closed in the M direction. This means that the mesh will be treated as continuous from the last row on to the first row.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MakeMOpen
This function sets the PolygonMesh to be open in the M direction. This means that the mesh will be discontinuous between the last row and the first row.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MakeNClosed
This function sets the PolygonMesh to be closed in the N direction. This means that the mesh will be treated as continuous from the last column on to the first column.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MakeNOpen
This function sets the PolygonMesh to be open in the N direction. This means that the mesh will be discontinuous between the last column and the first column.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.Straighten
This function removes all spline-fit vertices and restores the original control point polygon mesh. This operation performs the same modification as the PEDIT command "Desmooth" option.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.SurfaceFit
This function will fit a smooth surface to a control point mesh defined by vertices of this polygonal mesh. This operation performs the same modification as the PEDIT command "Smooth surface" option.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MSize
Accesses the vertex count in the M direction. This is the number of vertices that will be used to make up an M row in the PolygonMesh if the PolyMeshType is SimpleMesh. For any other PolyMeshType, the M surface density value will be used as the row size.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.NSize
Accesses the vertex count in the N direction. This is the number of vertices that will be used to make up an N column in the PolygonMesh if the PolyMeshType is SimpleMesh. For any other PolyMeshType, the N surface density value will be used as the column size.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.NSurfaceDensity
Accesses the surface density in the N direction. The N surface density is the number of vertices in the N direction after a surface fit operation is performed. This value is used in place of the N size value if the PolyMeshType is anything other than SimpleMesh.