Autodesk.AutoCAD.DatabaseServices.ViewRepBlockReference.OwnerViewportId
This property returns the ObjectID of the associated model documentation view's Viewport entity. Return value is Autodesk.AutoCAD.DatabaseServices.ObjectId.