Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetTrueColors(Autodesk.AutoCAD.Colors.EntityColor[])
Sets the true colors for this entity to colors.The colors array must have the same number of elements as there are edges in the mesh or shell with which it is used. The array elements control individual edge colors. The order of the array elements corresponds to the order of the edges in the mesh or shell. The first array element is used as the color for the first mesh or shell edge, the second element for the second edge, and so on.
colors:  Input array of EntityColor objects

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetLayers(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Sets layers to be the array of LayerTableRecord object IDs used by this object. The array must have exactly the same number of elements as there are edges in the mesh or shell it is used with.
layers:  Input array of LayerTableRecord object IDs.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetLineTypes(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Sets lineTypes to be the array of LinetypeTableRecord object IDs used by this object.The array must have exactly the same number of elements as there are edges in the mesh or shell it is used with. The array elements control the linetypes used for the mesh or shell edges--the first array element specifies the linetype used for the first edge, the second element for the second edge, etc.
lineTypes:  Input array of LinetypeTableRecord object IDs

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetLayers
Returns the array of LayerTableRecord object IDs, one for each edge in the mesh or shell with which this object is used. If the layer ID array has not been set, an empty array is returned.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetLineTypes
Returns the array of LinetypeTableRecord object IDs, one for each edge in the mesh or shell with which this object is used. If the linetype ID array has not been set, an empty array is returned.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetSelectionMarkers
Returns a pointer to an array of graphic system selection markers (gsmarkers), one for each edge in the mesh or shell the EdgeData object is used with. If the selectionMarker's data array has not been set, then NULL is returned.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetVisibility
Returns a pointer to an array of visibility flags (that is, 0 == invisible, 1 == visible), one for each edge in the mesh or shell the EdgeData object is used with. If the visibility flags data array has not been set, then NULL is returned.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetSelectionMarkers(System.IntPtr[])
Sets selectionMarkers to be the array of graphics system selection markers (gsmarkers) used by the EdgeData object. The array must have exactly the same number of elements as there are edges in the mesh or shell it is used with.
selectionMarkers:  Input array of non-zero graphic system selection markers.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetVisibility(System.Byte[])
Sets visibility to be the array of edge visibility flags used by this object. The array must have exactly the same number of elements as there are edges in the mesh or shell it is used with.
visibility:  Input array of visibility flags

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetColors
Returns an array of AutoCAD color indices, one for each edge in the mesh or shell with which this object is used. If the colors array has not been set, an empty array is returned.