Autodesk.AutoCAD.DatabaseServices.Light.SetHotspotAndFalloff(System.Double,System.Double)
Sets the hotspot and falloff angles. The region between the hotspot and falloff angles is sometimes referred to as the rapid decay area.
hotspot:  Input the hotspot cone angle, in radians. Defines the brightest part of the spot light beam. Must be smaller than or equal to the falloff.
falloff:  Input the falloff cone angle, in radians. Defines the full cone of light. This is also known as the field angle. Must be larger than the hotspot.

Autodesk.AutoCAD.DatabaseServices.Light.ResultingColor
Gets the final color of the light. This is determined by a combination of the Lamp color and the Filter Color. This only applies if LIGHTINGUNITS is set to photometric lighting units (i.e. 1 for American or 2 for International).

Autodesk.AutoCAD.DatabaseServices.Light.LightType
Accesses the type of the light object. Possible values are: SpotLight, PointLight, and DistantLight.

Autodesk.AutoCAD.DatabaseServices.Light.Position
Accesses the position of the light source, in the coordinate space of the current context. (WCS).

Autodesk.AutoCAD.DatabaseServices.Light.TargetLocation
Accesses the position of the light target location, in the coordinate space of the current context. (WCS).

Autodesk.AutoCAD.DatabaseServices.Light.AttenuationType
Accesses the type of attenuation, or decay, for this light. This only applies to point and spot lights. Distant lights always have no attenuation.

Autodesk.AutoCAD.DatabaseServices.Light.MapSize
Accesses the shadow map size. The returned value should be one of: 64, 128, 256, 512, 1024, 2048, or 4096.

Autodesk.AutoCAD.DatabaseServices.Light.PhysicalIntensityMethod
Accesses the physical intensity method of the light. This indicates how the physical intensity of the light is specified, either by peak intensity, flux, or illuminance. This only applies if LIGHTINGUNITS is set to photometric lighting units (i.e. 1 for American or 2 for International).

Autodesk.AutoCAD.DatabaseServices.Light.PhysicalIntensity
Accesses the physical intensity of the light. The units are based on the physical intensity method (i.e. candela if PeakIntensity, lumen if Flux, lux if Illuminance). This only applies if LIGHTINGUNITS is set to photometric lighting units (i.e. 1 for American or 2 for International).

Autodesk.AutoCAD.DatabaseServices.Light.LampColorType
Accesses the lamp color type of the light. This indicates how the lamp color of the light is specified, either as a Kelvin color temperature or a preset lamp color.It only applies if LIGHTINGUNITS is set to photometric lighting units (i.e. 1 for American or 2 for International).

Autodesk.AutoCAD.DatabaseServices.Light.LampColorTemp
Accesses the Kelvin color temperature of the light. This only applies if LIGHTINGUNITS is set to photometric lighting units (i.e. 1 for American or 2 for International), and lamp color type is Kelvin.

Autodesk.AutoCAD.DatabaseServices.Light.LampColorRGB
Accesses the RGB value for the light's lamp color. This only applies if LIGHTINGUNITS is set to photometric lighting units (i.e. 1 for American or 2 for International).

Autodesk.AutoCAD.DatabaseServices.Light.WebFile
Accesses the path to the file containing the light's goniometric data (e.g. Illuminating Engineering Society or IES file). Only applies if LIGHTINGUNITS is set to photometric lighting units (i.e. 1 for American or 2 for International).

Autodesk.AutoCAD.DatabaseServices.Light.WebRotation
Accesses the rotation offset used to orient the goniometric data relative to the light orientation. This only applies if LIGHTINGUNITS is set to photometric lighting units (i.e. 1 for American or 2 for International).