Autodesk.AutoCAD.DatabaseServices.Region.#ctor
Default constructor. Initializes the change count to 0 and IsNull to true.

Autodesk.AutoCAD.DatabaseServices.Region.CreateFromCurves(Autodesk.AutoCAD.DatabaseServices.DBObjectCollection)
This static member function creates a set of Region objects from the closed loops represented by the curves contained in the curveSegments collection. The newly created region objects are returned in the regions array.
curveSegments:  Input collection to curve entities used to define the region's perimeter(s)

Autodesk.AutoCAD.DatabaseServices.Region.AreaProperties(Autodesk.AutoCAD.Geometry.Point3d&,Autodesk.AutoCAD.Geometry.Vector3d&,Autodesk.AutoCAD.Geometry.Vector3d&)
This function calculates the area properties of the Region. All of the values in the returned RegionAreaProperties struct are in the coordinate system specified by origin, xAxis, and yAxis (which must be in WCS coordinates). The function validates the origin, xAxis, and yAxis parameters to ensure that the axes are of unit length and are perpendicular to each other, and that the axes and origin lie in the same plane as the Region.
origin:  Input point (in WCS coords) for origin of the coordinate system to usefor evaluation.
xAxis:  Input X axis (in WCS coords) of the coordinate system to use forevaluation.
yAxis:  Input Y axis (in WCS coords) of the coordinate system to use forevaluation.

Autodesk.AutoCAD.DatabaseServices.Region.Area
Accesses the surface area of the region. The area is in square drawing units.

Autodesk.AutoCAD.DatabaseServices.Region.Normal
Accesses the normal vector of the region. Normal is in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Region.UsesGraphicsCache
This property is a wrapper for the AcDbRegion::usesGraphicsCache() method which is used by AutoCAD to determine whether or not to use cached graphics for the region. If the method returns true, then cached graphics will be used. Only database resident entities can use graphics caching, so this method is not called for entities not in an AcDbDatabase.