Autodesk.AutoCAD.DatabaseServices.Ellipse.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
This constructor is used to create an Ellipse using the values passed in. The center, unitNormal and majorAxis are used to calculate the start point. The majorAxis vector represents half the major axis of the ellipse (that is, from the center point to the start point of the ellipse) and is the zero angle for startAngle and endAngle. Positive angles are counter-clockwise when looking down the normal vector (that is, right-hand rule). A startAngle of 0 and endAngle of 2pi will produce a closed Ellipse.
center:  Input center of the ellipse
unitNormal:  Input vector specifying normal, which determines the plane of the ellipse
majorAxis:  Input vector which represents 1/2 the major axis of the ellipse
radiusRatio:  Input ratio of the major radius to the minor radius
startAngle:  Input start angle of the ellipse in radians
endAngle:  Input end angle of the ellipse in radians

Autodesk.AutoCAD.DatabaseServices.Ellipse.#ctor
Default constructor. Initializes to circle of radius 1 in XY plane with center (0,0,0).

Autodesk.AutoCAD.DatabaseServices.Ellipse.GetParameterAtAngle(System.Double)
Returns the first period parameter value at angle (in radians). The parameter value is in the range 0 to 2pi.
angle:  Input angle (in radians) at which the parameter is desired

Autodesk.AutoCAD.DatabaseServices.Ellipse.GetAngleAtParameter(System.Double)
This function returns the first period equivalent of the angle at the value location on the ellipse. The returned angle will be in the range -pi to pi.
value:  Input parameter to evaluate

Autodesk.AutoCAD.DatabaseServices.Ellipse.RadiusRatio
Accesses the ratio of the ellipse's major radius to its minor radius. The value will be in the range 1e-6 to 1.0.

Autodesk.AutoCAD.DatabaseServices.Ellipse.StartAngle
Accesses the first period equivalent of the start angle (in radians) of the ellipse. The angle will be in the range -pi to pi.

Autodesk.AutoCAD.DatabaseServices.Ellipse.MajorRadius
Accesses the major radius of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.MinorRadius
Accesses the minor radius of the ellipse.