Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.#ctor
Default constructor. Initializes the arc point angle center point and extension lines 1 & 2 start points all to (0,0,0). In addition, all the initializations of the default constructor for Dimension, Entity, and others, are performed.

Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.XLine2Point
Accesses the dimension definition point (in WCS coordinates) that is used for the start point of the second extension line of the dimension. This point and the dimension's center point (which is located at the angle's vertex) define one side of the angle being dimensioned.