Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId.#ctor(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Constructor. Just keeps the given SubentityId.

Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId)
Returns true if this and the other AssocSimplePersSubentityId reference exactly the same subentity of the same entity. It simply compares the stored SubentityIds.
entity:  The entity owning the subentities of this and the other AssocPersSubentityId.
other:  The other AssocSimplePersSubentityId.