Autodesk.AutoCAD.DatabaseServices.AnnotationScale.Name
Accesses the name of the annotation scale. Annotation scale names are not guaranteed to be unique.

Autodesk.AutoCAD.DatabaseServices.AnnotationScale.PaperUnits
The paper units must be positive and non-zero. Annotation scales are described as a ratio of paper units to drawing units. For example a scale of 1 inch = 1 foot has a paper units scale of 1.0, and a drawing units scale of 12.0, for an effective scale of 0.083.