Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.#ctor
Default constructor. Initializes the face and vertex counts to 0.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.NumVertices
Accesses the number of point coordinate vertices in the vertex list of the PolyFaceMesh. This count does not include the FaceRecords in the vertex list.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.NumFaces
Accesses the number of faces in the PolyFaceMesh. For PolyFaceMeshes created via the ObjectARX API, this value will accurately reflect the number of FaceRecords that have been appended to the PolyFaceMesh. For PolyFaceMeshes created via the AutoCAD PFACE command, it is possible for this value to be lower than the number of FaceRecords owned by the PolyFaceMesh.