Autodesk.AutoCAD.Geometry.CompositeCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d[])
Constructs a composite curve from the list of input curves. The input curves should be connected at their endpoints. That is, the start point of each curve in the list (excluding the first curve) should be equal to the endpoint of the previous curve in the list. No check of this is made by the constructor.

Autodesk.AutoCAD.Geometry.CompositeCurve2d.SetCurves(Autodesk.AutoCAD.Geometry.Curve2d[])
Resets the list of curves that make up the composite. The curves in curves are not deleted when the composite is deleted.
curves:  Input Autodesk.AutoCAD.Geometry.Curve2d[] object; array of curves in the composite curve