Autodesk.AutoCAD.DatabaseServices.ActionsToEvaluateCallback.NeedsToEvaluate(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.AssocStatus,System.Boolean)
This callback method is called by AssocAction::getDependentActionsToEvaluate(). It is a mechanism by which getDependentActionsToEvaluate() informs that an AssocAction, AssocDependency, or an DBObject needs to be evaluated and suggests new status for them that the callback implementation should set. If the given ObjectId is not of an action or of a dependency, but of an arbitrary DBObject, the callback implementation should simply recursively call needsToEvaluate() for all dependencies on that object..
objectId:  ObjectId of an AssocAction, AssocDependency or an arbitrary DBObject that needs to be evaluated.
newStatus:  The new evaluation request status of the action or dependency. If it is not an evaluation request, the needsToEvaluate() implementation should not change the status of the action or dependency.
ownedActionsAlso:  If the action that needs to evaluate is an AssocNetwork, this argument controls whether all the actions owned by the network also need to be evaluated. The caller usually passes true.