Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters
This .NET class wraps the AcGiToneOperatorParameters ObjectARX class. ToneOperatorParameters is a container class for all tone operator parameters.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.#ctor
Default constructor. Initializes members to reasonable default values.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.CopyFrom(Autodesk.AutoCAD.Runtime.RXObject)
This .NET method wraps the ObjectARX method. Copies all the tone parameter settings from an Tone Operator object.