Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.TwistAngle
Accesses the angle by which the profile will be twisted as it revolves around the axis. The default value of this option is 0.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.CloseToAxis
Accesses the close to axis option. If this option is set for an open profile, then the ends of the profile will be extended to the axis of revolution before revolving. The default value of this option is false.