Autodesk.AutoCAD.Geometry.ExternalSurface.#ctor
Default constructor. Creates an empty instance.

Autodesk.AutoCAD.Geometry.ExternalSurface.SetToOwnSurface
Forces this instance to own its definition data. If the current instance is the owner, then this is non-operational. This method would make a copy of the surface definition data such that it owns that geometry.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsNurbSurface
Determines whether the external surface instance can be represented by a surface definition that is native to gelib. Returns true if the external surface does have an exact gelib native representation, otherwise it returns false.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsDefined
Determines whether the instance is empty. Returns true if the instance does have a surface definition. Otherwise it returns true, implying an empty instance.