Autodesk.AutoCAD.DatabaseServices.LayoutManager.SetCurrentLayoutId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Accesses the current layout. This will get/set the current layout from the current working database. If you want to get/set current layout from the database other than the current working database, you should set the working database to it first, and then set it back after you get/set the current layout.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.GetLayoutId(System.String)
This function returns the Layout object associated with the given input name. The returned object is not open for reading from or writing to the database by default.
name:  Input name of Layout object to search for

Autodesk.AutoCAD.DatabaseServices.LayoutManager.CreateLayout(System.String)
This function creates a new Layout object given a unique layout name. The default viewports for the new layout are not created until the layout is first activated.
newName:  Input name to give new Layout object

Autodesk.AutoCAD.DatabaseServices.LayoutManager.GetNonRectangularViewportIdFromClipId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function returns the ObjectId for the non rectangular viewport ID associated with the given clipId. Returns NULL if given entity isn't a valid clip entity.
clipId:  Input ObjectId of clip entity to get the nonrectangular viewport ID from
name:  Input name of Layout object to search for.