Autodesk.AutoCAD.DatabaseServices.HatchLoop
This class encapsulates data for defining a hatch boundary loop. See the Hatch.appendLoop(Adesk.Int32 loopType, const Point2dArray vertices, const AcGeDoubleArray bulges) ObjectARX function documentation for information on this data and its use