Autodesk.AutoCAD.DatabaseServices.LinkedData.Clear
Deletes the data. This should be implemented by the derived classes and the implementation should delete the current contents. Base class implementation does nothing.

Autodesk.AutoCAD.DatabaseServices.LinkedData.IsEmpty
Assesses whether the object has data or not. This should be implemented by the derived classes and the implementation should return true if the object is currently empty (i.e. it does not have any data).

Autodesk.AutoCAD.DatabaseServices.LinkedData.Name
Accesses the name of the data. The name can be blank string if there is no name set.