Autodesk.AutoCAD.GraphicsInterface.Linetype
This .NET class wraps the AcGiEdgeStyle::Linetype ObjectARX class. It describes an enumeration representing the types of line patterns that can be displayed to represent an edge.