Autodesk.AutoCAD.DatabaseServices.DecomposeForSaveReplacementRecord
This class encapsulates the three output parameters used by the Object.decomposeForSave() ObjectARX function. These values represent the replacement object if it is non-database-resident, the replacement object's object ID if it is database-resident, and a flag indicating whether xdata should be transferred to the replacement object.