Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.GetSortHandle(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Given an input object ID, this function returns the Handle that indicates the draw order. Entities with lesser handle values are drawn before/behind entities with higher handle values. This handle, sometimes called its "draw order sort key," may have nothing to do with the object ID, and may no longer even exist in the database. Its numerical value is what is of use, not the object it points to.
id:  Input object ID

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.MoveToBottom(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Places all the entities specified in the input object ID array at the beginning of the draw order. The entities being moved retain their relative draw order.
collection:  Collection of object IDs

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.MoveToTop(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Places all the entities specified in the input object ID array at the ending of the draw order. The entities being moved retain their relative draw order.
collection:  Collection of object IDs

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.MoveBelow(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Places all the entities specified in the input object ID array below the specified target entity. The entities being moved retain their relative draw order.
collection:  Collection of object IDs
target:  Target entity

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.MoveAbove(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Places all the entities specified in the input object ID array above the specified target entity. The entities being moved retain their relative draw order.
collection:  Collection of object IDs
target:  Target entity

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.GetFullDrawOrder(System.Byte)
SYstem.
honorSortEntitiesMask:  Input indicating whether to test the host database's $SORTENTS variable

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.SetRelativeDrawOrder(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Takes the object IDs in the input collection and moves them in their current associated draw order slots so that they are drawn in the specified order. If you wish to move or consolidate the draw order slots of these object IDs, use the appropriate movexxx() member function to do so, either before or after calling this member.
collection:  Collection of object IDs