Autodesk.AutoCAD.GraphicsInterface.ColorRGB
This .NET class wraps the AcGiColorRGB ObjectARX class. It's a Color class for storing the color with a red, green, and blue component in double-precision format.