Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.Activate(System.String)
This function is used to activate an OSNAP mode. The input string is compared with local mode strings if it does not begin with "_", and with the global mode strings if it does begin with "_".
mode:  Input custom OSNAP mode string

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.Deactivate(System.String)
Used to deactivate an OSNAP mode. The same search rules apply as for activateOsnapMode().
mode:  Input mode string

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.Glyph
Returns the custom glyph. Returns NULL if a custom glyph is not used.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.DisplayString
Gets the display string. If no display string is set, local mode string will be used as the menu item string.