Autodesk.AutoCAD.DatabaseServices.ShadePlotType
This .NET class wraps the AcDbViewport::ShadePlotType ObjectARX class. This enumerated type defines the shade plot mode of the current viewport. This mode specifies how the current viewport will plot.