Autodesk.AutoCAD.DatabaseServices.Constrained2PointsConstructionLine
This class represents a constrained unbounded construction line node in the owning Assoc2dConstraintGroup. Internally it is made coincident to two ConstrainedPoint objects.