Autodesk.AutoCAD.DatabaseServices.AssocVariableCallback.ValidateNameAndExpression(Autodesk.AutoCAD.DatabaseServices.AssocVariable,System.String,System.String)
Called from AssocVariable.ValidateNameAndExpression(). It lets the client code perform additional checks to decide if a given name and/or expression can be used as a name and/or expression for the given variable.
variable:  The variable whose name and/or expression are being validated.
nameToValidate:  The variable name to validate. May be null.
expressionToValidate:  The variable expression to validate. May be null.