Autodesk.AutoCAD.Geometry.Vector2d.#ctor(System.Double[])
Creates a vector at the origin.

Autodesk.AutoCAD.Geometry.Vector2d.RotateBy(System.Double)
Returns 2D vector which is the result of rotation of this vector. Rotation angle is given by the argument angle, where the positive direction of rotation is considered from X axis to Y axis.
angle:  Input rotation angle

Autodesk.AutoCAD.Geometry.Vector2d.MultiplyBy(System.Double)
Read-only.
value:  Input value to multiply by

Autodesk.AutoCAD.Geometry.Vector2d.GetNormal(Autodesk.AutoCAD.Geometry.Tolerance)
Returns the unit vector codirectional to this vector. The vector is not normalized if its length is less than tolerance.equalVector(), in which case the returned vector is the same as this vector.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector2d.IsUnitLength(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this vector is equal to its normalization. Returns false otherwise.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector2d.IsZeroLength(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this vector is equal to zero vector. Returns false otherwise.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector2d.IsParallelTo(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is parallel to the vector vector. Namely, it checks if after normalization (and negation in case of negative dot product with the vector vector) this vector is within the distance tolerance.equalVector() from the normalization of the vector vector.
vector:  Input vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector2d.IsCodirectionalTo(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
This function checks if this vector is codirectional to the vectorv vec. Namely, it checks if after normalization this vector is within the distance tolerance.equalVector() from the normalization of the vector vec.
vector:  Input vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector2d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is perpendicular to the vector vector. Namely, it checks if after normalization the dot product of this vector with the normalization of the vector vector is less than tolerance.equalVector() in absolute value.
vector:  Input vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector2d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Vector2d)
Returns the vector equal to the product of matrix a and vector b. The order of multiplication is matrix * vector, where vectors are considered as columns.
a:  Input matrix
b:  Input vector