Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.AddToBuffer(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This method adds the Id to an internal buffer maintained by an index iterator. This method can be expected to return true only if the BuffersForComposition property returns true.
id:  Object ID that is being composed, typically output of a previous iterator's Accepts() method or Id property

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.EstimatedHitFraction
Used to prioritize the order in which FilteredBlockIterator objects will be used during a block traversal. If a concrete implementation cannot estimate, it should return 1.0. Returning 0.0 will force the iterator to be the first one used for the traversal. Returning 1.0 will force it to be the last iterator used.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.BuffersForComposition
During use by CompositeFilteredBlockIterator, the way multiple index/filter pairs are handled is through allocating corresponding FilteredBlockIterator objects, and prioritizing their use through the EstimatedHitFraction property. As a result, only the first index iterator does a 'true' index traversal. The remaining are queried for acceptance or rejection of individual Ids through the Accepts() method in most cases.