Autodesk.AutoCAD.GraphicsSystem.Model.AddSceneGraphRoot(Autodesk.AutoCAD.GraphicsInterface.Drawable)
Informs this Model that pRoot is a scene graph root. pRoot will remain cached until either eraseSceneGraphRoot() is called to remove it or the Model is destroyed. AutoCAD uses this method to ensure that the Modelspace Block remains cached even if it there are no viewports (this occurs during the VPORTS command and switches from tilemode to or from layout mode).
pRoot:  Input object that is a scene graph root.

Autodesk.AutoCAD.GraphicsSystem.Model.EraseSceneGraphRoot(Autodesk.AutoCAD.GraphicsInterface.Drawable)
Informs this Model that pRoot is no longer a scene graph root. This will cause the cache for pRoot to be destroyed if pRoot is not viewed by any View objects. If pRoot has been added to an View, it is implicitly registered as a scene graph root and will remain cached until it has been erased from all View objects. View.Erase() calls this method to ensure that pRoot is no longer implicitly registered as a scene graph root.
pRoot:  Input object that was a scene graph root.

Autodesk.AutoCAD.GraphicsSystem.Model.OnModified(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.Drawable)
This notification informs the Graphic System (GS) that the database representation of the specified Drawable has been modified. For maximum efficiency, this should be called only when the geometry, attributes, or child list of the Drawable is modified.
modified:  Input object that has been modified.
parent:  Input optional Drawable parent.

Autodesk.AutoCAD.GraphicsSystem.Model.SetSectioning(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double)
Sets the active live sectioning for the Model. After specifying the sectioning, it needs to be enabled via the EnableSectioning property.
pts:  Input array of co-planar points specifying a sectioning region.
upVector:  Input object that specifies the orientation of the plane containing pts.
top:  Input that specifies the top capping height of the sectioning.
bottom:  Input that specifies the bottom capping height of the sectioning.

Autodesk.AutoCAD.GraphicsSystem.Model.SetSectioning(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d)
Sets the active live sectioning for the Model. After specifying the sectioning, it needs to be enabled via the setEnableSectioning() method.
pts:  Input array of co-planar points specifying a sectioning region.
upVector:  Input object that specifies the orientation of the plane containing pts.

Autodesk.AutoCAD.GraphicsSystem.Model.ViewClippingOverride
Pass true to this method to enable the geometry in a model to ignore the view’s front and back clipping planes (if any). Pass false to this method to ensure that a model respects the view’s clipping planes (this is the default behavior).

Autodesk.AutoCAD.GraphicsSystem.Model.VisualStyleId
Returns the persistent visual style on the model.By default, the view displays models in the visual style assigned to the view. Use this method to direct views to display the model in the specified visual style. Subsequent changes to VisualStyle will automatically reflect in the view. Specify ObjectId.kNull to clear the visual style on the model and revert to displaying with the view visual style.

Autodesk.AutoCAD.GraphicsSystem.Model.VisualStyle
Returns the non-persistent visual style on the model.By default, the view displays models in the visual style assigned to the view. Use this method to direct views to display the model in the specified visual style. The view makes a copy of the passed in visual style, so call this method every time the VisualStyle is changed and the model display needs to be updated.

Autodesk.AutoCAD.GraphicsSystem.Model.BackgroundId
Returns the object ID of the Background-derived object on the view, if one is set. If no background was set, it returns ObjectId.kNull.

Autodesk.AutoCAD.GraphicsSystem.Model.LinetypesEnabled
Returns true if linetypes are currently enabled. Otherwise, returns false.

Autodesk.AutoCAD.GraphicsSystem.Model.SectioningVisualStyle
Returns the visual style to be used for objects on the clipped side of the sectioning. Passing a null object ID indicates that the clipped side should not be drawn. The default style is null.

Autodesk.AutoCAD.GraphicsSystem.Model.ShadowPlaneLocation
Returns the models current ground plane z position in world coordinates. The ground plane is always parallel to the X-Y world plane.The default value is 0.0.