Autodesk.AutoCAD.DatabaseServices.Table.SuppressRegenerateTable(System.Boolean)
This method allows the user to temporarily disable the regeneration of the table object during changes in one or more of its properties..
suppress:  Input boolean value to suppress or enable the regeneration of a table object

Autodesk.AutoCAD.DatabaseServices.Table.IsBackgroundColorNone(System.Int32,System.Int32)
Returns true if the background color for the specified cell in the table is set to no color value. Otherwise, returns false.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBackgroundColorNone(System.Boolean,System.Int32)
This function enables or disables the background color for the specified row type. Different row types can be combined..
value:  Input indicating whether to enable the background color for the specified row type
rowTypes:  Input row types

Autodesk.AutoCAD.DatabaseServices.Table.SetTextStyle(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
This function sets the table object to use the TextStyleTableRecord specified by id for the specified row types. Different row types can be OR'd.
id:  Input TextStyleTableRecord object ID
rowTypes:  Input row types for which to set the text style

Autodesk.AutoCAD.DatabaseServices.Table.SetTextHeight(System.Double,System.Int32)
This function sets the text height for the specified row types. Different row types can be OR'd.
height:  Input text height
rowTypes:  Input row types

Autodesk.AutoCAD.DatabaseServices.Table.SetGridVisibility(System.Boolean,System.Int32,System.Int32)
This function sets the grid visibility for a given grid line type and row type of the table object. Different grid line and row types can be combined..
visible:  Input visibility
borders:  Input grid line type for which to set the visibility
rows:  Input row type for which to set the visibility

Autodesk.AutoCAD.DatabaseServices.Table.TableStyleOverrides
This function returns the table style overrides. Table.TableStyleOverrides defines the values for table style overrides.

Autodesk.AutoCAD.DatabaseServices.Table.CellType(System.Int32,System.Int32)
Returns the cell type of the cell at the specified location in the table. Possible values for cell type are Table.TextCell and Table.BlockCell.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetCellType(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.TableCellType)
This function sets the cell type to be applied to the cell at the specified location in the table. Possible values for cell type are Table.TextCell and Table.BlockCell.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell
type:  Input enum value specifying the cell type

Autodesk.AutoCAD.DatabaseServices.Table.RowType(System.Int32)
Returns the row type of the specified row in the table. The row type may be TitleRow, HeaderRow, or DataRow.
row:  Input zero-based row index

Autodesk.AutoCAD.DatabaseServices.Table.IsAutoScale(System.Int32,System.Int32)
This function returns the status of the mBlockAutoFit flag at the specified cell in the table. If this flag is true, the Table object automatically computes the scale and insertion point for the block content in order to fit it into the specified cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetAutoScale(System.Int32,System.Int32,System.Boolean)
This function sets the auto fit flag, which determines whether to automatically fit the block into the specified cell. If autoFit is true, the Table object automatically computes the scale and insertion point for the block content in order to fit it into the specified cell..
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
autoFit:  Input Boolean indicating whether to auto fit the block at the specified cell

Autodesk.AutoCAD.DatabaseServices.Table.GetBlockAttributeValue(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function gets the attribute value from the block cell using the specified object ID key. If there is no overridden attribute value, it returns the default attribute value defined in the original AttributeDefinition object.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell
attributeDefinitionId:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object.

Autodesk.AutoCAD.DatabaseServices.Table.IsMergedCell(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellRange&)
This function returns true if the specified cell is within merged cells. The merged cell region is always a rectangular area.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
range:  Output the range of merged cells

Autodesk.AutoCAD.DatabaseServices.Table.GenerateLayout
This function will update the table object according to the current table style. It computes table geometry, including grid lines, text content, block content, and background fills, from given definition data and table style. The generated table geometry are maintained internally by member data mpEntities, which is a list of in-memory Entity pointers.

Autodesk.AutoCAD.DatabaseServices.Table.RecomputeTableBlock(System.Boolean)
This function updates the block table record the table object references to match any changes made to the table object since the last time the block table record was updated..
forceUpdate:  Input indicating whether to force an update on the screen

Autodesk.AutoCAD.DatabaseServices.Table.ReselectSubRegion(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
This function provides the subentities of the current subselection cells. The paths may be empty if there are no subselection cells.
paths:  Output array of FullSubentPath

Autodesk.AutoCAD.DatabaseServices.Table.IsEmpty(System.Int32,System.Int32)
Checks if the content of the specified cell is empty.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.GetMergeRange(System.Int32,System.Int32)
Returns merge range. The merge range will be invalid if the cell is not part of a merge range.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.IsFormatEditable(System.Int32,System.Int32)
This function checks the cell state to determine if a cell format can be modified. Applications should use this function to determine if a cell is editable instead of calling cellState directly and checking the state since the semantics of an editable cell may change as new states are added.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.DeleteContent(Autodesk.AutoCAD.DatabaseServices.CellRange)
Deletes all the contents in a range of cells.

Autodesk.AutoCAD.DatabaseServices.Table.GetIsAutoScale(System.Int32,System.Int32,System.Int32)
This function returns the status of the mBlockAutoFit flag at the specified cell in the table. If this flag is true, the Table object automatically computes the scale and insertion point for the block content in order to fit it into the specified cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetOverrides(System.Int32,System.Int32,System.Int32)
Read-only.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
contentIndex:  Input content index.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataLink(System.Int32,System.Int32)
Returns the id of the data link if the specified cell is linked to a data source using a data link. Returns null id if the cell is not linked using a data link.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.SetDataLink(Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Sets the specified data link in a cell..
range:  Input range to get the data links. If this is NULL it gets all the data links in the table.
dataLinkId:  Output reference to an array to receive the data link IDs.
bUpdate:  Input true if the data link is to be updated after setting it, false if not.

Autodesk.AutoCAD.DatabaseServices.Table.SetDataLink(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Sets the specified data link in a cell..
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
dataLinkId:  Input the data link object
bUpdate:  Input true if the data link is to be updated after setting it, false if not.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataLinkRange(System.Int32,System.Int32)
Returns the data link range if the specified cell is part of a linked range. Returns invalid range if the specified cell is not part of a linked range. The specified cell can be any cell in a linked range.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.CopyFrom(Autodesk.AutoCAD.DatabaseServices.Table,Autodesk.AutoCAD.DatabaseServices.TableCopyOptions,Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.CellRange)
Copies content and format from source table. The table copy options can be passed to specify what to copy. The source and target range can be specified. If the source and target range does not match then it is copied to a new range depending on the table option value.
source:  Input table source
options:  Input table copy options
sourceRange:  Input source cell range
targetRange:  Input target cell range

Autodesk.AutoCAD.DatabaseServices.Table.CopyFrom(Autodesk.AutoCAD.DatabaseServices.LinkedTableData,Autodesk.AutoCAD.DatabaseServices.TableCopyOptions,Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.CellRange)
Copies content and format from source table. The table copy options can be passed to specify what to copy. The source and target range can be specified. If the source and target range does not match then it is copied to a new range depending on the table option value.
source:  Input source table
options:  Input copy option
sourceRange:  Input source cell range
targetRange:  Input target cell range

Autodesk.AutoCAD.DatabaseServices.Table.CopyFrom(Autodesk.AutoCAD.DatabaseServices.LinkedTableData,Autodesk.AutoCAD.DatabaseServices.TableCopyOptions)
Copies content and format from source table. The table copy options can be passed to specify what to copy.
source:  Input source table
options:  Input copy option

Autodesk.AutoCAD.DatabaseServices.Table.SubSelection
Returns range of cells in the subselection set. Returns invalid range if there are no subselection cells.

Autodesk.AutoCAD.DatabaseServices.Table.HasSubSelection
Returns true if the table has a  subselection set. Otherwise, returns false.

Autodesk.AutoCAD.DatabaseServices.Table.BreakFlowDirection
Returns the table break flow direction of the table. The break flow direction determines the positioning of the tables when the table break is enabled.