Autodesk.AutoCAD.DatabaseServices.Mline.AppendSegment(Autodesk.AutoCAD.Geometry.Point3d)
Projects newVertex along the MLine object's normal vector onto the plane defined by the normal vector and the first vertex of the MLine object. The result of this projection is appended to the end of the MLine object's vertex list. This generates a new MLine object segment between the previously "last" vertex and the newly added vertex.
newVertex:  Input new vertex point (in WCS) to be added

Autodesk.AutoCAD.DatabaseServices.Mline.RemoveLastSegment(Autodesk.AutoCAD.Geometry.Point3d)
Removes the last vertex in the MLine object's vertex array. The value of the new "last" vertex is then copied into lastVertex.
lastVertex:  Returns filled in with the value of the vertex that becomes last when current last is removed

Autodesk.AutoCAD.DatabaseServices.Mline.Element(Autodesk.AutoCAD.Geometry.Point3d)
This function attempts to find which element of the MLine object contains the point pt. If an element is not found that directly contains the point and the MLine object is not closed, then the ends of the MLine object are "virtually" extended to see if pt lies in the path of any element.
pt:  Input search point

Autodesk.AutoCAD.DatabaseServices.Mline.Scale
Accesses the current scale value in use by the MLine object. The scale value controls the overall width of the MLine object. This scale doesn't affect linetype scale.

Autodesk.AutoCAD.DatabaseServices.Mline.SupressStartCaps
Assesses if startcaps are currently suppressed for the MLine object. Conditions.