Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.#ctor(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Double,System.Double)
Parameterized constructor. The axesAngle and rotation parameters are in degrees.