Autodesk.AutoCAD.DatabaseServices.Body.#ctor
Default constructor. Initializes the change count to 0 and IsNull to true.

Autodesk.AutoCAD.DatabaseServices.Body.AcisOut(System.String,Autodesk.AutoCAD.DatabaseServices.DBObjectCollection)
This method writes out all the entities in to the fileName file. The collection may contain any kind of entity, but only objects of the classes Region, Solid3d, Body, or classes derived from these, are written out to the file. The file generated is an ASCII ACIS SAT format file.
fileName:  Input the file name to write data to.
entitiesOutToFile:  Input a collection containing all the Entity objects that are to be written out to the file

Autodesk.AutoCAD.DatabaseServices.Body.AcisIn(System.String)
This method reads in all the ACIS entities from the fileName ASCII ACIS SAT file. It then creates Line, Circle, Arc, Ellipse, Spline, Region, Solid3d, or Body objects for each one as appropriate, and adds them to the returned collection.
fileName:  Input the file name of ASCII ACIS SAT file to be read in.

Autodesk.AutoCAD.DatabaseServices.Body.UsesGraphicsCache
This property is a wrapper for the AcDbBody::usesGraphicsCache() method which is used by AutoCAD to determine whether or not to use cached graphics for the region. If the method returns true, then cached graphics will be used. Only database resident entities can use graphics caching, so this method is not called for entities not in an AcDbDatabase.