Autodesk.AutoCAD.DatabaseServices.ResultBuffer.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.ToString
Returns an equivalent string representation of this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
provider:  Input culture definition

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in a specific format, with the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
format:  Input format for string
provider:  Input culture definition