Autodesk.AutoCAD.DatabaseServices.DBPoint.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs a point that uses position for its position value. The normal is initialized to (0,0,1) (in WCS coordinates), the OCS rotation to 0, and the thickness to 0.
position:  Input position (in WCS coordinates) for the point

Autodesk.AutoCAD.DatabaseServices.DBPoint.Thickness
Accesses the point's thickness value. The thickness is the point's dimension along its normal vector direction (sometimes called the extrusion direction).

Autodesk.AutoCAD.DatabaseServices.DBPoint.Normal
Accesses unit normal vector for the point in WCS coordinates. The normal is used as the extrusion direction when the point has non-zero thickness. The normal also determines the plane used to display the point when PDMODE is set to display the point as something other than a ".".

Autodesk.AutoCAD.DatabaseServices.DBPoint.EcsRotation
Accesses the angle (in radians) between the OCS (formerly ECS) X axis for the point (based on the point's normal vector) and the X axis that will be used when displaying the point. This is used when PDMODE is set to display the point as something other than a ".".