Autodesk.AutoCAD.DatabaseServices.Filters.Index.RebuildFull(Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData)
This function completely rebuilds the index from the entities in the associated block table record. Implementation is needed at the concrete class. The concrete class should supermessage the base class.
indexData:  Input IndexUpdateData object for use during the index rebuild

Autodesk.AutoCAD.DatabaseServices.Filters.Index.ObjectBeingIndexedId
Accesses Index objects are associated with Block Table Records, and indirectly owned by them. This function returns the parent block table record ID. This method has a concrete implementation.

Autodesk.AutoCAD.DatabaseServices.Filters.Index.LastUpdatedAt
Accesses the TDUPDATE value of the Database when the index was last updated. This is particularly useful when using index objects in saved drawings. For example, if the TDUPDATE value is not equal to the LastUpdatedAt timestamp, the index is stale. This has a concrete implementation.

Autodesk.AutoCAD.DatabaseServices.Filters.Index.IsUptoDate
Accesses information in addition to TDUPDATE to verify the up-to-date status. This can be used to verify the validity within a session (as opposed to the TDUPDATE value being compared to LastUpdatedAt). This has a concrete implementation.