Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry
This lightweight class represents an entry in a DatabaseServices.DBDictionary object. It contains the key and object ID of the entry, but does not contain the entry itself.

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.ToString
Returns an equivalent string representation of this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider. See the Microsoft .NET API documentation for details.
provider:  Input System.IFormatProvider object.