Autodesk.AutoCAD.Windows.StatusBarItem.MouseDown
Wraps the following functions:.

Autodesk.AutoCAD.Windows.StatusBarItem.PointToClient(System.Drawing.Point)
Wraps AcStatusBarItem.ScreenToClient. This function converts the screen coordinates of a specified point on the screen to client-area coordinates. The new coordinates are relative to the upper-left corner of the status bar control window client area.
p:  Input or POINT structure that contains the screen coordinates to be converted.

Autodesk.AutoCAD.Windows.StatusBarItem.PointToScreen(System.Drawing.Point)
Wraps AcStatusBarItem.ClientToScreen. This function uses the status bar control window's client coordinates in the POINT structure or in the CPoint object pointed to by p to compute new screen coordinates. It then replaces the coordinates in the structure with the new coordinates. The new screen coordinates are relative to the upper-left corner of the system display.
p:  Input or POINT structure that contains the client coordinates to be converted.