Autodesk.AutoCAD.Windows.PaneCollection.Add(Autodesk.AutoCAD.Windows.Pane)
Adds the object represented by value to this collection. Returns the zero-based index of the newly added collection item.
value:  Input object to add