Autodesk.AutoCAD.ApplicationServices.Application


Autodesk.AutoCAD.ApplicationServices.Application.InvokeContextHelp(System.IntPtr,System.Int32,System.String)
Calls context help with a set prefix.
window:  Input window
contextId:  Input context ID
helpPrefix:  Input help prefix

Autodesk.AutoCAD.ApplicationServices.Application.InvokeContextHelp(System.IntPtr,System.Int32)
Calls the context help with a null helpPrefix.
window:  Input window
contextId:  Input context ID

Autodesk.AutoCAD.ApplicationServices.Application.InvokeHelp(System.String,System.String)
Calls the help document with a specific topic.
fileName:  Input name of help file
topic:  Input topic to open

Autodesk.AutoCAD.ApplicationServices.Application.SetCurrentWorkspace(System.String)
Sets the current workspace.

Autodesk.AutoCAD.ApplicationServices.Application.ShowModalWindow(System.Uri)
Use this function to launch a modal dialog with the specified URI. The window hosts a browser window which displays the html page.
htmlPage:  URI of the page to be loaded into the modal window

Autodesk.AutoCAD.ApplicationServices.Application.ShowModalWindow(System.IntPtr,System.Uri)
Use this function to launch a modal dialog with the specified URI. The window hosts a browser window which displays the html page.
owner:  Owner Window
htmlPage:  URI of the page to be loaded into the modal window

Autodesk.AutoCAD.ApplicationServices.Application.ShowModalWindow(System.IntPtr,System.Uri,System.Boolean)
Use this function to launch a modal dialog with the specified URI. The window hosts a browser window which displays the html page.
owner:  Owner Window
htmlPage:  URI of the page to be loaded into the modal window
persistSizeAndPosition:  Saves the current size and position of the window if set to true

Autodesk.AutoCAD.ApplicationServices.Application.ShowModelessWindow(System.Uri)
Use this function to launch a modeless dialog with the specified URI. The window hosts a browser window which displays the html page.
htmlPage:  URI of the page to be loaded into the modeless window

Autodesk.AutoCAD.ApplicationServices.Application.ShowModelessWindow(System.IntPtr,System.Uri)
Use this function to launch a modeless dialog with the specified URI. The window hosts a browser window which displays the html page.
owner:  Owner Window
htmlPage:  URI of the page to be loaded into the modeless window

Autodesk.AutoCAD.ApplicationServices.Application.ShowModelessWindow(System.IntPtr,System.Uri,System.Boolean)
Use this function to launch a modeless dialog with the specified URI. The window hosts a browser window which displays the html page.
owner:  Owner Window
htmlPage:  URI of the page to be loaded into the modeless window
persistSizeAndPosition:  _nt_