Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreatePalette(Autodesk.AutoCAD.Windows.ToolPalette.Catalog,System.String)
Creates a Palette, and adds it to the catalog passed in. It then returns the palette.
catalogName:  Input catalog name
paletteName:  Input palette name

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreateTool
Creates the tool object. The returned pointer is allocated in the heap and should be deleted after use.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.BeginEdit
Called by the framework before displaying the dialog to edit the tool properties. The framework calls this method after calling the Load() method. This method is called only when the editing is handled by the framework. It is not called if the editing is handled by the tool.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.New
The framework calls this method to create a new tool. The tool uses this call to initialize the tool data members.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetDropTarget
The framework calls this method to get the IDropTarget interface from the tool. If the tool wishes to support drag-and-drop objects, it must implement this interface and pass it to the framework through this method.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.ValidateEditChanges
Called by the framework when a tool is edited in the framework's default tool properties editor and the user presses OK. The tool should validate any data changed by the user.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetToolProperties
Gets the IUnknown of IAcadToolProperties. The implementation class for IAcadTool should cache the IAcadToolProperties pointer passed into the SetToolProperties() method, and return that pointer in this function's toolProperties parameter.