Autodesk.AutoCAD.Windows.PaletteSet
This .NET class wraps the AduiPaletteSet ObjectARX class. This class now supports themed icons for the Palette set icon that is displayed in the caption of the palette set. The new Theme-based Icon methods supercede the SetIcon and GetIcon methods of a Winforms of WPF palette set is to be themed. If a palette set does not support theming, then the new themed APIs need not be used.

Autodesk.AutoCAD.Windows.PaletteSet.EnableTransparency(System.Boolean)
This function is equivalent to CAdUiPaletteSet::SetAllowTransparency()..
value:  Input true to enable transparency