Autodesk.AutoCAD.Windows.MenuItemCollection.Contains(Autodesk.AutoCAD.Windows.MenuItem)
Determines whether an element is in the MenuItemCollection. Returns true if value is found in the MenuItemCollection; otherwise, returns false.
value:  Input the MenuItem to locate in this collection; the value can be a null reference.

Autodesk.AutoCAD.Windows.MenuItemCollection.Add(Autodesk.AutoCAD.Windows.MenuItem)
Adds an object to the end of the MenuItemCollection. Returns the MenuItemCollection index at which the value has been added.
value:  Input the MenuItem to be added to the end of this collection; the value can be a null reference.