Autodesk.AutoCAD.Windows.Pane.MinimumWidth
Returns the new minimum width for the pane (in logical units). When an icon is displayed in the pane, any value less than the icon width (16) is ignored. The default minimum pane width is 0.

Autodesk.AutoCAD.Windows.Pane.MaximumWidth
Returns the maximum width for the pane, in logical units. The default maximum pane width is 0, which means the pane will be sized according to the pane text. This value is ignored when an icon is displayed in the pane.