Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.Closed
Wraps the following functions:.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.IconType
Wraps the following functions: AcTrayItemBubbleWindowControl.GetIconType, AcTrayItemBubbleWindowControl.SetIconType.