Autodesk.AutoCAD.Windows.TrayItem.ShowBubbleWindow(Autodesk.AutoCAD.Windows.TrayItemBubbleWindow)
Wraps AcTrayItem.ShowBubbleWindow. Displays a bubble notification window next to the tray item icon in the tray icon area of the status bar. The bubble window base point is centered on the tray item icon.
bubble:  Input bubble to show