Autodesk.AutoCAD.Windows.TrayItemCollection.Add(Autodesk.AutoCAD.Windows.TrayItem)
Adds the object represented by value to this collection. Returns the zero-based index of the newly added collection item.
value:  Input value to add

Autodesk.AutoCAD.Windows.TrayItemCollection.IsFixedSize
True if the TrayItemCollection has a fixed size; otherwise, false. The default is false.

Autodesk.AutoCAD.Windows.TrayItemCollection.IsReadOnly
True if the TrayItemCollection is read-only; otherwise, false. The default is false.