Autodesk.AutoCAD.Windows.IconType
This .NET enum wraps the possible values returned by the AcTrayItemBubbleWindowControl.GetIconType() ObjectARX function. This function returns the bubble window icon type.